        COPY "kllnc.lib".
        COPY "prosif.lib".
        COPY "errorlog.lib".
        COPY "logindex.lib".
        COPY "genelfis.lib".
        COPY "genel.lib".
        copy "odalar.lib".

