*
 fd mailhtml label record standard.
   01 mailhtml-rec.
     02 mailhtml-anah.
       03 mailhtml-no            pic x(2).
       03 mailhtml-tip           pic x(2).
     02 mailhtml-dil              pic x(40).
     02 mailhtml-body             pic x(20000).
     02 mailhtml-filler           pic x(1000).

