        COPY "menutext.lib".
        COPY "prosif.lib".
        COPY "kllnc.lib".
        COPY "isyeri.lib".
        COPY "ajanda.lib".
        COPY "errorlog.lib".
        COPY "takvim.lib".
        COPY "genel.lib".
        COPY "genelfis.lib".                                                    
        COPY "odalar.lib".                                                    
        COPY "logindex.lib".                                                    
