  
*
$XFD FILE=musteri
FD misafir LABEL RECORD STANDARD.
01 misafir-REC.
   02 misafir-anah.
      03 misafir-tip                   pic x.
      03 m-profil.
         05 misafir-sirket                pic x(08).
         05 misafir-no                    pic 9(08).
      03 misafir-bos-anah              pic x(10).
$XFD USE GROUP
   02 misafir-adi.
      03 filler-a2                        pic x.
      03 misafir-adi2.
         04 filler-a3                  pic x.
         04 misafir-adi3               pic x(18). 
$XFD USE GROUP
   02 misafir-soyadi.
      03 filler-s3                     pic x.
      03 misafir-soyadi2.
         04 filler-s4                  pic x.
         04 misafir-soyadi3            pic x(18).                          
*(( XFD DATE=YYYYMMDD, USE GROUP ))
$XFD NAME=misafir-d-tarih
   02 misafir-d-tarihi.
      03 misafir-dyil                  pic 9(4).
      03 misafir-day                   pic 9(2).
      03 misafir-dgun                  pic 9(2).
*(( XFD DATE=YYYYMMDD, USE GROUP ))
$XFD NAME=misafir-e-tarih
   02 misafir-e-tarihi.
      03 misafir-eyil                  pic 9(4).
      03 misafir-eay                   pic 9(2).
      03 misafir-egun                  pic 9(2).
*(( XFD DATE=YYYYMMDD, USE GROUP ))
$XFD NAME=misafir-o-tarih
   02 misafir-o-tarihi.
      03 misafir-oyil                  pic 9(4).
      03 misafir-oay                   pic 9(2).
      03 misafir-ogun                  pic 9(2).


02 misafir-gerekli.
   03 misafir-kaynak                   pic x(02).
   03 misafir-ulke                     pic x(03).
   03 misafir-dil-1                    pic x(02).
   03 misafir-dil-2                    pic x(02).
   03 misafir-dil-3                    pic x(02).
   03 misafir-din                      pic x(02).
   03 misafir-unvan                    pic x(20).
   03 misafir-cinsiyet                 pic x.
   03 misafir-meslek                   pic x(20).
   03 misafir-e-mail                   pic x(40).
   03 misafir-web-adresi               pic x(40).
   03 misafir-kis-adrs                 pic x(50).
   03 misafir-kis-adrs1                pic x(50).
$XFD HIDDEN
   03 misafir-kart-tipi                pic x(2).
$XFD HIDDEN
   03 misafir-gelis-sayisi             pic 9(3).
$XFD HIDDEN
   03 misafir-gecmis-cl-tut            pic 9(8)v99.
   03 misafir-aciklama                 pic x(40).
*/:-) Fatura bilgileri 
   03 misafir-unvan1                   pic x(50).   
   03 misafir-unvan2                   pic x(50).
   03 misafir-adres1                   pic x(50).   
   03 misafir-adres2                   pic x(50).
   03 misafir-vdairesi                 pic x(20).
   03 misafir-vno                      pic x(15).
*   02 misafir-vno                      pic x(10).
   03 misafir-il                       pic x(20).
   03 misafir-ilce                     pic x(20).
   03 misafir-tel1                     pic x(15).
   03 misafir-tel2                     pic x(15).
   03 misafir-tel3                     pic x(15).
   03 misafir-fax                      pic x(15).
   03 misafir-gsm                      pic x(15).
   03 misafir-pk                       pic x(10).
*/:-) Diger B?lgiler
02 gereksiz.
   03 misafir-hobi1                    pic x(02).
   03 misafir-hobi2                    pic x(02).
   03 misafir-hobi3                    pic x(02).
   03 misafir-hobi4                    pic x(02).
   03 misafir-gazete-1                 pic x(02).
   03 misafir-gazete-2                 pic x(02).
   03 misafir-gazete-3                 pic x(02).
   03 misafir-tv-kanali-1              pic x(02).
   03 misafir-tv-kanali-2              pic x(02).
   03 misafir-tv-kanali-3              pic x(02).
   03 misafir-tv-prog-1                pic x(02).
   03 misafir-tv-prog-2                pic x(02).
   03 misafir-tv-prog-3                pic x(02).
   03 misafir-arac-model               pic x(18).
   03 misafir-gizlilik                 pic 9.
   03 misafir-silindi                  pic 9.
   03 misafir-plaka                    pic x(14).
   03 misafir-mail-durumu              pic 9.
*/:-) Odeme Bilgileri
   03 misafir-odeme-tipi               pic x.
   03 misafir-odeme-kart-tipi          pic x.
   03 misafir-kart-sahibi              pic x(25).
   03 misafir-muhasebe-kodu            pic x(15). 
   03 misafir-kart-no                  pic x(40).
$XFD HIDDEN

   03 misafir-son-k-tarih.
     04 misafir-son-k-ay               pic 9(02).
     04 misafir-son-k-yil              pic 9(04).
   03 misafir-g-kodu                   pic x(03).
*/:-)kimlik bilgileri
$XFD ALPHA
   03 misafir-kim-tcno                 pic 9(11).
   03 misafir-kim-uyruk                pic x(03).
   03 misafir-kim-cinsiyet             pic x.
   03 misafir-kim-medeni               pic x.
   03 misafir-kim-adrs                 pic x(50).
   03 misafir-kim-adrs1                pic x(50).
   03 misafir-b-turu                   pic x.
   03 misafir-seri-no                  pic x(15).
   03 misafir-baba-adi                 pic x(20).
   03 misafir-ana-adi                  pic x(20).
   03 misafir-d-yeri                   pic x(30).
   03 misafir-kim-il                   pic x(20).
   03 misafir-kim-ilce                 pic x(20).
   03 misafir-kim-mahalle              pic x(20).
   03 misafir-kim-cilt                 pic x(10).
   03 misafir-kim-aile-no              pic x(10).
   03 misafir-kim-sira-no              pic x(10). 
$XFD HIDDEN
   03 misafir-k-tarih.
     04 misafir-k-yil                  pic 9(04).
     04 misafir-k-ay                   pic 9(02).
     04 misafir-k-gun                  pic 9(02).  
$XFD HIDDEN
   03 misafir-g-tarih.
     04 misafir-g-yil                  pic 9(04).
     04 misafir-g-ay                   pic 9(02).
     04 misafir-g-gun                  pic 9(02).
$XFD HIDDEN
   03 misafir-prb-ack                  pic x.
$XFD HIDDEN
   03 misafir-fat-ulke                 pic x(15).
$XFD HIDDEN
   03 misafir-kazanilan-puan           pic 9(6).
$XFD HIDDEN
   03 misafir-kullanilan-puan          pic 9(6).
$XFD HIDDEN
   03 misafir-puan-kart-no             pic x(16).
$XFD HIDDEN
   03 misafir-hak-edilen-tip           pic x(02).
$XFD HIDDEN
   03 misafir-kart-tipi-2              pic x(02).
$XFD HIDDEN
   03 misafir-gecmis-kalis-sayisi      pic 9(2).
*   02 misafir-bos                      pic x(08).
$XFD HIDDEN
   03 misafir-staf-ilk                 pic x(04).
$XFD HIDDEN
   03 misafir-staf-son                 pic x(04).


$XFD FILE=orjmusteri
*
 FD musteri LABEL RECORD STANDARD.
 01 musteri-REC.
   02 musteri-anah.
      03 musteri-tip                   pic x.
      03 m-profil1.
	      05 musteri-sirket                pic x(08).
	      05 musteri-no                    pic 9(08).
      03 musteri-bos-anah              pic x(10).
$XFD NAME=musteri-adi  
   02 musteri-adi.
      03 filler-a2                        pic x.
      03 musteri-adi2.
         04 filler-a3                     pic x.
         04 musteri-adi3               pic x(18). 
   02 filler-a1 REDEFINES musteri-adi.
      03 musteri-adi5                  pic x(3).
      03 filler-s2                        pic x(17).  
$XFD NAME=musteri-soyadi           
   02 musteri-soyadi.
      03 filler-s3                        pic x.
      03 musteri-soyadi2.
         04 filler-s4                     pic x.
         04 musteri-soyadi3            pic x(18).                          
   02 filler-s1 REDEFINES musteri-soyadi.
      03 musteri-soyadi5                  pic x(3).
      03 filler-s5                        pic x(17).                    
   02 musteri-d-tarihi.
      03 musteri-dyil                  pic 9(4).
      03 musteri-day                   pic 9(2).
      03 musteri-dgun                  pic 9(2).
*(( XFD DATE=YYYYMMDD, USE GROUP ))
$XFD NAME=MUSTERI_E_TARIH
   02 musteri-e-tarihi.
      03 musteri-eyil                  pic 9(4).
      03 musteri-eay                   pic 9(2).
      03 musteri-egun                  pic 9(2).
   02 musteri-o-tarihi.
      03 musteri-oyil                  pic 9(4).
      03 musteri-oay                   pic 9(2).
      03 musteri-ogun                  pic 9(2).
   02 musteri-kaynak                   pic x(02).
   02 musteri-ulke                     pic x(03).
   02 musteri-dil-1                    pic x(02).
   02 musteri-dil-2                    pic x(02).
   02 musteri-dil-3                    pic x(02).
   02 musteri-din                      pic x(02).
   02 musteri-unvan                    pic x(10).
   02 musteri-kis-il                   pic x(15).
   02 musteri-kis-ilce                 pic x(16).
*   02 musteri-cinsiyet                 pic x.
*   02 musteri-meslek                   pic x(20).
   02 musteri-e-mail                   pic x(40).
   02 musteri-web-adresi               pic x(40).
   02 musteri-kis-adrs                 pic x(50).
   02 musteri-kis-adrs1                pic x(50).
   02 musteri-kart-tipi                pic x(2).
   02 musteri-gelis-sayisi             pic 9(3).
   02 musteri-gecmis-cl-tut            pic 9(8)v99.
   02 musteri-aciklama                 pic x(40).
*/:-) Fatura bilgileri 
   02 musteri-unvan1                   pic x(50).   
   02 musteri-unvan2                   pic x(50).
   02 musteri-adres1                   pic x(50).   
   02 musteri-adres2                   pic x(50).
   02 musteri-vdairesi                 pic x(20).
   02 musteri-vno                      pic x(15).
*   02 musteri-vno                      pic x(10).
   02 musteri-il                       pic x(20).
   02 musteri-ilce                     pic x(20).
   02 musteri-tel1                     pic x(15).
   02 musteri-tel2                     pic x(15).
   02 musteri-tel3                     pic x(15).
   02 musteri-fax                      pic x(15).
   02 musteri-gsm                      pic x(15).
   02 musteri-pk                       pic x(10).
   02 musteri-kol-bandi                pic x(26).
*/:-) Diger BÝlgiler
*   02 musteri-hobi1                    pic x(02).
*   02 musteri-hobi2                    pic x(02).
*   02 musteri-hobi3                    pic x(02).
*   02 musteri-hobi4                    pic x(02).
*   02 musteri-gazete-1                 pic x(02).
*   02 musteri-gazete-2                 pic x(02).
*   02 musteri-gazete-3                 pic x(02).
*   02 musteri-tv-kanali-1              pic x(02).
*   02 musteri-tv-kanali-2              pic x(02).
*   02 musteri-tv-kanali-3              pic x(02).
*   02 musteri-tv-prog-1                pic x(02).
*   02 musteri-tv-prog-2                pic x(02).
*   02 musteri-tv-prog-3                pic x(02).
*(( XFD DATE=YYYYMMDDHHNNSS, USE GROUP ))
$XFD NAME=MUSTERI_GUNCELLEME_TARIHI
   02 musteri-edit.
      03 musteri-edit-tarih.
         04 musteri-edit-yil           pic 9(04).
         04 musteri-edit-ay            pic 9(02).
         04 musteri-edit-gun           pic 9(02).
      03 musteri-edit-zaman.
         04 musteri-edit-saat          pic 9(02).
         04 musteri-edit-dakika        pic 9(02).
         04 musteri-edit-saniye        pic 9(02).

   02 musteri-arac-model               pic x(03).
   02 musteri-gizlilik                 pic 9.
   02 musteri-uygulama-dahil           pic 9.
   02 musteri-silindi                  pic 9.
   02 musteri-personel-bilinci         pic 9.
   02 musteri-plaka                    pic x(13).
   02 musteri-mail-durumu              pic 9.
*/:-) Odeme Bilgileri
   02 musteri-odeme-tipi               pic x.
   02 musteri-odeme-kart-tipi          pic x.
   02 musteri-kart-sahibi              pic x(25).
   02 musteri-muhasebe-kodu            pic x(15).
   02 musteri-vucut-isisi              pic 99v99.
   02 musteri-hes-kodu                 pic x(12).
   02 musteri-kart-no                  pic x(24).
   02 musteri-son-k-tarih.
     03 musteri-son-k-ay               pic 9(02).
     03 musteri-son-k-yil              pic 9(04).
   02 musteri-g-kodu                   pic x(03).
*/:-)kimlik bilgileri
   02 musteri-kim-tcno                 pic 9(11).
   02 musteri-kim-uyruk                pic x(03).
   02 musteri-kim-cinsiyet             pic x.
   02 musteri-kim-medeni               pic x.
   02 musteri-kim-adrs                 pic x(50).
   02 musteri-kim-adrs1                pic x(50).
   02 musteri-b-turu                   pic x.
   02 musteri-seri-no                  pic x(15).
   02 musteri-baba-adi                 pic x(20).
   02 musteri-ana-adi                  pic x(20).
   02 musteri-d-yeri                   pic x(30).
   02 musteri-kim-il                   pic x(20).
   02 musteri-kim-ilce                 pic x(20).
   02 musteri-kim-mahalle              pic x(20).
   02 musteri-kim-cilt                 pic x(10).
   02 musteri-kim-aile-no              pic x(10).
   02 musteri-kim-sira-no              pic x(10).
   02 musteri-k-tarih.
     03 musteri-k-yil                  pic 9(04).
     03 musteri-k-ay                   pic 9(02).
     03 musteri-k-gun                  pic 9(02).
   02 musteri-g-tarih.
     03 musteri-g-yil                  pic 9(04).
     03 musteri-g-ay                   pic 9(02).
     03 musteri-g-gun                  pic 9(02).
   02 musteri-prb-ack                  pic x.
   02 musteri-fat-ulke                 pic x(15).
   02 musteri-kazanilan-puan           pic 9(6).
   02 musteri-kullanilan-puan          pic 9(6).
   02 musteri-puan-kart-no             pic x(16).

   02 musteri-hak-edilen-tip           pic x(02).
   02 musteri-kart-tipi-2              pic x(02).

   02 musteri-gecmis-kalis-sayisi      pic 9(2).
*   02 musteri-bos                      pic x(08).
   02 musteri-staf-ilk                 pic x(04).
   02 musteri-staf-son                 pic x(04).

*
 FD hediye LABEL RECORD STANDARD.
 01 hediye-REC.
    02 hediye-ANAH.
       03 hediye-KODU       PIC X(02).
    02 hediye-adi           pic x(30).
    02 hediye-ozellikler.
       03 hediye-puan       pic 9(6).
       03 hediye-bos        pic x(500).
*
 FD hediyhrk LABEL RECORD STANDARD.
 01 hediyhrk-REC.
    02 hediyhrk-ANAH.
       03 hediyhrk-tarih. 
          05 hediyhrk-yil         pic 9(4).
          05 hediyhrk-ay          pic 9(2).
          05 hediyhrk-gun         pic 9(2).
       03 hediyhrk-profil-anah.
          05 hediyhrk-sirket      pic x(08).
          05 hediyhrk-musteri-no  pic 9(08).
       03 hediyhrk-islem-no       pic 9(6).
    02 hediyhrk-diger.
       03 hediyhrk-hediye-kodu    pic x(02).
       03 hediyhrk-hediye-puan    pic 9(06).
       03 hediyhrk-aciklama       pic x(100).
       03 hediyhrk-bos            pic x(500).
       03 hediyhrk-staf           pic x(04).
*
 FD karttip LABEL RECORD STANDARD.
 01 karttip-REC.
    02 karttip-ANAH.
       03 karttip-KODU       PIC X(02).
    02 karttip-adi           pic x(20).
    02 karttip-ozellikler.
       03 karttip-resim-adi  pic x(30).
       03 karttip-puan       pic 9(6).
       03 karttip-alt-puan   pic 9(9)v99.
       03 karttip-ust-puan   pic 9(9)v99.
       03 karttip-bos        pic x(442).
*
 FD pformul LABEL RECORD STANDARD.
 01 pformul-REC.
          02 pformul-ANAHTAR.
             03 pformul-sira        pic x(03).   
             03 pformul-anah-bos    pic x(20).   
          02 pformul-data.
                05 pformul-tarih.
                  09 pformul-yil            pic 9(4).
                  09 pformul-ay             pic 9(2).
                  09 pformul-gun            pic 9(2).
                05 pformul-gel-carpan       pic 9(6)v99.
                05 pformul-gec-carpan       pic 9(6)v99.
                05 pformul-tut-carpan       pic 9(3)v9(5).
                05 pformul-bos               pic x(40).
                05 filler occurs 50 times.
                   09 pformul-ust-sinir     pic 9(8) .
                   09 pformul-ust-carpan    pic 9(5)v9(6).
                   09 filler pic x(20).
          02 pformul-STAF                   PIC X(04).
        
