        COPY "takvim.lib".
        COPY "kllnc.lib".
        COPY "errorlog.lib".
        copy "satkod.lib"  of "../../cost/lib-sel".
        COPY "demi.lib".
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".
        COPY "genel.lib".                                            
         COPY "konuk.lib".
         COPY "dokumer.lib".
