*
          COPY "genel.lib". 
          COPY "genelfis.lib".                                                     
          COPY "kllnc.lib". 
          COPY "prosif.lib". 
          COPY "menutext.lib". 
          COPY "errorlog.lib".         
          COPY "logindex.lib".  
          copy "odalar.lib".
