         COPY "errorlog.lib".                                                    
         COPY "logindex.lib".
         copy "isyeri.lib".
         copy "genel.lib".
         copy "takvim.lib".
         copy "genelfis.lib".
         copy "ototakip.lib".
         copy "kllnc.lib".
         copy "konuk.lib".
         COPY "dokumer.lib"     OF "..\..\OTEL\LIB-SEL".
