fd telayarq LABEL RECORD STANDARD.
01 telayarq-rec.
    05 telayarq-anah.
       10 telayarq-odano     pic x(04).
       10 telayarq-folio     pic 9(08).
       10 telayarq-tarih      pic x(08).
       10 telayarq-saat      pic 9(08).
       10 telayarq-islem     pic xx.
       10 telayarq-param     pic x(30).
    05 telayarq-adi      pic x(20).
    05 telayarq-soy       pic x(20).
    05 telayarq-bos       pic x(60).
   