       FD esFIYATANA LABEL RECORD STANDARD.
       01 esFIYATANA-REC.
          02 esFIYATANA-ANAH.
             03 esFIYATANA-DIGER-ANAH.
                  04 esFIYATANA-PER-ANAH.
                     05 esFIYATANA-ACENTA     PIC X(4).
                     05 esFIYATANA-ILK-TARIH.
                        06 esFIYATANA-ILK-YIL PIC 9999.
                        06 esFIYATANA-ILK-AY  PIC 99.
                        06 esFIYATANA-ILK-GUN PIC 99.
                     05 esFIYATANA-SON-TARIH.
                        06 esFIYATANA-SON-YIL PIC 9999.
                        06 esFIYATANA-SON-AY  PIC 99.
                        06 esFIYATANA-SON-GUN PIC 99.
                   04 esFIYATANA-REZ-TIPI   PIC 9.
                   04 esFIYATANA-PAN-TIPI   PIC XX.
                   04 esFIYATANA-BANKA      PIC 99.
                   04 esFIYATANA-DOVIZ      PIC 99.
                   04 esFIYATANA-ANLASMA    PIC XX.
             03 esFIYATANA-BUYUK      PIC 99.
             03 esFIYATANA-KUCUK      PIC 99.
          02 esFIYATANA-ODA-DIZI.
             03 esFIYATANA-KONUM-DIZI OCCURS 19 TIMES.
                04 esFIYATANA-ODA-FIYATI PIC 9(12)V99 COMP-3.
          02 esFIYATANA-KICK-BACK     PIC 999.
          02 esFIYATANA-EB-EH         PIC X.
          02 esFIYATANA-EB-ORAN       PIC 9(2).
          02 esFIYATANA-EB-BAS-TARIH.
             03 esFIYATANA-EB-BAS-YIL PIC 9(4).     
             03 esFIYATANA-EB-BAS-AY  PIC 9(2).     
             03 esFIYATANA-EB-BAS-GUN PIC 9(2).     
          02 esFIYATANA-EB-BIT-TARIH.
             03 esFIYATANA-EB-BIT-YIL PIC 9(4).     
             03 esFIYATANA-EB-BIT-AY  PIC 9(2).     
             03 esFIYATANA-EB-BIT-GUN PIC 9(2).

          02 esFIYATANA-UG-EH         PIC X.
          02 esFIYATANA-UG-ORAN       PIC 9(2).
          02 esFIYATANA-UG-geceleme   PIC 9(3).
          02 esFIYATANA-UG-BAS-TARIH.
             03 esFIYATANA-UG-BAS-YIL PIC 9(4).     
             03 esFIYATANA-UG-BAS-AY  PIC 9(2).     
             03 esFIYATANA-UG-BAS-GUN PIC 9(2).     
          02 esFIYATANA-UG-BIT-TARIH.
             03 esFIYATANA-UG-BIT-YIL PIC 9(4).     
             03 esFIYATANA-UG-BIT-AY  PIC 9(2).     
             03 esFIYATANA-UG-BIT-GUN PIC 9(2).
          02 esFIYATANA-ACIKLAMA      PIC X(20).
          02 esfiyatana-fiks          pic 9.
          02 esfiyatana-eb-kusur      pic 99.
          02 esfiyatana-ug-kusur      pic 99.
          02 esFIYATANA-KICK-BACK2    PIC 999.
          02 esfiyatana-d-1yc         pic 99.
          02 esfiyatana-d-1yf         pic 99.
          02 esfiyatana-d-2yc         pic 99.
          02 esfiyatana-d-2yf         pic 99.
          02 esFIYATANA-BOS           PIC X(04).
          02 esFIYATANA-STAF          PIC X(04).

********* Fiyatana-konum-dizi -> Fiyatin oda tipi (standart,suit...)
********* Fiyat-Rez-tipi      -> Fiyatin rezervasyon tipi 1-Alotment 2-It.
********* Fiyat-Pan-tipi      -> Fiyatin Pansiyon    tipi BO,BB,HB,FB,HI..
********* Fiyat-Banka         -> Hangi banka ile calisiliyor..............
********* Fiyat-Doviz         -> Hangi kur ile calisiliyor................
********* Fiyatana-Anlasma    -> Aanlasma Tipi 
********* Fiyatana-Buyuk      -> Buyuk Kisi
********* Fiyatana-Kucuk      -> Ucretli Cocuk

