       FD esKONUK LABEL RECORD STANDARD.
       01 eskonuk-REC.
          02 eskonuk-ANAH.
             03 eskonuk-FOLIO         PIC 9(08).
          02 eskonuk-DURUMU           PIC X.
*********> eskonuk-Durumu   => Folionun iceridemi yoksa histroyde mi oldugunu
*********> belirtir...I-> Iceride H->Historyde Gibi............
          02 eskonuk-FOL-KODU         PIC X.
*********> eskonuk-Fol-Kodu => R-> Oda E-> Extra T-> Telefon G-> Grup B-> Bos
          02 eskonuk-ADI              PIC X(20).
          02 eskonuk-SOYADI           PIC X(20).
          02 eskonuk-S-D-T-G          PIC 9.
          02 eskonuk-ODA-KONUMU       PIC 99.
          02 eskonuk-ODEME-TIPI       PIC XX.
          02 eskonuk-ODANO            PIC X(04).
          02 eskonuk-REZ-NO           PIC 9(08).
          02 eskonuk-ULKE             PIC XXX.
          02 eskonuk-KISI.
             03 eskonuk-BUYUK         PIC 9(02).
             03 eskonuk-KUCUK         PIC 9(02).
             03 eskonuk-BEBEK         PIC 9(01).
             03 eskonuk-FREE          PIC 9(01).
          02 eskonuk-ACENTA           PIC X(04).
          02 eskonuk-GRUP-NO          PIC X(04).
          02 eskonuk-VOUCHER          PIC X(10).
          02 eskonuk-NOR-INDIRIM      PIC 99V99.
          02 eskonuk-PAN-TIPI         PIC XX.
          02 eskonuk-REZ-TIPI         PIC 9.
          02 eskonuk-BANKA            PIC 99.
          02 eskonuk-DOVIZ            PIC 99.
          02 eskonuk-ANLASMA          PIC XX.
          02 eskonuk-KUR-AYGUN        PIC X.
*********> eskonuk-Kur-Aygun = A-> Aybasi Kuru G-> Gunluk kur
          02 eskonuk-FATURA           PIC X.
          02 eskonuk-CIK-CIKMA        PIC X.
          02 eskonuk-ERKEN-CIK        PIC X.
          02 eskonuk-UZATMA           PIC X.
          02 eskonuk-POSTING          PIC X.
          02 eskonuk-VIP              PIC X.
          02 eskonuk-ODADEGIS         PIC X.
*********> eskonuk-Erken-Cik = Early C/Out E/H
*********> eskonuk-Uzatma    = Uzatma      E/H
*********> eskonuk-Posting   = Posting     E/H
*********> eskonuk-Vip       = V-> V.I.P T-> Top V.I.P
*********> eskonuk-Fatura    = E-> Faturasi Kesilmis.. H-> Faturasi Kesilmemis
*********> eskonuk-Cik-Cikma = E-> Musteri Listesi Cik H-> Musteri Listesi Cikma
*********> eskonuk-Odadegis  = E-> Bu Oda Room change yapilmistir.....
          02 eskonuk-ACIK-KAPALI      PIC X.
*********> eskonuk-Acik-kapali = O-> Open C-> Close
          02 eskonuk-GEL-TAR.
             03 eskonuk-GEL-YIL       PIC 9999.
             03 eskonuk-GEL-AY        PIC 99.
             03 eskonuk-GEL-GUN       PIC 99.
          02 eskonuk-GIT-TAR.
             03 eskonuk-GIT-YIL       PIC 9999.
             03 eskonuk-GIT-AY        PIC 99.
             03 eskonuk-GIT-GUN       PIC 99.
          02 eskonuk-GEL-ZAMAN.
             03 eskonuk-GEL-SAAT      PIC 99.
             03 eskonuk-GEL-DAKIKA    PIC 99.
             03 eskonuk-GEL-SANIYE    PIC 99.
          02 eskonuk-GIT-ZAMAN.
             03 eskonuk-GIT-SAAT      PIC 99.
             03 eskonuk-GIT-DAKIKA    PIC 99.
             03 eskonuk-GIT-SANIYE    PIC 99.

          02 eskonuk-ODA-TUTAR        PIC 9(12)V99   COMP-3.
          02 eskonuk-EXTBED-TUTAR     PIC 9(12)V99   COMP-3.
          02 eskonuk-KAHVALTI-TUTAR   PIC 9(12)V99   COMP-3.
          02 eskonuk-OGLE-TUTAR       PIC 9(12)V99   COMP-3.
          02 eskonuk-AKSAM-TUTAR      PIC 9(12)V99   COMP-3.
          02 eskonuk-ICECEK-TUTAR     PIC 9(12)V99   COMP-3.
          02 eskonuk-EXTRA-TUTAR      PIC 9(12)V99   COMP-3.

          02 eskonuk-TOP-BORC         PIC S9(12)V99  COMP-3.
          02 eskonuk-TOP-ALAC         PIC S9(12)V99  COMP-3.
          02 eskonuk-KUR-DEGERI       PIC 9(9)V9(05) COMP-3.
          02 eskonuk-DV-DEGERI        PIC 9(12)V99   COMP-3.

          02 eskonuk-ACIK.
             03 eskonuk-ACIK-1        PIC X(20).
             03 eskonuk-ACIK-2        PIC X(20).
          02 eskonuk-KARTNO           PIC X(07).
          02 eskonuk-REOPEN           PIC X.
          02 eskonuk-OPERATOR         PIC X(02).
          02 eskonuk-FILLER           PIC X(12).
**********          02 eskonuk-TOM.
**********              03 eskonuk-TOM-VAR-YOK   PIC X.
**********              03 eskonuk-TOM-ALKOL     PIC 9.
**********              03 eskonuk-TOM-SERINO    PIC X(12).
          02 eskonuk-PAZAR            PIC X(02).
          02 eskonuk-EB               PIC X.
          02 eskonuk-FIYAT-FIX        PIC X.
          02 eskonuk-GELIS-SAYISI     PIC 9(2).
          02 eskonuk-FIYAT-KONUMU     PIC 99.
          02 eskonuk-GEC-GIRIS        PIC 9.
          02 eskonuk-FAT-NO           PIC 9(06).
          02 eskonuk-UG-INDIRIMI      PIC 9.
          02 eskonuk-BILBORD-EH       PIC X.
          02 eskonuk-EXTRA-REZ-NO     PIC 9(08).
          02 eskonuk-TITLE            PIC X(13).
          02 eskonuk-SAFE             PIC 9.
          02 eskonuk-ANAHTAR          PIC 9.
          02 eskonuk-LATE-ZAMAN.
            03 eskonuk-LATE-GEL-SAAT  PIC 99.
            03 eskonuk-LATE-GEL-DAK   PIC 99.
          02 eskonuk-AKSIYON-EH       PIC X.
          02 eskonuk-share            pic 9.
          02 eskonuk-SPECIAL-EH         pic 9.
          02 eskonuk-sehir            pic xxx.
          02 eskonuk-BOS              PIC X(05).
          02 eskonuk-STAF             PIC X(04).
********> eskonuk-Durumu.....Degiskeni  folionun iceridemi yoksa History de mi
********> Oldugunu gosterir.. Anahtar sahalar icin gerekli................
********> I-> Iceride H-> Historyde...........
********> Konum-tom-var-yok => "E" Ise bu folioya ait tom var demektir....
********> Konum-tom-alkol   => Musterinin alkol seviyesini belirler........
********>                 0 => Alkolsuz............
********>                 1 => Az Alkollu..........
********>                 2 => Orta Alkollu........
********>                 3 => Cok Alkollu.........

