       FD esKONTRAT LABEL RECORD STANDARD.
       01 esKONTRAT-REC.
          02 esKONTRAT-ANAH.
             03 esKONTRAT-ACENTA PIC X(4).
             03 eskontrat-eksi       pic x.
             03 esKONTRAT-ILK-TARIH.
                04 esKONTRAT-ILK-YIL PIC 9999.
                04 esKONTRAT-ILK-AY  PIC 99.
                04 esKONTRAT-ILK-GUN PIC 99.
             03 esKONTRAT-SON-TARIH.
                04 esKONTRAT-SON-YIL PIC 9999.
                04 esKONTRAT-SON-AY  PIC 99.
                04 esKONTRAT-SON-GUN PIC 99.
             03 esKONTRAT-TIPI       PIC 9.
             03 esKONTRAT-PAN-TIPI   PIC XX.
             
           02 esKONTRAT-BEKLE-GUNU   PIC 999.
           02 esKONTRAT-ODA-ATA.
              03 esKONTRAT-ODA-DIZI OCCURS 20 TIMES.
                 04 esKONTRAT-ODA       PIC 9(4) COMP-3.
           02 esKONTRAT-BOS          PIC X(20).
           02 esKONTRAT-STAF         PIC X(04).
**************  Kontrat-Tipi   = 1 Single Oda
**************  Kontrat-Tipi   = 2 Double Oda
**************  Kontrat-Tipi   = 3 Triple Oda
**************  Kontrat-Tipi   = 4 Group  Oda
**************  Kontrat-Oda    = 1-9 Arasi Oda Tipi var hangisi oldugu
**************  Kontrat-Pan-tipi = su anda kullanilmiyor bos ... Ileri icin ...
