       FD esbilbord LABEL RECORD STANDARD.
       01 esbilbord-REC.
          02 esbilbord-ANAH.
             03 esbilbord-ACENTA     PIC X(04).
             03 esbilbord-TARIH.
                04 esbilbord-YIL     PIC 9999.
                04 esbilbord-AY      PIC 99.
                04 esbilbord-GUN     PIC 99.
             03 esbilbord-ODA-TIP    PIC 9.

          02 esbilbord-ODA           PIC 9(04) COMP-3.
          02 esbilbord-BUYUK         PIC 9(04) COMP-3.
          02 esbilbord-SAT-ODA       PIC 9(04) COMP-3.
          02 esbilbord-SAT-BUYUK     PIC 9(04) COMP-3.
          02 esbilbord-BOS           PIC X(10).
          02 esbilbord-STAF          PIC X(04).
