       FD esfiyatana LABEL RECORD STANDARD.
       01 esfiyatana-REC.
          02 esfiyatana-ANAH.
             03 esfiyatana-DIGER-ANAH.
                  04 esfiyatana-PER-ANAH.
                     05 esfiyatana-ACENTA     PIC X(4).
                     05 esfiyatana-ILK-TARIH.
                        06 esfiyatana-ILK-YIL PIC 9999.
                        06 esfiyatana-ILK-AY  PIC 99.
                        06 esfiyatana-ILK-GUN PIC 99.
                     05 esfiyatana-SON-TARIH.
                        06 esfiyatana-SON-YIL PIC 9999.
                        06 esfiyatana-SON-AY  PIC 99.
                        06 esfiyatana-SON-GUN PIC 99.

                   04 esfiyatana-REZ-TIPI   PIC 9.
                   04 esfiyatana-PAN-TIPI   PIC XX.
                   04 esfiyatana-BANKA      PIC 99.
                   04 esfiyatana-DOVIZ      PIC 99.
                   04 esfiyatana-ANLASMA    PIC XX.
             03 esfiyatana-BUYUK      PIC 99.
             03 esfiyatana-KUCUK      PIC 99.
          02 esfiyatana-ODA-DIZI.
             03 esfiyatana-KONUM-DIZI OCCURS 9 TIMES.
                04 esfiyatana-ODA-FIYATI PIC 9(12)V999 COMP-3.
          02 esfiyatana-KICK-BACK     PIC 999.
          02 esfiyatana-EB-EH         PIC X.
          02 esfiyatana-EB-ORAN       PIC 9(2).
          02 esfiyatana-EB-BAS-TARIH.
             03 esfiyatana-EB-BAS-YIL PIC 9(4).     
             03 esfiyatana-EB-BAS-AY  PIC 9(2).     
             03 esfiyatana-EB-BAS-GUN PIC 9(2).     
          02 esfiyatana-EB-BIT-TARIH.
             03 esfiyatana-EB-BIT-YIL PIC 9(4).     
             03 esfiyatana-EB-BIT-AY  PIC 9(2).     
             03 esfiyatana-EB-BIT-GUN PIC 9(2).

          02 esfiyatana-UG-EH         PIC X.
          02 esfiyatana-UG-ORAN       PIC 9(2).
          02 esfiyatana-UG-geceleme    PIC 9(3).
          02 esfiyatana-UG-BAS-TARIH.
             03 esfiyatana-UG-BAS-YIL PIC 9(4).     
             03 esfiyatana-UG-BAS-AY  PIC 9(2).     
             03 esfiyatana-UG-BAS-GUN PIC 9(2).     
          02 esfiyatana-UG-BIT-TARIH.
             03 esfiyatana-UG-BIT-YIL PIC 9(4).     
             03 esfiyatana-UG-BIT-AY  PIC 9(2).     
             03 esfiyatana-UG-BIT-GUN PIC 9(2).

          02 esfiyatana-ACIKLAMA      PIC X(20).
          02 esfiyatana-fiks          pic 9.
          02 esfiyatana-eb-kusur      pic 99.
          02 esfiyatana-ug-kusur      pic 99.
          02 esfiyatana-BOS           PIC X(15).
          02 esfiyatana-STAF          PIC X(04).

********* esfiyatana-konum-dizi -> Fiyatin oda tipi (standart,suit...)
********* Fiyat-Rez-tipi      -> Fiyatin rezervasyon tipi 1-Alotment 2-It.
********* Fiyat-Pan-tipi      -> Fiyatin Pansiyon    tipi BO,BB,HB,FB,HI..
********* Fiyat-Banka         -> Hangi banka ile calisiliyor..............
********* Fiyat-Doviz         -> Hangi kur ile calisiliyor................
********* esfiyatana-Anlasma    -> Aanlasma Tipi 
********* esfiyatana-Buyuk      -> Buyuk Kisi
********* esfiyatana-Kucuk      -> Ucretli Cocuk

