       FD eskontrat LABEL RECORD STANDARD.
       01 eskontrat-REC.
          02 eskontrat-ANAH.
             03 eskontrat-ACENTA PIC X(4).
             03 eskontrat-ILK-TARIH.
                04 eskontrat-ILK-YIL PIC 9999.
                04 eskontrat-ILK-AY  PIC 99.
                04 eskontrat-ILK-GUN PIC 99.
             03 eskontrat-SON-TARIH.
                04 eskontrat-SON-YIL PIC 9999.
                04 eskontrat-SON-AY  PIC 99.
                04 eskontrat-SON-GUN PIC 99.
             03 eskontrat-TIPI       PIC 9.
             03 eskontrat-PAN-TIPI   PIC XX.
           02 eskontrat-BEKLE-GUNU   PIC 999.
           02 eskontrat-ODA-ATA.
              03 eskontrat-ODA-DIZI OCCURS 9 TIMES.
                 04 eskontrat-ODA       PIC 9(4) COMP-3.
           02 eskontrat-BOS          PIC X(20).
           02 eskontrat-STAF         PIC X(04).
**************  eskontrat-Tipi   = 1 Single Oda
**************  eskontrat-Tipi   = 2 Double Oda
**************  eskontrat-Tipi   = 3 Triple Oda
**************  eskontrat-Tipi   = 4 Group  Oda
**************  eskontrat-Oda    = 1-9 Arasi Oda Tipi var hangisi oldugu
**************  eskontrat-Pan-tipi = su anda kullanilmiyor bos ... Ileri icin ...
