       FD eskonum LABEL RECORD STANDARD.
       01 eskonum-REC.
           02 eskonum-ANAHTAR    PIC 9.
           02 eskonum-ADI        PIC X(15).
           02 eskonum-TOP-ODA    PIC 9(04).
           02 eskonum-HAZIR-ODA  PIC 9(04).
           02 eskonum-ref        pic 9.
           02 eskonum-BOS        PIC X(09).
           02 eskonum-STAF       PIC X(04).
**********-> Oda eskonuklarini belirten datadir...
**********-> 1.Kara Tarifi 2.Deniz Tarafi gibi..
**********-> eskonuk-TOP-ODA  -> Bu tipte kac oda oldugunu belirtir....
**********-> eskonuk-HAZIR-ODA-> Bu tipte satisa hazir kac oda oldugunu belirtir.
