       FD esodalar LABEL RECORD STANDARD.
       01 esodalar-REC.
           02 esodalar-ANAH.
              03 esodalar-NO       PIC XXXX.
           02 esodalar-DURUMU      PIC XX.
           02 esodalar-KONUMU      PIC 9.
           02 esodalar-KAPASITE    PIC 99.
           02 esodalar-HOUSE.
              03 HOUSE-DURUMU    PIC XX.
              03 HOUSE-BUYUK     PIC 99.
              03 HOUSE-KUCUK     PIC 99.
              03 HOUSE-BEBEK     PIC 9.
              03 HOUSE-FREE      PIC 9.
              03 HOUSE-STAF      PIC X(04).
              03 HOUSE-ACIKLAMA  PIC X(20).
              03 HOUSE-BOS       PIC X(10).
           02 esodalar-HAYALI      PIC X.
           02 esodalar-KAT         PIC XX.
           02 esodalar-TIPI        PIC XX.
           02 esodalar-PAZAR       PIC XX.
           02 esodalar-BOS         PIC X(48).
           02 esodalar-STAF        PIC X(04).
      */  esodalar-durumu    => Odanin tipi VR.OO.VD...gibi
      */  esodalar-konum     => Odanin konumu 1-Std Room 2-Suit 3-Apart...gibi
      */  esodalar-kapasite  => Odanin kapasitesi 01-1 Kisilik 02-2 Kisilik gibi
      */  esodalar-house     => Odanin House Keepinq'deki durumu...
      */  House-durumu     => Odanin House Keepinq icin durumu VR.OO.VD..gibi
      */  House-buyuk      => Oda da kalan buyuk kisi...
      */  House-kucuk      => Oda da kalan kucuk kisi...
      */  House-free       => Oda da kalan free cocuk...
      */  House-kodu       => Odayla ilgilenen kisinin kodu....
      */  House-aciklama   => Odayla ilgili aciklama hanesi....
      */  esodalar-hayali    => G-Gercek Oda, H-Hayali Oda
