       FD esrez LABEL RECORD STANDARD.
       01 esrez-REC.
          02 esrez-ANAH.
             03 esrez-NO             PIC 9(08).
          02 esrez-TIPI              PIC 9.
**********>1->Alotment 2->It 3->Grup 4->Munferit...gibi
          02 esrez-DURUMU            PIC X.
**********>esrez-Durumu => esrezervasyonun durumunu belirtir....
**********>I->Iceridekir esrez.  S->Silinmis,Iplat esrez.
**********>Onemli butun anahtar sahalarda olacak...............
          02 esrez-ACEN-ANAH.
             03 esrez-ACENTA         PIC X(4).
             03 esrez-GIR-TAR.
                04 esrez-GIR-YIL     PIC 9999.
                04 esrez-GIR-AY      PIC 99.
                04 esrez-GIR-GUN     PIC 99.
             03 esrez-CIK-TAR.
                04 esrez-CIK-YIL     PIC 9999.
                04 esrez-CIK-AY      PIC 99.
                04 esrez-CIK-GUN     PIC 99.
          02 esrez-ADI               PIC X(20).
          02 esrez-SOYADI            PIC X(20).
          02 esrez-BANKA             PIC 99.
          02 esrez-DOVIZ             PIC 99.
          02 esrez-ANLASMA           PIC XX.
          02 esrez-ODEME-TIPI        PIC XX.
          02 esrez-PAN-TIPI          PIC XX.
          02 esrez-ULKE              PIC X(03).
          02 esrez-VOUCHER           PIC X(10).
          02 esrez-KUR-AYGUN         PIC X.
**********>A->Ay basi kuru   G->Gunluk Kur....
          02 esrez-K-G-B             PIC X.
**********>K->Confirme G->Gecici B->Beklemede
          02 esrez-VIP               PIC X.
**********>V->V.I.P    T->Top V.I.P
          02 esrez-KOMISYON          PIC 99.
**********>esrez-Komisyon   -> Acenta Komisyonunu Belirlemek Icin Kullanilir
          02 esrez-NOR-INDIRIM       PIC 99V99.
**********>esrez-Nor-Indirim-> Girilen oran kadar fiyattan indirilecek......
**********>Indirim ile cocuk indirimi birlestirildi..
          02 esrez-C-IN              PIC X.
          02 esrez-FOLIO             PIC 9(08).
**********>esrez-C-In       -> esrezervasyonun C/In Yapilip yapilmadigini belirtir.
**********>esrez-Folio      -> esrezervasyon  C/In Yapildiginda Folio nosu islenir
          02 esrez-ODANO             PIC X(04).
**********>esrez-Odano      -> esrezervasyon esnasinda blokaj yapmaya yarar........
          02 esrez-S-D-T-G           PIC 9.
          02 esrez-ODA-KONUMU        PIC 9.
          02 esrez-KISI.
             03 esrez-BUYUK          PIC 9(02).
             03 esrez-KUCUK          PIC 9(02).
             03 esrez-BEBEK          PIC 9(01).
             03 esrez-FREE           PIC 9(01).
          02 esrez-FIYATI            PIC 9(12)V99 COMP-3.
**********>
          02 esrez-ISL-TAR.
             03 esrez-ISL-YIL        PIC 9999.
             03 esrez-ISL-AY         PIC 99.
             03 esrez-ISL-GUN        PIC 99.
          02 esrez-AL-TAR.
             03 esrez-AL-YIL         PIC 9999.
             03 esrez-AL-AY          PIC 99.
             03 esrez-AL-GUN         PIC 99.
          02 esrez-OPS-TAR.
             03 esrez-OPS-YIL        PIC 9999.
             03 esrez-OPS-AY         PIC 99.
             03 esrez-OPS-GUN        PIC 99.
          02 esrez-GEL-ZAMAN.
             03 esrez-GEL-SAAT       PIC 99.
             03 esrez-GEL-DAK        PIC 99.
          02 esrez-GIT-ZAMAN.
             03 esrez-GIT-SAAT       PIC 99.
             03 esrez-GIT-DAK        PIC 99.
          02 esrez-GENEL-BILGI.
             03 esrez-GRUP-NO        PIC X(04).
             03 esrez-GRUP-ADI       PIC X(15).
             03 esrez-ADRES1         PIC X(20).
             03 esrez-ADRES2         PIC X(20).
             03 esrez-NOT1           PIC X(20).
             03 esrez-NOT2           PIC X(20).
             03 esrez-TELNO          PIC X(20).
             03 esrez-E-MAIL         PIC X(40).
          02 esrez-ON-ODEME          pic 9(12)V99 COMP-3.
          02 esrez-ON-DOVIZ          pic 9(02).
          02 esrez-PAZAR             pic X(02).
          02 esrez-EB                pic X.
          02 esrez-FIYAT-FIX         PIC X.
**********>esrez-FIYAT-FIX  ->="E" Peryot degisiminde fiyatti degismesin     
          02 esrez-FIYAT-KONUMU      PIC 9.
          02 esrez-AKSIYON-EH        PIC X.
          02 esrez-BILBORD-EH        PIC X.
          02 esrez-UG-IND            PIC 9.
          02 esrez-cin-kuru          pic 999v99999.    
          02 esrez-BOS               PIC X(38).
          02 esrez-STAF              PIC X(04).
