IDENTIFICATION DIVISION.
PROGRAM-ID. HALKRAP1 IS INITIAL PROGRAM.
AUTHOR.  ASYASOFT.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    COPY "genel.sel".
    COPY "genelfis.sel".
    COPY "isyeri.sel".
    COPY "kllnc.sel".
    COPY "rez.sel".
    COPY "kodlar02.sel".
    COPY "acenta.sel".
    COPY "konum.sel".
    COPY "prtler.sel".
    COPY "cevap1.sel".
    COPY "cevap2.sel".
    COPY "soru.sel".
    COPY "halk.sel".
    COPY "turizm.sel".
    COPY "ulke.sel".
SELECT TAKAS ASSIGN TO RANDOM , TAKAS-ADRES
    ORGANIZATION INDEXED,
    ACCESS DYNAMIC,
    RECORD KEY IS TAKAS-ANAHTAR,
    STATUS FS-TAKAS.
SELECT TAKAS2 ASSIGN TO RANDOM , TAKAS2-ADRES
    ORGANIZATION INDEXED,
    ACCESS DYNAMIC,
    RECORD KEY IS TAKAS2-ANAHTAR,
    STATUS FS-TAKAS2.
SELECT TAKAS3 ASSIGN TO RANDOM , TAKAS3-ADRES
    ORGANIZATION INDEXED,
    ACCESS DYNAMIC,
    RECORD KEY IS TAKAS3-ANAHTAR,
    STATUS FS-TAKAS3.
       SELECT LISTE ASSIGN TO RANDOM,  
              LISTE-ADRES,
        ORGANIZATION LINE SEQUENTIAL,
        STATUS FS-LISTE.
          
DATA DIVISION.
FILE SECTION.
    COPY "genel.lib".
    COPY "genelfis.lib".
    COPY "isyeri.lib".
    COPY "kllnc.lib".
    COPY "rez.lib".
    COPY "kodlar02.lib".
    COPY "acenta.lib".
    COPY "konum.lib".
    COPY "prtler.lib".
    COPY "cevap1.lib".
    COPY "cevap2.lib".
    COPY "soru.lib".
    COPY "halk.lib".
    COPY "turizm.lib".
    COPY "ulke.lib".

FD LISTE LABEL RECORD STANDARD.
01 LISTE-REC PIC X(165).
FD TAKAS LABEL RECORD STANDARD.
01 TAKAS-REC.
   02 TAKAS-ANAHTAR.
      03 TAKAS-SORU      PIC 9(2).
      03 TAKAS-ANA       PIC X(02).
      03 TAKAS-ALT       PIC X(03).
   02 TAKAS-CEVAP-DIZI.
      03 TAKAS-CEVAP OCCURS 6 TIMES PIC 9(7).
*/ 6 CISI CEVAPSIZLAR ICIN
FD TAKAS2 LABEL RECORD STANDARD.
01 TAKAS2-REC.
   02 TAKAS2-ANAHTAR     PIC 9(2).
   02 TAKAS2-CEVAP-DIZI.
      03 TAKAS2-CEVAP OCCURS 6 TIMES PIC 9(7).
FD TAKAS3 LABEL RECORD STANDARD.
01 TAKAS3-REC.
   02 TAKAS3-ANAHTAR     PIC X(3).
   02 TAKAS3-GELEN       PIC 9(9).
   02 TAKAS3-ANKET       PIC 9(9).
WORKING-STORAGE SECTION.
    COPY "adres.wrk".
    COPY "acucobol.def".
    COPY "acugui.def".
77 TCP-IP-ISL              PIC X.
77 FS-TAKAS                PIC X(2).
01 TAKAS-ADRES.
   02 FILLER               PIC X(20) VALUE "/asya/ytl/liste/hlk3".
   02 TAKAS-NO             PIC X(04).
77 FS-TAKAS2               PIC X(2).
01 TAKAS2-ADRES.
   02 FILLER               PIC X(20) VALUE "/asya/ytl/liste/hlk4".
   02 TAKAS2-NO            PIC X(04).
77 FS-TAKAS3               PIC X(2).
01 TAKAS3-ADRES.
   02 FILLER               PIC X(20) VALUE "/asya/ytl/liste/hlk5".
   02 TAKAS3-NO            PIC X(04).
01 TEMP-ANAH.
   02 TEMP-ANA   PIC X(02).
   02 TEMP-ALT   PIC X(03).
01 LIST-TAR.
   02 LIST-GUN   PIC 99.
   02 LIST-AY    PIC 99.
   02 LIST-YIL   PIC 99.
01 LIST-TAR-1 REDEFINES LIST-TAR PIC 9(06).
01 SIS-ZAMAN.
   02 SIS-SAAT   PIC 99.
   02 SIS-DAKIKA PIC 99.
   02 SIS-SANIYE PIC 99.
01 SIS-ZAMAN-1 REDEFINES SIS-ZAMAN PIC 9(06).

01 LISTE-SATIR             PIC 9(3).
01 DEP-CEVAP1              PIC 9(10)V99.
01 DEP-CEVAP2              PIC 9(10)V99.
01 DEP-CEVAP3              PIC 9(10)V99.
01 DEP-CEVAP4              PIC 9(10)V99.
01 DEP-CEVAP5              PIC 9(10)V99.
01 TEMP-SAYI               PIC 9(7).
01 OTEL-CEVAP1             PIC 9(10)V99.
01 OTEL-CEVAP2             PIC 9(10)V99.
01 OTEL-CEVAP3             PIC 9(10)V99.
01 OTEL-CEVAP4             PIC 9(10)V99.
01 OTEL-CEVAP5             PIC 9(10)V99.
01 10-Z                    PIC ZZ,ZZZ,ZZZ.
77 SON-ANAHTAR             PIC 9(04) VALUE ZERO.
01 TEK-CIFT                PIC X.
   88 TEK VALUE "T".
   88 CIFT VALUE "C".
77 ARA-SON-KAYIT-MI        PIC X.
77 ARA-SAKLA               PIC 9(04).
77 ILK-SAKLA               PIC 9(04).
77 SON-SAYFA               PIC 9(04) VALUE ZERO.
77 II                      PIC 9(02) VALUE ZERO.
77 II-SAKLA                PIC 9(02) VALUE ZERO.
77 ESKI-II                 PIC 9(02) VALUE ZERO.
77 TUS                     PIC 9(03).
*/77 SAYFA-GOSTER            PIC 9(03).
77 SATIR                   PIC 9(02).
77 SATIR-SAKLA             PIC 9(02).
77 TEMIZLE-SATIR           PIC 9(02).
77 PENCERE-1               PIC X(10).
77 DONENCE-PEN             PIC X(10).
01 ILK-TARIH.
    02 ILK-YIL             PIC 9(04).
    02 ILK-AY              PIC 9(02).
    02 ILK-GUN             PIC 9(02).
01 SON-TARIH.
    02 SON-YIL             PIC 9(04).
    02 SON-AY              PIC 9(02).
    02 SON-GUN             PIC 9(02).
01 RAPOR-ACENTA            PIC X(04).
01 TOPLAM-ANKET            PIC 9(10).
01 KAYIT-SAYI              PIC 9(10).
01 DEP-KAYIT-SAYI          PIC 9(10).
01 DEP-CEVAP-SAYI          PIC 9(10).
01 OTEL-KAYIT-SAYI         PIC 9(10).
01 OTEL-CEVAP-SAYI         PIC 9(10).
01 ACENTA-CAGIR            PIC X(04).
01 TARIH-X.
    02 YIL-X               PIC 9(04).
    02 AY-X                PIC 9(02).
    02 GUN-X               PIC 9(02).
01 TARIH-TOPLA.
    02 TARIH-ODA           PIC 9(04).
    02 TARIH-PAX           PIC 9(04).
    02 TARIH-CHI           PIC 9(04).
    02 TARIH-FRE           PIC 9(04).
01 GENEL-TOPLA.
    02 GENEL-ODA           PIC 9(04).
    02 GENEL-PAX           PIC 9(04).
    02 GENEL-CHI           PIC 9(04).
    02 GENEL-FRE           PIC 9(04).
77 TOPLAM-Z                PIC ZZZ.
77 TOPLAM-Z-2              PIC ZZZZ.
01 KONUM-DIZI.
    02 KONUM-DIZI-X OCCURS 9 TIMES.
       03 X-SIRA           PIC 9.
       03 ODA-DIZI         PIC 9(03).
       03 PAX-DIZI         PIC 9(03).
       03 CHI-DIZI         PIC 9(03).
       03 FRE-DIZI         PIC 9(03).
01 SUTUN                   PIC 9(03).
77 DONENCE-1               PIC 9     VALUE ZERO.
01 DONENCE-CIK.
   02 FILLER               PIC X     VALUE "[".
   02 DONENCE-DEGER        PIC X     VALUE SPACES.
   02 FILLER               PIC X     VALUE "]".
77 BOS-PEN                 PIC X(10).
77 DOS-PEN                 PIC X(10).
77 BOS-CIZ                 PIC X(80) VALUE SPACE.
77 SINIR                   PIC 9(03) VALUE 0.
01 TOPLAM-ODA              PIC 9(10).
77 DETAY-BASLANGIC         PIC 9(03) VALUE 0.
77 DETAY-UZUNLUK           PIC 9(03) VALUE 78.
77 UZUNLUK-SINIR           PIC 9(03) VALUE 143.
77 BASLANGIC-SINIR         PIC 9(03) VALUE 65.
77 CIZGI-SATIR             PIC 9(02) VALUE ZERO.
77 CIZGI-RENK              PIC 9(03) VALUE ZERO.
77 SAYFA-GOSTER            PIC 9(04).
01 CIZGI-SEKIL.
    02 DUZ                 PIC X(80) VALUE ALL "Ä".
    02 DIK                 PIC X(80) VALUE ALL "³".
    02 HAC                 PIC X(80) VALUE ALL "Å".
    02 UST                 PIC X(80) VALUE ALL "Â".
    02 ALT                 PIC X(80) VALUE ALL "Á".
    02 TIRE                PIC X(80) VALUE ALL "-".
    02 IKI-NOKTA           PIC X(80) VALUE ALL ":".
01 CIZGI-SEC               PIC X(80).
01 EKRAN-ANA-BASLIK.
    02 ISYERI-UNVAN-1 PIC X(28).
    02 FILLER         PIC X     VALUE SPACES.
    02 BUYUK-YAZ      PIC X     VALUE SPACES.
    02 FILLER         PIC X(55) VALUE
     "Halkla Iliskiler Misafir Anketleri Istatistik Raporu".
    02 FILLER         PIC X(13) VALUE SPACES.
01 EKRAN-ALT-BASLIK.
    02 FILLER         PIC X(06)B VALUE "Tarih:".
    02 I-GUN          PIC 9(02).
    02 FILLER         PIC X VALUE "/".
    02 I-AY           PIC 9(02).
    02 FILLER         PIC X VALUE "/".
    02 I-YIL          PIC 9(04).
    02 FILLER         PIC X VALUE "-".
    02 S-GUN          PIC 9(02).
    02 FILLER         PIC X VALUE "/".
    02 S-AY           PIC 9(02).
    02 FILLER         PIC X VALUE "/".
    02 S-YIL          PIC 9(04)B.
    02 FILLER         PIC X(07)B VALUE "Acenta:".
    02 R-ACENTA       PIC X(04).
    02 R-ARA          PIC X VALUE SPACES.
    02 R-ADI          PIC X(15).
    02 FILLER         PIC X(07) VALUE SPACES.
01 RAPOR-BASLIK.
    02 FILLER       PIC X(06)B VALUE "Tarih:".
    02 LI-GUN       PIC 9(02).
    02 FILLER       PIC X VALUE "/".
    02 LI-AY        PIC 9(02).
    02 FILLER       PIC X VALUE "/".
    02 LI-YIL       PIC 9(04).
    02 FILLER       PIC X VALUE "-".
    02 LS-GUN       PIC 9(02).
    02 FILLER       PIC X VALUE "/".
    02 LS-AY        PIC 9(02).
    02 FILLER       PIC X VALUE "/".
    02 LS-YIL       PIC 9(04)B.
    02 FILLER       PIC X(07)B VALUE "Acenta:".
    02 LR-ACENTA    PIC X(04).
    02 LR-ARA       PIC X VALUE SPACES.
    02 LR-ADI       PIC X(15).
    02 FILLER       PIC X(07) VALUE "  Ulke:".
    02 R-ULKE       PIC X(7).
    02 FILLER       PIC X(3) VALUE "   ".
    02 FILLER         PIC X(13) VALUE "Toplam Oda  :".
    02 FILLER         PIC X VALUE "[".
    02 ETOPLAM-ODA    PIC Z,ZZZ,ZZZ.
    02 FILLER         PIC XBBB VALUE "]".
    02 FILLER         PIC X(13) VALUE "Toplam Anket:".
    02 FILLER         PIC X VALUE "[".
    02 ETOPLAM-ANKET  PIC Z,ZZZ,ZZZ.
    02 FILLER         PIC XBBB VALUE "]".
    02 FILLER         PIC X(08) VALUE "Yuzde : ".
    02 FILLER         PIC X VALUE "[".
    02 ETOPLAM-YUZDE  PIC ZZZ.ZZ.
    02 FILLER         PIC X VALUE "]".

    02 FILLER       PIC X     VALUE SPACES.
    02 ISYERI-ADI   PIC X(25).
    02 FILLER       PIC X(20) VALUE SPACE.
    02 FILLER       PIC X(35) VALUE SPACES.
    02 FILLER       PIC X(06) VALUE "Tarih:".
    02 FILLER       PIC X VALUE SPACES.
    02 LISTE-TAR    PIC ZZ/ZZ/ZZ.
    02 FILLER       PIC X(02) VALUE SPACES.
    02 FILLER       PIC X(05) VALUE "Saat:".
    02 FILLER       PIC X     VALUE SPACES.
    02 LISTE-ZAMAN.
       03 L-SAAT    PIC 99.
       03 FILLER    PIC X VALUE ":".
       03 L-DAKIKA  PIC 99.
       03 FILLER    PIC X VALUE ":".
       03 L-SANIYE  PIC 99.
    02 FILLER       PIC X(02) VALUE SPACES.
    02 FILLER       PIC X(06) VALUE "Sayfa:".
    02 FILLER       PIC X     VALUE SPACES.
    02 LISTE-SAYFA  PIC 9999.
01 CIZGI.
    02 CIZGI-01              PIC X(37).
    02 CIZ-01                PIC X.
    02 CIZGI-01-1            PIC X(10).
    02 CIZ-06                PIC X.
    02 CIZGI-02              PIC X(18).
    02 CIZ-02                PIC X.
    02 CIZGI-03              PIC X(18).
    02 CIZ-03                PIC X.
    02 CIZGI-04              PIC X(18).
    02 CIZ-04                PIC X.
    02 CIZGI-05              PIC X(18).
    02 CIZ-05                PIC X.
    02 CIZGI-06              PIC X(18).
01 DETAY-YEDEK.
    02 FILLER         PIC X VALUE "|".
    02 DETAY-YED-1    PIC ZZZZZZ.
    02 FILLER         PIC X(4) VALUE "|  %".
    02 DETAY-YED-2    PIC ZZZ.ZZ.
01 DETAY.
    02 DETAY-01              PIC X(37).
    02 ARA-01                PIC X.
    02 DETAY-01-1            PIC X(10).
    02 ARA-06                PIC X.
    02 DETAY-02              PIC X(18).
    02 ARA-02                PIC X.
    02 DETAY-03              PIC X(18).
    02 ARA-03                PIC X.
    02 DETAY-04              PIC X(18).
    02 ARA-04                PIC X.
    02 DETAY-05              PIC X(18).
    02 ARA-05                PIC X.
    02 DETAY-06              PIC X(18).

01 10-HANE                   PIC ZZ,ZZZ,ZZZ.
01 EYUZDE                    PIC ZZZ.ZZ.

01 DAGILIM-CIZGI.
   02 DAGILIM-ULKE-KOD1      PIC X(03).
   02 DAGILIM-1        PIC X.
   02 DAGILIM-ULKE-ADI1      PIC X(20).
   02 DAGILIM-2        PIC X.
   02 DAGILIM-GELEN1         PIC X(10).
   02 DAGILIM-3        PIC X.
   02 DAGILIM-ANKET1         PIC X(10).
   02 DAGILIM-4        PIC X.
   02 DAGILIM-YUZDE1         PIC X(06).
   02 DAGILIM-5        PIC X.
   02 DAGILIM-ULKE-KOD2      PIC X(03).
   02 DAGILIM-6        PIC X.
   02 DAGILIM-ULKE-ADI2      PIC X(20).
   02 DAGILIM-7        PIC X.
   02 DAGILIM-GELEN2         PIC X(10).
   02 DAGILIM-8        PIC X.
   02 DAGILIM-ANKET2         PIC X(10).
   02 DAGILIM-9        PIC X.
   02 DAGILIM-YUZDE2         PIC X(06).
01 DETAY1.
   02 DET-DOKUMER-20   PIC  X(20).
   02 FILLER           PIC  X.
   02 DET-FILLER       PIC  X(180).
   02 DET-FILLER-RED REDEFINES DET-FILLER.
      03 DET-DET          PIC  X(180).
01 UL1  PIC XXX.
01 UL2  PIC XXX.
01 UL1-Z  PIC ZZZ.
01 UL2-Z  PIC ZZZ.

LINKAGE SECTION.
01 PROG-LINK.
   02 PROG-BAS-TARIH.
      03 PROG-BAS-YIL     PIC 9(4).
      03 PROG-BAS-AY      PIC 9(2).
      03 PROG-BAS-GUN     PIC 9(2).
   02 PROG-BIT-TARIH.
      03 PROG-BIT-YIL     PIC 9(4).
      03 PROG-BIT-AY      PIC 9(2).
      03 PROG-BIT-GUN     PIC 9(2).
   02 PROG-ACENTA         PIC X(4).
   02 PROG-ULKE           PIC X(03).
   02 LISTE-ADRES         PIC X(24).
   02 PROG-DONUS          PIC 9.

PROCEDURE DIVISION USING PROG-LINK.

DECLARATIVES.
FILE-ERROR SECTION.
    USE AFTER STANDARD ERROR PROCEDURE ON GENEL GENELFIS KLLNC ISYERI
              KONUM ACENTA KODLAR02 REZ PRTLER LISTE TAKAS
              CEVAP1 CEVAP2 HALK SORU TAKAS2 TURIZM TAKAS3 ULKE.
DOSYA-KONTROL.
DOSYA-KONTROL-EXIT.
    EXIT.
END DECLARATIVES.
LINK-KONTROL.
    MOVE ISYERI-ADRES-TASI TO GENEL-DOSYA-ADRES.
    MOVE ISYERI-ADRES-TASI TO GENELFIS-DOSYA-ADRES.
    MOVE ISYERI-ADRES-TASI TO REZ-DOSYA-ADRES.
    MOVE ISYERI-ADRES-TASI TO KODLAR02-DOSYA-ADRES.
    MOVE ISYERI-ADRES-TASI TO ACENTA-DOSYA-ADRES.
    MOVE ISYERI-ADRES-TASI TO KONUM-DOSYA-ADRES.
    MOVE ISYERI-ADRES-TASI TO CEVAP1-DOSYA-ADRES.
    MOVE ISYERI-ADRES-TASI TO CEVAP2-DOSYA-ADRES.
    MOVE ISYERI-ADRES-TASI TO SORU-DOSYA-ADRES.
    MOVE ISYERI-ADRES-TASI TO HALK-DOSYA-ADRES.
    MOVE ISYERI-ADRES-TASI TO TURIZM-DOSYA-ADRES.
    MOVE ISYERI-ADRES-TASI TO ULKE-DOSYA-ADRES.
DOSYA-AC.

    INITIALIZE PROG-DONUS.
    OPEN INPUT REZ KODLAR02 ACENTA KONUM TURIZM ULKE.
AA-10.
    OPEN INPUT GENEL.
    MOVE 1 TO GENEL-ANAHTAR.
    READ GENEL NO LOCK INVALID 
         DISPLAY MESSAGE BOX 
                 "Genel parametre tanimsiz"
                 ICON MB_ERROR_ICON
                 TITLE "Hata"
                 move 1 to PROG-DONUS
                 GO SON
    END-READ.
    CLOSE  GENEL.

    OPEN INPUT ISYERI.
    MOVE ISYERI-NO-TASI TO ISYERI-NO .
    READ ISYERI NO LOCK INVALID KEY MOVE SPACE TO ISYERI-UNVAN.
    MOVE ISYERI-UNVAN   TO ISYERI-UNVAN-1.
    CLOSE ISYERI.
EKRAN-AL.
    INITIALIZE ILK-TARIH SON-TARIH RAPOR-ACENTA.
    MOVE PROG-BAS-TARIH TO ILK-TARIH
    MOVE PROG-BIT-TARIH TO SON-TARIH.
    MOVE PROG-ACENTA    TO RAPOR-ACENTA.
    if RAPOR-ACENTA = SPACES GO RAPOR-ATA.
ACENTA-OKU.
    INITIALIZE ACENTA-REC.
    MOVE RAPOR-ACENTA TO ACENTA-KODU.
    READ ACENTA NO LOCK INVALID
         DISPLAY MESSAGE BOX
                 "Tanimsiz Acenta ..."
                 ICON MB_ERROR_ICON
                 TITLE "Hata"
                 MOVE 1 TO PROG-DONUS
                 GO SON
    END-READ.

RAPOR-ATA.
    INITIALIZE KAYIT-SAYI
    MOVE ILK-GUN      TO I-GUN    LI-GUN.
    MOVE ILK-AY       TO I-AY     LI-AY.
    MOVE ILK-YIL      TO I-YIL    LI-YIL.
    MOVE SON-GUN      TO S-GUN    LS-GUN.
    MOVE SON-AY       TO S-AY     LS-AY.
    MOVE SON-YIL      TO S-YIL    LS-YIL.
    MOVE RAPOR-ACENTA TO R-ACENTA LR-ACENTA.
    MOVE ACENTA-ADI   TO R-ADI    LR-ADI.
    PERFORM ULKE-BAS-BUL.
    IF RAPOR-ACENTA = SPACES MOVE "Butu"       TO LR-ACENTA,
                             MOVE "n"          TO LR-ARA,
                             MOVE " Acentalar" TO LR-ADI.
    OPEN INPUT KLLNC.

    PERFORM TAKAS-AKTAR THRU TAKAS-AKTAR-EX.

*    IF KAYIT-SAYI = ZEROES 
*    GO RAPOR-EXIT.
    PERFORM RAPOR-LISTE THRU RAPOR-LISTE-EXIT.
    CLOSE KLLNC.
RAPOR-BITTI.
RAPOR-EXIT.
    GO SON.
RAPOR-LISTE.
    OPEN OUTPUT LISTE.
    MOVE 0 TO SAYFA-GOSTER.
    MOVE 0 TO LISTE-SAYFA KAYIT-SAYI.
    INITIALIZE TURIZM-REC TOPLAM-ODA
    MOVE ILK-TARIH        TO TURIZM-TARIH

  
    START TURIZM KEY NOT < TURIZM-ANAH1 INVALID 
          CONTINUE
    NOT INVALID
    INITIALIZE FS-TURIZM
    PERFORM WITH TEST AFTER UNTIL FS-TURIZM  = "10"
          READ TURIZM NEXT NO LOCK END MOVE "10" TO FS-TURIZM
          NOT AT END
               IF TURIZM-TARIH > SON-TARIH
                  MOVE "10" TO FS-TURIZM
               ELSE 
                  ADD GELEN-ODA     TO TOPLAM-ODA
                  INITIALIZE TAKAS3-REC
                  MOVE TURIZM-ULKE     TO TAKAS3-ANAHTAR
                  READ TAKAS3 NO LOCK INVALID
                       INITIALIZE TAKAS3-GELEN TAKAS3-ANKET
                  END-READ
                  ADD GELEN-ODA  TO TAKAS3-GELEN
                  WRITE TAKAS3-REC INVALID REWRITE TAKAS3-REC END-REWRITE
                  END-WRITE
               END-IF
          END-READ
    END-PERFORM
    END-START.
    MOVE TOPLAM-ODA TO ETOPLAM-ODA
    COMPUTE ETOPLAM-YUZDE = (TOPLAM-ANKET / TOPLAM-ODA) * 100.

RAPOR-LISTE-BASLA.
*    set  dokumer-asya-set to true
*    set  dokumer-yazici-text to true

    ADD 1 TO SAYFA-GOSTER.
    MOVE 0            TO LISTE-SATIR.
    INITIALIZE LISTE-REC DETAY1
    MOVE "W"                  TO DET-DOKUMER-20(1:)
    MOVE EKRAN-ANA-BASLIK     TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1
    INITIALIZE LISTE-REC DETAY1
    MOVE "1"                  TO DET-DOKUMER-20(10:1)
    MOVE "B"                  TO DET-DOKUMER-20(1:1)
    MOVE EKRAN-ANA-BASLIK     TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1

    ADD 1 TO LISTE-SATIR.
    MOVE LIST-TAR-1   TO LISTE-TAR.
    MOVE SIS-SAAT     TO L-SAAT.
    MOVE SIS-DAKIKA   TO L-DAKIKA.
    MOVE SIS-SANIYE   TO L-SANIYE.
    ADD 1             TO LISTE-SAYFA.


    INITIALIZE LISTE-REC DETAY1
    MOVE "B"                  TO DET-DOKUMER-20(1:1)
    WRITE LISTE-REC FROM DETAY1

    INITIALIZE LISTE-REC DETAY1
    MOVE "1"                  TO DET-DOKUMER-20(10:1)
    MOVE "B"                  TO DET-DOKUMER-20(1:1)
    MOVE RAPOR-BASLIK         TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1

    INITIALIZE LISTE-REC DETAY1
    MOVE "B"                  TO DET-DOKUMER-20(1:1)
    WRITE LISTE-REC FROM DETAY1


*/ DOKUMER OZELLIKLER-REC
    INITIALIZE LISTE-REC DETAY1
    MOVE "O" TO DET-DOKUMER-20(1:)
    MOVE "E" TO DOKUMER-OTO-SAYFA-BASI
    MOVE 56  TO DOKUMER-OTO-SAYFA-SATIR
    MOVE "|" TO DOKUMER-DETAY-KOLON-AYIRICI
    MOVE "LLLLLLLLLLLLLLLLLLLL" TO DOKUMER-ALIGN-OCC
    MOVE DOKUMER-OZELLIKLER-REC     TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1.
*/ BASLIKLAR  
    
RAPOR-TAKAS2-START.
    OPEN INPUT SORU HALK.
    INITIALIZE TAKAS2-REC
    START TAKAS2 KEY NOT < TAKAS2-ANAHTAR INVALID
          GO OTEL-TOPLAM-START.
RAPOR-TAKAS2-READ.
    READ TAKAS2 NEXT NO LOCK END GO OTEL-TOPLAM-START.
    INITIALIZE LISTE-REC DETAY CIZGI
    MOVE TAKAS2-ANAHTAR TO SORU-KODU
    READ SORU NO LOCK INVALID 
         INITIALIZE SORU-REC
    END-READ
    INITIALIZE KAYIT-SAYI TEMP-ANAH.
RAPOR-TAKAS-START.
    INITIALIZE TAKAS-REC
    MOVE TAKAS2-ANAHTAR     TO TAKAS-SORU
    START TAKAS KEY NOT < TAKAS-ANAHTAR INVALID
          GO RAPOR-TAKAS2-READ.
    INITIALIZE DEP-CEVAP1 DEP-CEVAP2 DEP-CEVAP3 DEP-CEVAP4 DEP-CEVAP5
               DEP-KAYIT-SAYI DEP-CEVAP-SAYI.
    INITIALIZE OTEL-CEVAP1 OTEL-CEVAP2 OTEL-CEVAP3 OTEL-CEVAP4 OTEL-CEVAP5
               OTEL-KAYIT-SAYI OTEL-CEVAP-SAYI.
RAPOR-TAKAS-READ.
    READ TAKAS NEXT NO LOCK END PERFORM DEP-TOPLAM GO RAPOR-TAKAS2-READ.
    IF TAKAS-SORU NOT = TAKAS2-ANAHTAR
       PERFORM DEP-TOPLAM
       GO RAPOR-TAKAS2-READ
    END-IF
    ADD 1 TO KAYIT-SAYI
    IF TAKAS-ANA NOT = TEMP-ANA
       IF KAYIT-SAYI > 1 
          PERFORM DEP-TOPLAM
       END-IF
       MOVE TAKAS-ANA       TO HALK-ANA
       MOVE SPACES          TO HALK-ALT
       READ HALK NO LOCK INVALID 
            MOVE ALL "*" TO HALK-ADI
       END-READ
       MOVE HALK-ADI        TO CIZGI-01
       MOVE "Top.Cevap "    TO CIZGI-01-1
       MOVE SORU1           TO CIZGI-02
       MOVE SORU2           TO CIZGI-03
       MOVE SORU3           TO CIZGI-04
       MOVE SORU4           TO CIZGI-05
       MOVE SORU5           TO CIZGI-06
       INITIALIZE DETAY1
       MOVE CIZGI           TO  det-filler
*       move "D1"           to det-dokumer-20(1:2)
*       move "-"            to det-dokumer-20(5:1)



       WRITE LISTE-REC from detay1
*       WRITE LISTE-REC FROM CIZGI AFTER 0
*       WRITE LISTE-REC FROM CIZGI AFTER 0
       ADD 1 TO LISTE-SATIR
       MOVE ALL "-"    TO CIZGI-01 CIZGI-02 CIZGI-03 CIZGI-04 CIZGI-05 CIZGI-06
                          CIZGI-01-1
       INITIALIZE DETAY1
*       move "D2"           to det-dokumer-20(1:2)
*       move "-"            to det-dokumer-20(5:1)
       MOVE CIZGI           TO  det-filler
       WRITE LISTE-REC from detay1
*       WRITE LISTE-REC FROM CIZGI AFTER 0
*       WRITE LISTE-REC FROM CIZGI AFTER 0
       ADD 1 TO LISTE-SATIR
       MOVE TAKAS-ANA TO TEMP-ANA
    END-IF
    MOVE TAKAS-ANA          TO HALK-ANA
    MOVE TAKAS-ALT          TO HALK-ALT
    READ HALK NO LOCK INVALID 
         INITIALIZE HALK-REC
    END-READ
***********
    ADD 1 TO DEP-KAYIT-SAYI

    INITIALIZE DETAY
    MOVE HALK-ADI           TO DETAY-01
    COMPUTE TEMP-SAYI = TAKAS-CEVAP(1) + TAKAS-CEVAP(2) + TAKAS-CEVAP(3) +
                        TAKAS-CEVAP(4) + TAKAS-CEVAP(5)
    MOVE TEMP-SAYI          TO 10-Z
    ADD  TEMP-SAYI          TO DEP-CEVAP-SAYI
    MOVE 10-Z               TO DETAY-01-1
    MOVE TAKAS-CEVAP(1)       TO DETAY-YED-1
    COMPUTE DETAY-YED-2 ROUNDED = (TAKAS-CEVAP(1) * 100) / TEMP-SAYI
    ADD TAKAS-CEVAP(1) TO DEP-CEVAP1
    MOVE DETAY-YEDEK          TO DETAY-02

    MOVE TAKAS-CEVAP(2)       TO DETAY-YED-1
    COMPUTE DETAY-YED-2 ROUNDED = (TAKAS-CEVAP(2) * 100) / TEMP-SAYI 
    ADD TAKAS-CEVAP(2) TO DEP-CEVAP2
    MOVE DETAY-YEDEK          TO DETAY-03

    MOVE TAKAS-CEVAP(3)       TO DETAY-YED-1
    COMPUTE DETAY-YED-2 ROUNDED = (TAKAS-CEVAP(3) * 100) / TEMP-SAYI
    ADD TAKAS-CEVAP(3) TO DEP-CEVAP3
    MOVE DETAY-YEDEK          TO DETAY-04

    MOVE TAKAS-CEVAP(4)       TO DETAY-YED-1
    COMPUTE DETAY-YED-2 ROUNDED = (TAKAS-CEVAP(4) * 100) / TEMP-SAYI
    ADD TAKAS-CEVAP(4) TO DEP-CEVAP4
    MOVE DETAY-YEDEK          TO DETAY-05

    MOVE TAKAS-CEVAP(5)       TO DETAY-YED-1
    COMPUTE DETAY-YED-2 ROUNDED = (TAKAS-CEVAP(5) * 100) /  TEMP-SAYI
    ADD TAKAS-CEVAP(5) TO DEP-CEVAP5
    MOVE DETAY-YEDEK          TO DETAY-06
    INITIALIZE DETAY1
    MOVE DETAY   TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1
    ADD 1 TO LISTE-SATIR.
    GO RAPOR-TAKAS-READ.


OTEL-TOPLAM-START.
    INITIALIZE TAKAS2-REC.
    START TAKAS2 KEY NOT < TAKAS2-ANAHTAR INVALID
          GO RAPOR-LISTE-BITTI.
OTEL-TOPLAM-READ.
    READ TAKAS2 NEXT NO LOCK END GO RAPOR-LISTE-BITTI.
    INITIALIZE LISTE-REC DETAY CIZGI
    MOVE TAKAS2-ANAHTAR TO SORU-KODU
    READ SORU NO LOCK INVALID 
         INITIALIZE SORU-REC
    END-READ
    INITIALIZE KAYIT-SAYI TEMP-ANAH.
    INITIALIZE OTEL-CEVAP1 OTEL-CEVAP2 OTEL-CEVAP3 OTEL-CEVAP4 OTEL-CEVAP5
               OTEL-KAYIT-SAYI OTEL-CEVAP-SAYI.
    IF TAKAS2-CEVAP(1) = 0 AND TAKAS2-CEVAP(2) = 0 AND
       TAKAS2-CEVAP(3) = 0 AND TAKAS2-CEVAP(4) = 0 AND
       TAKAS2-CEVAP(5) = 0 
       GO OTEL-TOPLAM-READ
    END-IF.
***********
       MOVE "Otel Yuzdesi..."  TO CIZGI-01
       MOVE "Top.Cevap "    TO CIZGI-01-1
       MOVE SORU1           TO CIZGI-02
       MOVE SORU2           TO CIZGI-03
       MOVE SORU3           TO CIZGI-04
       MOVE SORU4           TO CIZGI-05
       MOVE SORU5           TO CIZGI-06
       INITIALIZE DETAY1
       MOVE CIZGI           TO  DET-FILLER

       WRITE LISTE-REC FROM DETAY1
       ADD 1 TO LISTE-SATIR
       MOVE ALL "_"    TO CIZGI-01 CIZGI-02 CIZGI-03 CIZGI-04 CIZGI-05 CIZGI-06
                          CIZGI-01-1
       INITIALIZE DETAY1
       MOVE CIZGI           TO  DET-FILLER
       WRITE LISTE-REC FROM DETAY1
       ADD 1 TO LISTE-SATIR.

    INITIALIZE DETAY
    MOVE " "       TO DETAY-01
    COMPUTE TEMP-SAYI = TAKAS2-CEVAP(1) + TAKAS2-CEVAP(2) + TAKAS2-CEVAP(3) +
                        TAKAS2-CEVAP(4) + TAKAS2-CEVAP(5)
    MOVE TEMP-SAYI          TO 10-Z
    ADD  TEMP-SAYI          TO OTEL-CEVAP-SAYI
    MOVE 10-Z               TO DETAY-01-1
    MOVE TAKAS2-CEVAP(1)    TO DETAY-YED-1
    COMPUTE DETAY-YED-2 ROUNDED = (TAKAS2-CEVAP(1) * 100) / TEMP-SAYI
    ADD TAKAS2-CEVAP(1)     TO OTEL-CEVAP1
    MOVE DETAY-YEDEK        TO DETAY-02

    MOVE TAKAS2-CEVAP(2)    TO DETAY-YED-1
    COMPUTE DETAY-YED-2 ROUNDED = (TAKAS2-CEVAP(2) * 100) / TEMP-SAYI 
    ADD TAKAS2-CEVAP(2)     TO OTEL-CEVAP2
    MOVE DETAY-YEDEK        TO DETAY-03

    MOVE TAKAS2-CEVAP(3)    TO DETAY-YED-1
    COMPUTE DETAY-YED-2 ROUNDED = (TAKAS2-CEVAP(3) * 100) / TEMP-SAYI
    ADD TAKAS2-CEVAP(3)     TO OTEL-CEVAP3
    MOVE DETAY-YEDEK        TO DETAY-04

    MOVE TAKAS2-CEVAP(4)    TO DETAY-YED-1
    COMPUTE DETAY-YED-2 ROUNDED = (TAKAS2-CEVAP(4) * 100) / TEMP-SAYI
    ADD TAKAS2-CEVAP(4)     TO OTEL-CEVAP4
    MOVE DETAY-YEDEK        TO DETAY-05

    MOVE TAKAS2-CEVAP(5)    TO DETAY-YED-1
    COMPUTE DETAY-YED-2 ROUNDED = (TAKAS2-CEVAP(5) * 100) /  TEMP-SAYI
    ADD TAKAS2-CEVAP(5)     TO OTEL-CEVAP5
    MOVE DETAY-YEDEK        TO DETAY-06
    INITIALIZE DETAY1
    MOVE DETAY   TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1
    ADD 1 TO LISTE-SATIR.
    MOVE ALL "_"    TO CIZGI-01 CIZGI-02 CIZGI-03 CIZGI-04 CIZGI-05 CIZGI-06
                       CIZGI-01-1
    INITIALIZE DETAY1
    MOVE CIZGI           TO  DET-FILLER
    WRITE LISTE-REC FROM DETAY1
    ADD 1 TO LISTE-SATIR.
    GO OTEL-TOPLAM-READ.

RAPOR-LISTE-BITTI.
    INITIALIZE TAKAS3-REC LISTE-REC DAGILIM-CIZGI
    INITIALIZE DETAY1
    WRITE LISTE-REC FROM DETAY1

    MOVE ALL "_" TO DAGILIM-ULKE-KOD1 DAGILIM-ULKE-ADI1 DAGILIM-GELEN1
    DAGILIM-ANKET1 DAGILIM-ULKE-KOD2 DAGILIM-ULKE-ADI2 DAGILIM-GELEN2
    DAGILIM-ANKET2 DAGILIM-YUZDE1 DAGILIM-YUZDE2.
    INITIALIZE DETAY1
    MOVE DAGILIM-CIZGI TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1
*    WRITE LISTE-REC FROM DAGILIM-CIZGI AFTER 0.
*    WRITE LISTE-REC FROM DAGILIM-CIZGI AFTER 0.
    INITIALIZE DAGILIM-CIZGI.
    MOVE "Musteri Milliyeti"    TO DAGILIM-ULKE-ADI1 DAGILIM-ULKE-ADI2
    MOVE "Konaklayan"           TO DAGILIM-GELEN1 DAGILIM-GELEN2
    MOVE "Cevaplayan"           TO DAGILIM-ANKET1 DAGILIM-ANKET2
    MOVE "Yuzde"                TO DAGILIM-YUZDE1 DAGILIM-YUZDE2
    INITIALIZE DETAY1
    MOVE DAGILIM-CIZGI TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1
*    WRITE LISTE-REC FROM DAGILIM-CIZGI AFTER 0.
*    WRITE LISTE-REC FROM DAGILIM-CIZGI AFTER 0.
    INITIALIZE DAGILIM-CIZGI
    MOVE ALL "_" TO DAGILIM-ULKE-KOD1 DAGILIM-ULKE-ADI1 DAGILIM-GELEN1
    DAGILIM-ANKET1 DAGILIM-ULKE-KOD2 DAGILIM-ULKE-ADI2 DAGILIM-GELEN2
    DAGILIM-ANKET2 DAGILIM-YUZDE1 DAGILIM-YUZDE2.
    INITIALIZE DETAY1
    MOVE DAGILIM-CIZGI TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1
*    WRITE LISTE-REC FROM DAGILIM-CIZGI AFTER 0.
    INITIALIZE DAGILIM-CIZGI.
    INITIALIZE TAKAS3-REC
    START TAKAS3 KEY NOT < TAKAS3-ANAHTAR INVALID
          CONTINUE
    NOT INVALID
    INITIALIZE FS-TAKAS3 SET TEK TO TRUE
    PERFORM WITH TEST AFTER UNTIL FS-TAKAS3 = "10"
          READ TAKAS3 NEXT NO LOCK END MOVE "10" TO FS-TAKAS3
          NOT AT END
               EVALUATE TRUE
                   WHEN TEK
                        SET CIFT TO TRUE
                        MOVE TAKAS3-ANAHTAR TO DAGILIM-ULKE-KOD1 ULKE-ANAH1
                        READ ULKE NO LOCK INVALID
                             MOVE "Belirtilmemis"   TO ULKE-ADI
                        END-READ
                        MOVE ULKE-ADI                TO DAGILIM-ULKE-ADI1
                        MOVE TAKAS3-GELEN            TO 10-HANE
                        MOVE 10-HANE                 TO DAGILIM-GELEN1
                        MOVE TAKAS3-ANKET            TO 10-HANE
                        MOVE 10-HANE                 TO DAGILIM-ANKET1
                        COMPUTE EYUZDE = (TAKAS3-ANKET / TAKAS3-GELEN) * 100
                        MOVE EYUZDE                  TO DAGILIM-YUZDE1
                   WHEN CIFT
                        SET TEK TO TRUE
                        MOVE TAKAS3-ANAHTAR TO DAGILIM-ULKE-KOD2 ULKE-ANAH
                        READ ULKE NO LOCK INVALID
                             MOVE "Belirtilmemis"   TO ULKE-ADI
                        END-READ
                        MOVE ULKE-ADI               TO DAGILIM-ULKE-ADI2
                        MOVE TAKAS3-GELEN            TO 10-HANE
                        MOVE 10-HANE                TO DAGILIM-GELEN2
                        MOVE TAKAS3-ANKET            TO 10-HANE
                        MOVE 10-HANE                TO DAGILIM-ANKET2
                        COMPUTE EYUZDE = (TAKAS3-ANKET / TAKAS3-GELEN) * 100
                        MOVE EYUZDE                TO DAGILIM-YUZDE2
                        INITIALIZE DETAY1
                        MOVE DAGILIM-CIZGI TO DET-FILLER
                        WRITE LISTE-REC FROM DETAY1
                        INITIALIZE DAGILIM-CIZGI
               END-EVALUATE
          END-READ
    END-PERFORM
    END-START.

    IF TEK
       SET CIFT TO TRUE
       MOVE TAKAS3-ANAHTAR TO DAGILIM-ULKE-KOD1 ULKE-ANAH1
       READ ULKE NO LOCK INVALID
            MOVE "Belirtilmemis"   TO ULKE-ADI
       END-READ
       MOVE ULKE-ADI               TO DAGILIM-ULKE-ADI1
       MOVE TAKAS3-GELEN            TO 10-HANE
       MOVE 10-HANE                TO DAGILIM-GELEN1
       MOVE TAKAS3-ANKET            TO 10-HANE
       MOVE 10-HANE                TO DAGILIM-ANKET1
       COMPUTE EYUZDE = (TAKAS3-ANKET / TAKAS3-GELEN) * 100
       MOVE EYUZDE                TO DAGILIM-YUZDE1
       INITIALIZE DETAY1
       MOVE DAGILIM-CIZGI TO DET-FILLER
       WRITE LISTE-REC FROM DETAY1

    INITIALIZE DAGILIM-CIZGI
    MOVE ALL "_" TO DAGILIM-ULKE-KOD1 DAGILIM-ULKE-ADI1 DAGILIM-GELEN1
    DAGILIM-ANKET1 DAGILIM-ULKE-KOD2 DAGILIM-ULKE-ADI2 DAGILIM-GELEN2
    DAGILIM-ANKET2 DAGILIM-YUZDE1 DAGILIM-YUZDE2.
    INITIALIZE DETAY1
    MOVE DAGILIM-CIZGI TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1.
*    WRITE LISTE-REC FROM DAGILIM-CIZGI AFTER 0.


RAPOR-LISTE-SON.
    CLOSE SORU HALK LISTE.
RAPOR-LISTE-EXIT.
    EXIT.
DEP-TOPLAM.
    INITIALIZE CIZGI.
    MOVE ALL "_" TO CIZGI-01 CIZGI-02 CIZGI-03 CIZGI-04 CIZGI-05 CIZGI-06
                    CIZGI-01-1
    INITIALIZE DETAY1
    MOVE CIZGI TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1
*    WRITE LISTE-REC FROM CIZGI AFTER 0
*    WRITE LISTE-REC FROM CIZGI AFTER 0
    INITIALIZE DETAY
    MOVE "Departman Yuzdesi ..." TO DETAY-01
    MOVE DEP-CEVAP-SAYI     TO 10-Z
    MOVE 10-Z               TO DETAY-01-1

    INITIALIZE DETAY-YEDEK
    MOVE DEP-CEVAP1    TO DETAY-YED-1
    COMPUTE DETAY-YED-2 ROUNDED = (DEP-CEVAP1  * 100 ) / DEP-CEVAP-SAYI
    MOVE DETAY-YEDEK             TO DETAY-02

    INITIALIZE DETAY-YEDEK
    MOVE DEP-CEVAP2    TO DETAY-YED-1
    COMPUTE DETAY-YED-2 ROUNDED = (DEP-CEVAP2 *100 ) / DEP-CEVAP-SAYI
    MOVE DETAY-YEDEK             TO DETAY-03

    INITIALIZE DETAY-YEDEK
    MOVE DEP-CEVAP3    TO DETAY-YED-1
    COMPUTE DETAY-YED-2 ROUNDED = (DEP-CEVAP3 * 100 ) / DEP-CEVAP-SAYI
    MOVE DETAY-YEDEK             TO DETAY-04

    INITIALIZE DETAY-YEDEK
    MOVE DEP-CEVAP4    TO DETAY-YED-1
    COMPUTE DETAY-YED-2 ROUNDED = (DEP-CEVAP4 * 100)  / DEP-CEVAP-SAYI
    MOVE DETAY-YEDEK             TO DETAY-05

    INITIALIZE DETAY-YEDEK
    MOVE DEP-CEVAP5    TO DETAY-YED-1
    COMPUTE DETAY-YED-2 ROUNDED = (DEP-CEVAP5  * 100 ) / DEP-CEVAP-SAYI
    MOVE DETAY-YEDEK             TO DETAY-06.
    INITIALIZE DETAY1
    MOVE DETAY TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1
*    WRITE LISTE-REC FROM DETAY AFTER 0
*    WRITE LISTE-REC FROM DETAY AFTER 0
    ADD 1 TO LISTE-SATIR
    MOVE ALL "_" TO CIZGI-01 CIZGI-02 CIZGI-03 CIZGI-04 CIZGI-05 CIZGI-06
                    CIZGI-01-1
    INITIALIZE DETAY1
    MOVE CIZGI TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1
*    WRITE LISTE-REC FROM CIZGI AFTER 0
*    WRITE LISTE-REC FROM CIZGI AFTER 0
    INITIALIZE DEP-KAYIT-SAYI DEP-CEVAP1 DEP-CEVAP2 DEP-CEVAP3 DEP-CEVAP4
               DEP-CEVAP5 DEP-CEVAP-SAYI.
    INITIALIZE DETAY1
    WRITE LISTE-REC FROM DETAY1.


LISTE-BASLIK-AT.
LISTE-TARIH-TOPLAM.
    INITIALIZE CIZGI.
    MOVE TIRE TO CIZGI-SEC.
    PERFORM CIZGI-CEK.
    INITIALIZE DETAY1
    MOVE CIZGI TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1.
    ADD 1 TO LISTE-SATIR.
*    IF LISTE-SATIR > 56 MOVE SPACES TO LISTE-REC
*             WRITE LISTE-REC AFTER PAGE PERFORM RAPOR-LISTE-BASLA.

    INITIALIZE DETAY.
    MOVE "Tarihli Toplam:" TO DETAY(12:15).
    MOVE GUN-X     TO DETAY-01.
    MOVE "/"       TO ARA-01.
    MOVE AY-X      TO DETAY-02.
    MOVE "/"       TO ARA-02.
    MOVE YIL-X     TO DETAY-03.

    INITIALIZE DETAY1
    MOVE DETAY TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1.
    ADD 1 TO LISTE-SATIR.
*    IF LISTE-SATIR > 56 MOVE SPACES TO LISTE-REC
*             WRITE LISTE-REC AFTER PAGE PERFORM RAPOR-LISTE-BASLA.

    INITIALIZE CIZGI.
    MOVE TIRE TO CIZGI-SEC.
    PERFORM CIZGI-CEK.
    INITIALIZE DETAY1
    MOVE CIZGI TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1.
    ADD 1 TO LISTE-SATIR.
*    IF LISTE-SATIR > 56 MOVE SPACES TO LISTE-REC
*             WRITE LISTE-REC AFTER PAGE PERFORM RAPOR-LISTE-BASLA.
LISTE-GENEL-TOPLAM.
    INITIALIZE DETAY.
    MOVE "Genel Toplam:"  TO DETAY(01:15).

    INITIALIZE DETAY1
    MOVE DETAY TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1.
    ADD 1 TO LISTE-SATIR.
*    IF LISTE-SATIR > 56 MOVE SPACES TO LISTE-REC
*             WRITE LISTE-REC AFTER PAGE PERFORM RAPOR-LISTE-BASLA.

    INITIALIZE CIZGI.
    MOVE TIRE TO CIZGI-SEC.
    PERFORM CIZGI-CEK.
    INITIALIZE DETAY1
    MOVE CIZGI TO DET-FILLER
    WRITE LISTE-REC FROM DETAY1.
    ADD 1 TO LISTE-SATIR.
*    IF LISTE-SATIR > 56 MOVE SPACES TO LISTE-REC
*             WRITE LISTE-REC AFTER PAGE PERFORM RAPOR-LISTE-BASLA.
LISTE-SON-TOPLAM.

CIZ-CEK.
    MOVE CIZGI-SEC TO CIZ-01 CIZ-02 CIZ-03 CIZ-04 CIZ-05 CIZ-06.
ARA-CEK.
    MOVE CIZGI-SEC TO ARA-01 ARA-02 ARA-03 ARA-04 ARA-05 ARA-06.
CIZGI-CEK.
    MOVE CIZGI-SEC TO CIZGI-01 CIZGI-02 CIZGI-03 CIZGI-04 CIZGI-05 CIZGI-01-1.
TAKAS-TO-ARA.
TAKAS-TO-ARA-EX.
    EXIT.

TAKAS-AKTAR.
    INITIALIZE TOPLAM-ANKET.
    OPEN I-O GENELFIS.
    MOVE 1 TO GENELFIS-ANAHTAR.
    READ GENELFIS NO LOCK INVALID MOVE 1 TO EKRAN-FIS-1.
    IF EKRAN-FIS-1 > 20 MOVE ZERO TO EKRAN-FIS-1.
    ADD 1 TO EKRAN-FIS-1.
    MOVE EKRAN-FIS-1 TO TAKAS-NO TAKAS2-NO TAKAS3-NO.
    REWRITE GENELFIS-REC INVALID WRITE GENELFIS-REC.
    CLOSE GENELFIS.
    OPEN OUTPUT TAKAS CLOSE TAKAS OPEN I-O TAKAS WITH MASS-UPDATE.
    OPEN OUTPUT TAKAS2 CLOSE TAKAS2 OPEN I-O TAKAS2 WITH MASS-UPDATE.
    OPEN OUTPUT TAKAS3 CLOSE TAKAS3 OPEN I-O TAKAS3 WITH MASS-UPDATE.
    OPEN INPUT CEVAP1 CEVAP2 HALK.
    INITIALIZE CEVAP1-REC CEVAP2-REC 
    MOVE ILK-TARIH TO CEVAP1-TARIH
    START CEVAP1 KEY NOT < CEVAP1-ANAHTAR INVALID
          CONTINUE
    NOT INVALID
    INITIALIZE FS-CEVAP1
                 
    PERFORM WITH TEST AFTER UNTIL FS-CEVAP1 = "10"
          READ CEVAP1 NEXT NO LOCK END MOVE "10" TO FS-CEVAP1
          NOT AT END
               IF CEVAP1-TARIH > SON-TARIH
                  MOVE "10" TO FS-CEVAP1
               ELSE
                
               IF CEVAP1-ULKE  = PROG-ULKE OR PROG-ULKE = SPACES  
                  INITIALIZE CEVAP2-REC KAYIT-SAYI
                  MOVE CEVAP1-TARIH     TO CEVAP2-TARIH
                  MOVE CEVAP1-NO        TO CEVAP2-NO
                  START CEVAP2 KEY NOT < CEVAP2-ANAHTAR INVALID
                        CONTINUE
                  NOT INVALID
                  INITIALIZE FS-CEVAP2 
                  PERFORM WITH TEST AFTER UNTIL FS-CEVAP2 = "10"
                  READ CEVAP2 NEXT NO LOCK END MOVE "10" TO FS-CEVAP2
                  NOT AT END
                       IF CEVAP2-TARIH NOT = CEVAP1-TARIH OR
                          CEVAP2-NO    NOT = CEVAP1-NO 
                          MOVE "10" TO FS-CEVAP2
                          EXIT PERFORM
                       ELSE
                          IF CEVAP1-NO <> CEVAP2-NO 
                             EXIT PERFORM CYCLE
                          END-IF
                          ADD 1 TO KAYIT-SAYI

                          INITIALIZE TAKAS-REC HALK-REC
                          MOVE CEVAP2-ANA    TO HALK-ANA 
                          MOVE CEVAP2-ALT    TO HALK-ALT
                          READ HALK NO LOCK INVALID
                               CONTINUE
                          NOT INVALID
                               MOVE HALK-CEVAP   TO TAKAS-SORU
                               MOVE HALK-ANA     TO TAKAS-ANA
                               MOVE HALK-ALT     TO TAKAS-ALT
                               READ TAKAS NO LOCK INVALID
                                    INITIALIZE TAKAS-CEVAP-DIZI
                               END-READ
                               MOVE TAKAS-SORU TO TAKAS2-ANAHTAR 
                               READ TAKAS2 NO LOCK INVALID
                                    INITIALIZE TAKAS2-CEVAP-DIZI
                               END-READ
                               EVALUATE CEVAP2-YANIT
                                    WHEN 1 ADD 1 TO TAKAS-CEVAP(1)
                                    WHEN 2 ADD 1 TO TAKAS-CEVAP(2)
                                    WHEN 3 ADD 1 TO TAKAS-CEVAP(3)
                                    WHEN 4 ADD 1 TO TAKAS-CEVAP(4)
                                    WHEN 5 ADD 1 TO TAKAS-CEVAP(5)
                                    WHEN OTHER ADD 1 TO TAKAS-CEVAP(6)
                               END-EVALUATE
                               WRITE TAKAS-REC INVALID
                                     REWRITE TAKAS-REC END-REWRITE
                               END-WRITE
                               MOVE TAKAS-SORU TO TAKAS2-ANAHTAR 
                               EVALUATE CEVAP2-YANIT
                                    WHEN 1 ADD 1 TO TAKAS2-CEVAP(1)
                                    WHEN 2 ADD 1 TO TAKAS2-CEVAP(2)
                                    WHEN 3 ADD 1 TO TAKAS2-CEVAP(3)
                                    WHEN 4 ADD 1 TO TAKAS2-CEVAP(4)
                                    WHEN 5 ADD 1 TO TAKAS2-CEVAP(5)
                                    WHEN OTHER ADD 1 TO TAKAS2-CEVAP(6)
                               END-EVALUATE
                               WRITE TAKAS2-REC INVALID 
                                      REWRITE TAKAS2-REC INVALID CONTINUE 
                                      END-REWRITE
                               END-WRITE
                          END-READ
                      
                      END-IF
                  END-READ
                  END-PERFORM
                  END-START
                  IF KAYIT-SAYI > ZEROES
                     ADD 1 TO TOPLAM-ANKET
                     INITIALIZE TAKAS3-REC
                     MOVE CEVAP1-ULKE      TO TAKAS3-ANAHTAR
                     READ TAKAS3 NO LOCK INVALID
                          INITIALIZE TAKAS3-GELEN TAKAS3-ANKET
                     END-READ
                     COMPUTE TAKAS3-ANKET = TAKAS3-ANKET + 1
                     WRITE TAKAS3-REC INVALID
                           REWRITE TAKAS3-REC END-REWRITE
                     END-WRITE
                  END-IF
                END-IF
              END-IF
          END-READ
    END-PERFORM
    END-START
    CLOSE CEVAP1 CEVAP2 HALK.
    MOVE TOPLAM-ANKET TO ETOPLAM-ANKET.

TAKAS-AKTAR-EX.
    EXIT.
ZIL.
    DISPLAY OMITTED BEEP.
SON.
    CLOSE REZ KODLAR02 ACENTA KONUM TURIZM ULKE.
    EXIT PROGRAM.
ULKE-BAS-BUL.
      INITIALIZE UL1 UL2
      IF PROG-ULKE = SPACES THEN 
        MOVE "TUMU" TO R-ULKE
        ELSE
        
        MOVE PROG-ULKE(1:1) TO UL1(3:1)
        MOVE "00" TO UL1(1:2)
      OPEN INPUT ULKE
      INITIALIZE ULKE-REC
      START ULKE KEY > ULKE-ANAH INVALID
      NOT INVALID
        
        PERFORM UNTIL FS-ULKE = "10"
 
        READ ULKE NEXT NO LOCK END 
             MOVE "10" TO FS-ULKE
             NOT END
********          DISPLAY MESSAGE BOX UL1, " ", PROG-ULKE
              IF  ULKE-ANAH = UL1  THEN
                MOVE ULKE-ADI    TO R-ULKE
              
                MOVE "10" TO FS-ULKE
              END-IF
        END-READ
        END-PERFORM
     END-START
     CLOSE ULKE       
     END-IF.

