       FD aceanlas LABEL RECORD STANDARD.
       01 aceanlas-REC.
          03 aceanlas-ANAH.
             05 aceanlas-acenta               PIC X(4).
             05 aceanlas-anlasma              PIC X(2).
             05 aceanlas-anlasma-sira         pic x(08).
             05 acenanlas-filler              pic x(12).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=ACEANLAS-KABUL-BAS
          03 aceanlas-kabul-bas.
                   05 aceanlas-kabul-bas-yil  pic 9999.
                   05 aceanlas-kabul-bas-ay   pic 99  .
                   05 aceanlas-kabul-bas-gun  pic 99  .
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=ACEANLAS-KABUL-BIT
          03 aceanlas-kabul-bit.
                   05 aceanlas-kabul-bit-yil  pic 9999.
                   05 aceanlas-kabul-bit-ay   pic 99  .
                   05 aceanlas-kabul-bit-gun  pic 99  .
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=ACEANLAS-DONEM-BAS
          03 aceanlas-donem-bas.
                   05 aceanlas-donem-bas-yil  pic 9999.
                   05 aceanlas-donem-bas-ay   pic 99  .
                   05 aceanlas-donem-bas-gun  pic 99  .
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=ACEANLAS-DONEM-BIT
          03 aceanlas-donem-bit.
                   05 aceanlas-donem-bit-yil  pic 9999.
                   05 aceanlas-donem-bit-ay   pic 99  .
                   05 aceanlas-donem-bit-gun  pic 99  .
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=ACEANLAS-ANLASMA-TAR
          03 aceanlas-anlasma-tar.
                   05 aceanlas-anlasma-yil    pic 9999.
                   05 aceanlas-anlasma-ay     pic 99  .
                   05 aceanlas-anlasma-gun    pic 99  .
          03 aceanlas-anlasma-oncelik  pic 99.
          03 aceanlas-anl-zorunlu      pic 9.
          03 aceanlas-aks-yok          pic 9.
          03 aceanlas-aks-yok-zor      pic 9. 
          03 aceanlas-spe-yok          pic 9.
          03 aceanlas-spe-yok-zor      pic 9. 
          03 aceanlas-ear              pic 9. 
          03 aceanlas-ear-zor          pic 9.
         
          03 aceanlas-bos2             pic x(08).
      *    03 aceanlas-1chi-sinir       pic 99.
      *    03 aceanlas-2chi-sinir       pic 99.
      *    03 aceanlas-1fre-sinir       pic 99.
      *    03 aceanlas-2fre-sinir       pic 99.
          03 aceanlas-yasli-sinir      pic 99.
***************odeme plani*************************
          03 aceanlas-eb-odeme-orani   pic 9(3)v99.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=ACEANLAS-EB-ODEME-TARIHI
          03 aceanlas-eb-odeme-tarihi.
            05 aceanlas-eb-odeme-yil   pic 9(4).
            05 aceanlas-eb-odeme-ay    pic 9(2).
            05 aceanlas-eb-odeme-gun   pic 9(2).
          03 aceanlas-eb-calisma-tipi  pic x.
          03 aceanlas-eb-odeme-tipi    pic x.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=ACEANLAS-ODEME-TARIHI
          03 aceanlas-odeme-tarihi.
            05 aceanlas-odeme-yil      pic 9(4).
            05 aceanlas-odeme-ay       pic 9(2).
            05 aceanlas-odeme-gun      pic 9(2).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=ACEANLAS-VADE-TARIH
          03 aceanlas-vade-tarih.
            05 aceanlas-vade-yil       pic 9(4).
            05 aceanlas-vade-ay        pic 9(2).
            05 aceanlas-vade-gun       pic 9(2).
          03 aceanlas-peryot           pic 9(03).
          03 aceanlas-once-sonra       pic x.
          03 aceanlas-calisma-kon-tipi pic x.
          03 aceanlas-min-max-var       pic 9.
          03 aceanlas-min-gece         pic 99.
          03 aceanlas-max-gece         pic 999.
          03 aceanlas-hs               pic 9.
          03 aceanlas-sart-var         pic 9.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=ACEANLAS-SART-BAS
          03 aceanlas-sart-bas.
                   05 aceanlas-sart-bas-yil  pic 9999.
                   05 aceanlas-sart-bas-ay   pic 99  .
                   05 aceanlas-sart-bas-gun  pic 99  .
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=ACEANLAS-SART-BIT
          03 aceanlas-sart-bit.
                   05 aceanlas-sart-bit-yil  pic 9999.
                   05 aceanlas-sart-bit-ay   pic 99  .
                   05 aceanlas-sart-bit-gun  pic 99  .
          03 aceanlas-sart-min-gece         pic 99.
          03 aceanlas-sart-max-gece         pic 999.
          03 aceanlas-sart-haric            pic 9 .
          03 aceanlas-yassinir         pic x(10).
          03 aceanlas-haftatek      pic 9.
          03 aceanlas-tutar-sira       pic 9.
          03 aceanlas-sart-var-online pic 9.
          03 ACEANLAS-HS-GUN pic x.
          03 aceanlas-ace-kom-uygulama pic 9.
          03 aceanlas-referans         pic 9.
          03 aceanlas-bos              pic x(18).
*************** 03 aceanlas-bos              pic x(100).          



