*
 FD acenflt LABEL RECORD STANDARD.
 01 acenflt-REC.
    02 acenflt-ANAH.
       03 acenflt-KODU        PIC X(02).
       03 acenflt-acenta      PIC X(04).
    02 acenflt-ADI            PIC X(25).
*
