*
 FD acendft LABEL RECORD IS STANDARD.
 01 acendft-rec.


      03 filler.
          05 acendft-ANAH.
             07 acendft-DOS           PIC XXX.
             07 acendft-DOS-ANAH      PIC X(30).
             07 acendft-SIRA          pic 99. 
       03 not-gerisi. 

 
       05 acendft-banka            pic x(2).
       05 acendft-banka-sabit      pic 9.
       05 acendft-doviz            pic x(2).
       05 acendft-doviz-sabit      pic 9.
       05 acendft-pan-tipi         pic x(2).
       05 acendft-pansiyon-sabit   pic 9.
       05 acendft-odeme-tipi       pic x(2).
       05 acendft-odeme-sabit      pic 9.
       05 acendft-anlasma          pic x(2).
       05 acendft-anlasma-sabit    pic 9.
       05 acendft-pazar            pic x(2).
       05 acendft-pazar-sabit      pic 9.
       05 acendft-ulke             pic x(3).
       05 acendft-ulke-sabit       pic 9.
       05 acendft-fix              pic 9.
       05 acendft-fix-sabit        pic 9.
       05 acendft-early            pic 9.
       05 acendft-early-sabit      pic 9.
       05 acendft-aksiyon-yok      pic 9.
       05 acendft-aksiyonyok-sabit pic 9.
       05 acendft-bilboard         pic 9.
       05 acendft-bilboard-sabit   pic 9.
       05 acendft-special-yok      pic 9.
       05 acendft-specialyok-sabit pic 9.
       05 acendft-vip              pic x(2).
       05 acendft-vip-sabit        pic 9.
       05 acendft-kaynak-1         pic xx.
       05 acendft-kaynak-1-sabit   pic 9.
       05 acendft-kaynak-2         pic xx.
       05 acendft-kaynak-2-sabit   pic 9.
       05 acendft-kaynak-3         pic xx.
       05 acendft-kaynak-3-sabit   pic 9.
       05 acendft-ozl-drm          pic 99.
       05 acendft-ozl-drm-sabit    pic 9.
       05 ziller                     pic x(2435).


       

