***************
 FD ACENFAT LABEL RECORD IS STANDARD.
 01 ACENFAT-REC.
   02 ACENFAT-ANAH.
      03 ACENFAT-TARIH.
         04 ACENFAT-YIL      PIC 9999.
         04 ACENFAT-AY       PIC 99.
         04 ACENFAT-GUN      PIC 99.
      03 ACENFAT-PROFIL.
        05 acenfat-p-sirket    PIC X(8).
        05 acenfat-p-no        pic 9(8).
      03 acenfat-pan         pic xx.
      03 acenfat-grup        pic 9(6).
      03 acenfat-op          pic xx.
      03 ACENFAT-GECELEME    PIC 9999.
      03 acenfat-eb          pic x.
      03 acenfat-voucher     pic x(29).
      03 acenfat-kv-orani          pic 9.
      03 ACENFAT-FOLIO       PIC 9(08).
      03 acenfat-kfolio     pic 9(08).
      03 ACENFAT-PENCERE     PIC 9.
      03 ACENFAT-TIP         PIC X.
      03 ACENFAT-KDV         PIC 999V99.
      03 acenfat-peryod      pic 9.
   02 acenfat-gerisi .
   03 acenfat-per-degerler.   
      04 acenfat-per-geceleme   pic 9999.
      04 ACENFAT-TL-FARK        PIC s9(15)V99.
      04 ACENFAT-GER-DV-FARK    PIC s9(09)V99.
      04 ACENFAT-GER-TL-FARK    PIC s9(09)V99.
      04 ACENFAT-TL-TUTAR       PIC s9(15)V99.
      04 ACENFAT-GER-DV-TUTAR   PIC s9(09)V99.
      04 ACENFAT-GER-TL-TUTAR   PIC s9(09)V99.
      04 acenfat-matrah1        pic s9(09)V99.
      04 acenfat-matrah2        pic s9(09)V99. 
      04 acenfat-matrah3        pic s9(09)V99.
      04 acenfat-kv-matrah      pic s9(09)V99. 
      04 ACENFAT-MATRAH8        PIC s9(09)V99.
      04 ACENFAT-MATRAH18       PIC s9(09)V99.
      04 acenfat-kdv1           pic s9(09)V99.
      04 acenfat-kdv2           pic s9(09)V99. 
      04 acenfat-kdv3          pic s9(09)V99.
      04 acenfat-kv            pic s9(09)V99. 
      04 ACENFAT-KDV8           PIC s9(09)V99.
      04 ACENFAT-KDV18          PIC s9(09)V99.
   
   
   03 ACENFAT-E-H            PIC X.
   03 acenfat-fat-no         pic 9(6).
   03 ACENFAT-acenta            PIC X(4).
   03 ACENFAT-sirket            PIC X(5).
   03 acenfat-ger-f             pic x.
   03 acenfat-ger-folio         pic 9(8).
   03 acenfat-ger-islem         pic 9(8).
   03 acenfat-har-depkod            pic x(15).
   03 acenfat-ref              pic 9.
   03 ACENFAT-bos            PIC X(2).
  
   03 acenfat-hesler.
     05 acenfat-anl-tut        pic 9(9)v99. 
     05 acenfat-peryotlar occurs 10 times.
      07 acenfat-per-gece      pic 999.
      07 acenfat-per-tut       pic 9(9)v99.
   03 ACENFAT-STAF           PIC X(04).
******************** TIP 1-ROOM
******************** TIP 2-EXTRA


 FD ACENFAT2 LABEL RECORD IS STANDARD.
 01 ACENFAT2-REC.
   02 ACENFAT2-ANAH.
      03 ACENFAT2-TARIH.
         04 ACENFAT2-YIL      PIC 9999.
         04 ACENFAT2-AY       PIC 99.
         04 ACENFAT2-GUN      PIC 99.
      03 ACENFAT2-FOLIO       PIC 9(08).
      03 ACENFAT2-PENCERE     PIC 9.
      03 acenfat2-peryot      pic 9.
   02 ACENFAT2-TL-TUTAR       PIC s9(15)V99.
   02 acenfat2-fat-no         pic 9(6).
   02 acenfat2-kv             pic 9.
   02 ACENFAT2-BOS            PIC X(40).
   02 acenfat2-har-depkod            pic x(3).
   02 ACENFAT2-GRUP           PIC 9(6).
   02 acenfat2-re             pic x.
   02 acenfat2-hesler.
     03 acenfat2-anl-tut        pic 9(9)v99. 
     03 acenfat2-peryotlar occurs 10 times.
      05 acenfat2-per-gece      pic 999.
      05 acenfat2-per-tut       pic s9(9)v99.
   02 ACENFAT2-STAF           PIC X(04).


