         COPY "genel.lib".
         COPY "genelfis.lib".
         COPY "acenta.lib".
         COPY "ulke.lib".
         COPY "dokumer.lib".
         COPY "kodlar02.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".  
       COPY "odalar.lib".                                                                                                      
