$XFD FILE =acesch
FD  acesch LABEL RECORD IS STANDARD.
01 acesch-REC.
 02 acesch-anah.
    03 acesch-acenta-kodu          pic x(04).
    03 acesch-bos-anah             pic x(20).
 02 acesch-client-id               pic x(50).
 02 acesch-data.
     03 acesch-kime       pic x(200).
     03 acesch-cc         pic x(100).
     03 acesch-bcc        pic x(100).
     03 acesch-konu       pic x(100).
     03 acesch-ustyazi    pic x(300).
     03 acesch-altyazi    pic x(300).
 02 acesch-bos                     pic x(500).

