*
 fd aceuyruk label record standard.
 01 aceuyruk-rec.
    02 aceuyruk-anah.  
       03 aceuyruk-acenta    pic x(4).
       03 aceuyruk-uyruk     pic x(5).
       03 aceuyruk-bos-anah     pic x(100).
    02 aceuyruk-diger. 
       03 aceuyruk-k-bas-tar.
          04 aceuyruk-k-bas-yil pic 9999.         
          04 aceuyruk-k-bas-ay  pic 99.         
          04 aceuyruk-k-bas-gun pic 99.         
       03 aceuyruk-k-bit-tar.
          04 aceuyruk-k-bit-yil pic 9999.         
          04 aceuyruk-k-bit-ay  pic 99.         
          04 aceuyruk-k-bit-gun pic 99.         
       03 aceuyruk-s-bas-tar.
          04 aceuyruk-s-bas-yil pic 9999.         
          04 aceuyruk-s-bas-ay  pic 99.         
          04 aceuyruk-s-bas-gun pic 99.         
       03 aceuyruk-s-bit-tar.
          04 aceuyruk-s-bit-yil pic 9999.         
          04 aceuyruk-s-bit-ay  pic 99.         
          04 aceuyruk-s-bit-gun pic 99.         
       03 bantstok-bos         pic x(3000).

