         COPY "genel.lib".
         COPY "genelfis.lib".
         COPY "kllnc.lib".
         COPY "acenta.lib".
         COPY "dokumer.lib".
         COPY "aksiyon.lib".
         COPY "aksiyhrk.lib".
         copy "konum.lib".
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib". 
        copy "not.lib".      
        copy "odalar.lib".                             
