
        COPY "banka.lib"       OF "..\..\OTEL\LIB-SEL".
        COPY "genel.lib".
        COPY "errorlog.lib".
        COPY "genelfis.lib".
        COPY "dokumer.lib"     OF "..\..\OTEL\LIB-SEL". 
         copy "odalar.lib".
        COPY "logindex.lib".                                                    
