*
 FD  BANKA
    LABEL RECORD IS STANDARD.
 01 BANKA-REC.
     02 BANKA-KODU                   PIC  X(2).
     02 BANKA-ADI                    PIC  X(20).
     02 BANKA-SUBESI                 PIC  X(20).
     02 BANKA-ADRES-1                PIC  X(20).
     02 BANKA-ADRES-2                PIC  X(20).
     02 BANKA-TELEFON                PIC  X(09).
     02 banka-cevrim                 pic  x.
     02 BANKA-MERKEZ-BANKASINDAN-AL  PIC X.
     02 BANKA-MERKEZ-BANKASINA-ORANI PIC S99V99.
     02 BANKA-STAF                   PIC  X(04).
