*
 fd bantlog label record standard.
 01 bantlog-rec.
    02 bantlog-anah.
       03 bantlog-sorgu-yeri  pic x. | web - onburo
       03 bantlog-arama-tipi  pic x. | oda- rez-kolbantno
       03 bantlog-sorgu-no    pic x(10). 
       03 bantlog-tarih.
          04 bantlog-yil      pic 9999.
          04 bantlog-ay       pic 99.
          04 bantlog-gun      pic 99.
       03 bantlog-zaman.                 | saat dak›ka san›ye
          04 bantlog-saat     pic 99.
          04 bantlog-dakika   pic 99.
          04 bantlog-saniye   pic 99.
       03 bantlog-sira        pic 9(02).
    02 bantlog-donus          pic x(200). | ok yada hata uyarisi
    02 bantlog-oda            pic x(04).
    02 bantlog-giris-tar.
       03 bantlog-giris-yil   pic 9999.
       03 bantlog-giris-ay    pic 99.
       03 bantlog-giris-gun   pic 99.
    02 bantlog-cikis-tar.
       03 bantlog-cikis-yil   pic 9999.
       03 bantlog-cikis-ay    pic 99.
       03 bantlog-cikis-gun   pic 99.
    02 bantlog-adi            pic x(20).
    02 bantlog-soyadi         pic x(20).
    02 bantlog-kolbant-no     pic x(30).
    02 bantlog-kolbant-durumu pic 9.
    02 bantlog-staff          pic x(04).
    02 bantlog-bos            pic x(500).

