*
 fd bantstok label record standard.
 01 bantstok-rec.
    02 bantstok-anah.  
       03 bantstok-anah-kodu pic 9.
       03 bantstok-anah-bos  pic x(100).
    02 bantstok-diger. 
       03 bantstok-ambar       pic x(2).         
       03 bantstok-departman   pic x(3).
       03 bantstok-sirket      pic x(8).
       03 bantstok-ip          pic x(15).
       03 bantstok-bos         pic x(3000).

