*
 FD bavelsir LABEL RECORD STANDARD.
 01 bavelsir-REC.
   02 bavelsir-anah.
      03 bavelsir-sirket-kodu    pic x(02).
      03 bavelsir-bos-anah       pic x(20).
   02 bavelsir-diger.
      03 bavelsir-suplier-id        pic x(30).
      03 bavelsir-company           pic x(100).
      03 bavelsir-tax-id            pic x(50).
      03 bavelsir-adress            pic x(100).
      03 bavelsir-city              pic x(50).
      03 bavelsir-zip               pic x(50).
      03 bavelsir-province          pic x(50).
      03 bavelsir-country           pic x(50).
      03 bavelsir-unit-name         pic x(100).
      03 bavelsir-unit-adress       pic x(100).
      03 bavelsir-customer-unit-id  pic x(30).
      03 bavelsir-email             pic x(100).
      03 bavelsir-pp3doviz-ekle     pic 9.
      03 bavelsir-destination       pic x(20).
      03 bavelsir-hotel-code        pic x(20).
      03 bavelsir-hotel-name        pic x(60).
      03 bavelsir-bos               pic x(199).

      


