*
 fd beklelog label record standard.
 01 beklelog-rec.
    02 beklelog-anah. 
       03 beklelog-prog-id    pic 9(03).
       03 beklelog-anah-bos   pic x(50).

    02 beklelog-diger. 
       03 beklelog-k-kodu     pic x(04).

       03 beklelog-tarih.
          04 beklelog-yil pic 9(04).
          04 beklelog-ay  pic 9(02).
          04 beklelog-gun pic 9(02).

       03 beklelog-zaman.
          04 beklelog-st  pic 9(02).
          04 beklelog-dk  pic 9(02).
          04 beklelog-sn  pic 9(02).

       03 kolbant-bos             pic x(1500).

* beklelog-prog-id ------> Verilen Degerler -> Program ve .asy Adi
* ----------------------->>>>>>>>>>>>>>>> 1 -> Bilboard Bakim Programi (bilinit.asy)
*
*
*
*                          
