       FD beklerez LABEL RECORD STANDARD.
       01 beklerez-REC.
           02 beklerez-anah. 
              03 beklerez-service-id    pic x(240).
              03 beklerez-logid         pic 9(10).
           02 beklerez-diger.
              03 beklerez-isimler occurs 7 times.
                 04 beklerez-adi        pic x(20).
                 04 beklerez-soyadi     pic x(20).
                 04 beklerez-dog-tar.
                    05 beklerez-dog-yil pic 9(4).
                    05 beklerez-dog-ay  pic 9(2).
                    05 beklerez-dog-gun pic 9(2).
                 04 beklerez-title      pic x(20).
                 04 beklerez-yas        pic x(3).
                 04 beklerez-milliyet   pic x(3).
                 04 beklerez-occ-bos    pic x(47).
              03 beklerez-gir-tar.
                 04 beklerez-gir-yil    pic 9(4).
                 04 beklerez-gir-ay     pic 9(2).
                 04 beklerez-gir-gun    pic 9(2).
              03 beklerez-cik-tar.
                 04 beklerez-cik-yil    pic 9(4).
                 04 beklerez-cik-ay     pic 9(2).
                 04 beklerez-cik-gun    pic 9(2).
              03 beklerez-sat-tar.
                 04 beklerez-sat-yil    pic 9(4).
                 04 beklerez-sat-ay     pic 9(2).
                 04 beklerez-sat-gun    pic 9(2).
              03 beklerez-acenta-kodu   pic x(200).
              03 beklerez-doviz-kodu    pic x(10).
              03 beklerez-konum         pic x(20).
              03 beklerez-kisi.
                 04 beklerez-buyuk      pic x(2).
                 04 beklerez-kucuk      pic x(2).
                 04 beklerez-free       pic x.
                 04 beklerez-bebek      pic x.
              03 beklerez-sejour-kodu   pic x(250).
              03 beklerez-voucher                pic x(50).
              03 beklerez-konfirme-edildi        pic 9. 
              |1-konfirme 2-not konfirme           
              03 beklerez-pan-kodu               pic x(10).
              03 beklerez-QuotaType              pic 9.
              03 beklerez-PmsStatus              pic 9.
              03 beklerez-ConfirmationStatus     pic x.
              03 beklerez-ReservationStatus      pic 9.
              03 beklerez-FreeOfCharge           pic x.
              03 beklerez-PromosyonRoom          pic x.
              03 beklerez-balayi-mi              pic x. |Y-Yes N-No
              03 beklerez-gercek-rezno           pic 9(8).              
              03 beklerez-konfirme-tar.
                 04 beklerez-konfirme-yil        pic 9(4).
                 04 beklerez-konfirme-ay         pic 9(2).
                 04 beklerez-konfirme-gun        pic 9(2). 
              03 beklerez-onb-yazildi            pic 9.
              03 beklerez-not-konfirme-kod       pic x(100).
              03 beklerez-oda-adet               pic 99.
              03 beklerez-hata-aciklama          pic x(100).
              03 beklerez-konfirme-notu          pic x(40).
              03 beklerez-extrabed               pic x(5).
              03 beklerez-TourOpCode             pic x(30).
              03 beklerez-touropname             pic x(70).
              03 beklerez-RoomName               pic x(50).
              03 beklerez-genel-not              pic x(40).
              03 beklerez-soldprice              pic 9(5)v99.
              03 beklerez-ConfirmationNo         pic x(20).              
              03 beklerez-geceleme               pic 999.
              03 beklerez-fiyat                  pic 9(5)v99.
              03 beklerez-bos                    pic x(490).
              03 beklerez-staf                   pic x(4).
