       FD BILBORD LABEL RECORD STANDARD.
       01 BILBORD-REC.
          02 BILBORD-ANAH.
             03 BILBORD-ACENTA     PIC X(04).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=BILBORD_TARIH
             03 BILBORD-TARIH.
                04 BILBORD-YIL     PIC 9999.
                04 BILBORD-AY      PIC 99.
                04 BILBORD-GUN     PIC 99.
             03 BILBORD-ODA-TIP    PIC 99.

          02 BILBORD-ODA           PIC 9(04) COMP-3.
          02 BILBORD-release         PIC 9(04) COMP-3.
          02 BILBORD-SAT-ODA       PIC 9(04) COMP-3.
          02 BILBORD-SAT-BUYUK     PIC 9(04) COMP-3.

          02 BILBORD-rson-tarih           PIC 9(10).
          
          02 BILBORD-STAF          PIC X(04).
