*
 COPY "logindex.lib".
 COPY "genel.lib".
 COPY "kllnc.lib".
 COPY "errorlog.lib".
 COPY "genelfis.lib".
 COPY "dokumer.lib" .
 copy "takvim.lib".
 copy "blokd.lib".
 copy "rez.lib".
 copy "odalar.lib".
 FD takas LABEL RECORD STANDARD.
 01 takas-REC.
          02 takas-ANAH.
             03 takas-rez-no   pic 9(8).
          02 takas-diger.
             03 takas-bos   pic xx.


 
