       FD blokupg LABEL RECORD STANDARD.
       01 blokupg-REC.
          02 blokupg-anah.
             03 blokupg-fis-no          pic 9(8).
          02 blokupg-diger.
             03 blokupg-eski-konum         pic 99.
             03 blokupg-yeni-konum         pic 99.
             03 blokupg-upgrade-tarih.
                04 blokupg-upgrade-yil     pic 9999.
                04 blokupg-upgrade-ay      pic 99.
                04 blokupg-upgrade-gun     pic 99.
             03 blokupg-upgrade-zaman.
                04 blokupg-upgrade-saat    pic 99.
                04 blokupg-upgrade-dakika  pic 99.
                04 blokupg-upgrade-saniye  pic 99.
             03 blokupg-kim-yapti          pic x(4).
             03 blokupg-upgrade-nedeni     pic x(2).
             03 blokupg-hangi-bilgisayar   pic x(100).
             03 blokupg-rezno              pic 9(8).
             03 blokupg-rez-rec            pic x(800).
             03 blokupg-aciklama           pic x(300).
             03 blokupg-yetkili-sifre-k-kodu pic x(4).
             03 blokupg-stopta              pic 9.
             03 blokupg-tutanak-no         pic x(19).
             03 blokupg-bos                  pic x(976).
          
