       FD blok LABEL RECORD STANDARD.
       01 blok-REC.
          02 blok-ANAHTAR.
             03 blok-kodu      PIC 9(6).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=BLOK_TARIH
             03 blok-tarih.
                04 blok-yil    pic 9(4).
                04 blok-ay     pic 9(2).
                04 blok-gun    pic 9(2).
             03 blok-konum     pic x(2).
             03 blokfiller     pic x(15).
          02 blok-bilgiler.
             03 blok-ayrilan.
                04 blok-ayrilan-oda   pic s9(4).
                04 blok-ayrilan-pax   pic 9(4).
                04 blok-ayrilan-child pic 9(4).
                04 blok-ayrilan-free  pic 9(4).
                04 blok-ayrilan-tutar pic 9(12)v9(2).
             03 blok-satilan.
                04 blok-satilan-oda   pic s9(4).
                04 blok-satilan-pax   pic 9(4).
                04 blok-satilan-child pic 9(4).
                04 blok-satilan-free  pic 9(4).
                04 blok-satilan-tutar pic 9(12)v9(2).
             03 blok-kalan.
                04 blok-kalan-oda     pic s9(4).
                04 blok-kalan-pax     pic 9(4).
                04 blok-kalan-child   pic 9(4).
                04 blok-kalan-free    pic 9(4).
                04 blok-kalan-tutar   pic 9(12)v9(2).
             03 blok-durumu           pic x.|S-Silindi I-iptal
             03 blok-kisi-dagilim.
                04 blok-single-oda    pic 9(3).
                04 blok-double-oda    pic 9(3).
                04 blok-triple-oda    pic 9(3).
                04 blok-quarter-oda   pic 9(3).
          02 filler                   pic x(37).
           
             

