       FD bloklog LABEL RECORD STANDARD.
       01 bloklog-REC.
          02 bloklog-ANAHTAR.
             03 bloklog-kodu      PIC 9(6).
             03 bloklog-tarih.
                04 bloklog-yil    pic 9(4).
                04 bloklog-ay     pic 9(2).
                04 bloklog-gun    pic 9(2).
             03 bloklog-konum     pic x(2).
             03 bloklog-log-tar.
                04 bloklog-log-yil pic 9(4).
                04 bloklog-log-ay  pic 9(2).
                04 bloklog-log-gun pic 9(2).
             03 bloklog-log-zaman.
                04 bloklog-log-saat   pic 9(2).
                04 bloklog-log-dak    pic 9(2).
                04 bloklog-log-saniye pic 9(2).
             03 bloklogfiller     pic x(15).
          02 bloklog-bilgiler.
             03 bloklog-ayrilan.
                04 bloklog-ayrilan-oda   pic s9(4).
                04 bloklog-ayrilan-pax   pic 9(4).
                04 bloklog-ayrilan-child pic 9(4).
                04 bloklog-ayrilan-free  pic 9(4).
                04 bloklog-ayrilan-tutar pic 9(12)v9(2).
             03 bloklog-satilan.
                04 bloklog-satilan-oda   pic s9(4).
                04 bloklog-satilan-pax   pic 9(4).
                04 bloklog-satilan-child pic 9(4).
                04 bloklog-satilan-free  pic 9(4).
                04 bloklog-satilan-tutar pic 9(12)v9(2).
             03 bloklog-kalan.
                04 bloklog-kalan-oda     pic s9(4).
                04 bloklog-kalan-pax     pic 9(4).
                04 bloklog-kalan-child   pic 9(4).
                04 bloklog-kalan-free    pic 9(4).
                04 bloklog-kalan-tutar   pic 9(12)v9(2).
             03 bloklog-durumu           pic x.|S-Silindi I-iptal
             03 bloklog-kisi-dagilim.
                04 bloklog-single-oda    pic 9(3).
                04 bloklog-double-oda    pic 9(3).
                04 bloklog-triple-oda    pic 9(3).
                04 bloklog-quarter-oda   pic 9(3).
          02 filler                   pic x(37).

           
             

