       FD blokd LABEL RECORD STANDARD.
       01 blokd-REC.
          02 blokd-ANAH.
             03 blokd-tarih.
                04 blokd-yil         pic 9(4).
                04 blokd-ay          pic 9(2).
                04 blokd-gun         pic 9(2).
             03 blokd-zaman.
                04 blokd-saat        pic 9(2).
                04 blokd-dakika      pic 9(2).
                04 blokd-saniye      pic 9(2).
             03 blokd-rez-no         pic 9(8).
             03 blokd-bos-anah       pic x(30).
          02 blokd-diger.
             03 blokd-k-kodu         pic x(4).
             03 blokd-odano          pic x(4).
             03 blokd-bos            pic x(500).

