*

 COPY "genel.lib".
 COPY "genelfis.lib".
 copy "dokumer.lib".
 COPY "odalar.lib".
 COPY "konum.lib".
 COPY "konuk.lib".
 copy "kat.lib".
 copy "kodlar02.lib".
 COPY "acenta.lib".
 COPY "doviz.lib".
 COPY "rez.lib".
 COPY "teknik.lib".
 COPY "banka.lib".
 COPY "takvim.lib".

*
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
