*
 COPY "dokumer.lib".
 COPY "genel.lib".
 
 COPY "genelfis.lib".
 copy "malzeme.lib".
 copy "break.lib".
 copy "doviz.lib".
 copy "odalar.lib".
 
*
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
