**********
 FD break  LABEL RECORD STANDARD.
  01 break-REC.
     02 break-anah.
        03 break-doviz-kodu             pic 9(02).
        03 break-kodu                   pic x(08).
     02 break-adi                       pic x(100).
     02 filler occurs 15 times.
        03 break-mlz-kodu               pic x(03).
        03 break-hes-tipi               pic x.
        03 break-tutar                  pic 9(6)v99.
     02 break-tipi                      pic x.       
     02 break-bos                       pic x(299).
     02 break-staf                      pic x(04).

