*
 FD bsirunv LABEL RECORD STANDARD.
 01 bsirunv-REC.
   02 bsirunv-anah.
      03 bsirunv-sirket-kodu    pic 99.
      03 bsirunv-bos-anah       pic x(20).
   02 bsirunv-diger.
      03 bsirunv-satir1       pic x(200).
      03 bsirunv-satir2       pic x(200).
      03 bsirunv-satir3       pic x(200).
      03 bsirunv-satir4       pic x(200).
      03 bsirunv-satir5       pic x(200).
      03 bsirunv-satir6       pic x(200).

      03 bsirunv-bos               pic x(300).

      


