*
 COPY "dokumer.lib".
 COPY "genel.lib".
 copy "bsirunv.lib".
 COPY "genelfis.lib".
 copy "konum.lib".
            copy "odalar.lib".  
*
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
