       FD bupgfiy LABEL RECORD STANDARD.
       01 bupgfiy-REC.   
          02 bupgfiy-anah.
             03 bupgfiy-id            pic 9(8).
          02 bupgfiy-diger.        
             03 bupgfiy-bas-tar.     
                04 bupgfiy-bas-yil    pic 9(4).
                04 bupgfiy-bas-ay     pic 9(2).
                04 bupgfiy-bas-gun    pic 9(2).
             03 bupgfiy-bit-tar.
                04 bupgfiy-bit-yil    pic 9(4).
                04 bupgfiy-bit-ay     pic 9(2).
                04 bupgfiy-bit-gun    pic 9(2).
             03 bupgfiy-eski-konum    pic x.
             03 bupgfiy-yeni-konum    pic x.
          02 bupgfiy-diger2.         
             03 bupgfiy-kisi-oda-basi pic x. | K-kisi basi O-Oda basi
             03 bupgfiy-ss            pic s9(3)v99.
             03 bupgfiy-cocuk-ind     pic s9(3)v99.
             03 bupgfiy-uc-kisi-ind   pic s9(3)v99.
             03 bupgfiy-dort-kisi-ind pic s9(3)v99.
             03 bupgfiy-tutar         pic s9(4)v99.
             03 bupgfiy-eski-konum-anahtar pic 99.
             03 bupgfiy-yeni-konum-anahtar pic 99.
             03 bupgfiy-dvz-kodu      pic 99.
             03 bupgfiy-bos           pic x(0994).
             03 bupgfiy-staf          pic x(4).

                



 
