       FD bupgind LABEL RECORD STANDARD.
       01 bupgind-REC.   
          02 bupgind-anah.
             03 bupgind-id           pic 9(8).
          02 bupgind-diger.
             03 bupgind-bas-tar.
                04 bupgind-bas-yil   pic 9(4).
                04 bupgind-bas-ay    pic 9(2).
                04 bupgind-bas-gun   pic 9(2).
             03 bupgind-bit-tar.
                04 bupgind-bit-yil   pic 9(4).
                04 bupgind-bit-ay    pic 9(2).
                04 bupgind-bit-gun   pic 9(2).
             03 bupgind-eski-konum   pic x.
             03 bupgind-yeni-konum   pic x.
          02 bupgind-diger2.
             03 bupgind-kisi-oda-basi pic x. | K-kisi basi O-Oda basi
             03 bupgind-ss           pic s9(3)v99.
             03 bupgind-cocuk-ind    pic s9(3)v99.
             03 bupgind-uc-kisi-ind  pic s9(3)v99.
             03 bupgind-dort-kisi-ind  pic s9(3)v99.
             03 bupgind-ind-tutar      pic s9(4)v99.
             03 bupgind-eski-konum-anahtar pic 99.
             03 bupgind-yeni-konum-anahtar pic 99.
             03 bupgind-bos            pic x(0987).
             03 bupgind-tum-upgrade-gecerli pic 9.
             03 bupgind-bupgfiy-id     pic 9(8).
             03 bupgind-staf           pic x(4).

                



 
