         copy "genel.lib".
         copy "bilbord.lib".
         copy "acenta.lib".
         copy "konum.lib".
         copy "takvim.lib".
         

        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".                                                    
