*
         COPY "genel.lib".
         COPY "takvim.lib".

        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".
        copy "odalar.lib".                                            
