*
 fd carpan label record standard.
 01 carpan-rec.
    02 carpan-anah. 
       03 carpan-acenta   pic x(4).
       03 carpan-anlasma  pic xx.
       03 carpan-kategori.
          05 carpan-buyuk pic 9.
          05 carpan-kucuk pic 9.
       03 carpan-konum    pic 99.
       03 carpan-bos      pic x(100).
    02 carpan-diger.  
       03 carpan-degeri   pic 99v99.      
       03 carpan-bos      pic x(780).

