         copy "genel.lib".
         copy "kontrat.lib".
         copy "acenhrk.lib".
        
         copy "rez.lib".
         copy "cast.lib".
         copy "takvim.lib".
         copy "acenhrk.lib" replacing  
         leading "acenhrk" by "tacenhrk".
        
         copy "acenta.lib".
           copy "odalar.lib".
         copy "errorlog.lib".
         copy "genelfis.lib".
         copy "logindex.lib".  
         
         
         
