       FD CASTDON LABEL RECORD STANDARD.
       01 CASTDON-REC.
         02 CASTDON-ANAH.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=CASTDON-TARIH
              03 CASTDON-TARIH.
                 04 CASTDON-YIL         PIC 9(4).
                 04 CASTDON-AY          PIC 9(2).
                 04 CASTDON-GUN         PIC 9(2).
              03 CASTDON-DEVREMULK-NO   PIC 9(08).
          02 CASTDON-REZ-NO             PIC 9(08).   
          02 CASTDON-ODA-NO             PIC X(04).
          02 CASTDON-REZ-ODA-NO         PIC X(04).
          02 CASTDON-TIPI               PIC X(01).
          02 CASTDON-DOLU               PIC 9.
          02 CASTDON-BOS                PIC X(49).
********* CASTDON-TIPII - K = KIRALANDI - S= SATILDI- BOS = NORMAL
**************CAST-DOLU : DEVREMULK SAHIBININ O GUN HAKKINI DOLDURMUS
