
       FD cast  LABEL RECORD STANDARD.
          01 cast-rec.
           02 cast-anah.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      *$XFD NAME=CAST_TARIH
              03 cast-tarih.
                 04 cast-yil       PIC 9(4).
                 04 cast-ay        PIC 9(2).
                 04 cast-gun       PIC 9(2).
              03 cast-rez-no       PIC 9(08).
           02 cast-oda-no          PIC X(04).
           02 cast-kisi.
              03 cast-buyuk        PIC 9(02).
              03 cast-kucuk        PIC 9(02).
              03 cast-bebek        PIC 9(01).
              03 cast-free         PIC 9(01).
           02 cast-fiyati          PIC 9(10)V99 COMP-3.
           02 cast-anlasma-fiyati  PIC 9(10)V99 COMP-3.
           02 cast-basilan-fiyat   PIC s9(10)V99 COMP-3.
           02 cast-oda-konumu      PIC 99.
           02 cast-fiyat-konumu    PIC 99.
           02 cast-anlasma         PIC XX.
           02 cast-pan-tipi        PIC XX.
           02 cast-oda-adet        PIC 9.
           02 cast-share           PIC 9.
           02 cast-fiyat-yok       pic 9. 
           02 cast-duzeltme        PIC s9(7)v99.
           02 cast-sharenum        pic 9(8).
           02 cast-break.       
              05 filler occurs 15 times.
                  10 cast-br-malzeme-kodu   pic x(3).
                  10 cast-br-malzeme-tut    pic s9(6)v99 comp-3.
           02 cast-break-kodu       pic x(8).
           02 cast-grup             pic 9(6).
           02 cast-extradir         pic 9.
           02 cast-rate-kodu        pic x(8) .
           02 cast-duzeltme-break   pic s9(7)v99. 
           02 cast-bos9              pic x(268).       

***********CAST-ODA-ADET    0 Ise Sharing yapilmis rez demektir
***********                  Istatistiklerde oda sayilmamali.
***********                  Normalde her rez icin 1 olmali
***********CAST-KISI-KONAKLAMA  "E" Kisi Konaklama Var
***********                      "H" Kisi Konaklama Yok





