       FD CAST2  LABEL RECORD STANDARD.
       01 CAST2-REC.
           02 CAST2-ANAH. 
              03 CAST2-TARIH.
                 04 CAST2-YIL       PIC 9(4).
                 04 CAST2-AY        PIC 9(2).
                 04 CAST2-GUN       PIC 9(2).
              03 CAST2-REZ-NO       PIC 9(08).
           02 CAST2-ODA-NO          PIC X(04).
           02 CAST2-KISI.
              03 CAST2-BUYUK        PIC 9(02).
              03 CAST2-KUCUK        PIC 9(02).
              03 CAST2-BEBEK        PIC 9(01).
              03 CAST2-FREE         PIC 9(01).
           02 CAST2-FIYATI          PIC 9(10)V99 COMP-3.
           02 CAST2-ANLASMA-FIYATI  PIC 9(10)V99 COMP-3.
           02 CAST2-BASILAN-FIYAT   PIC 9(10)V99 COMP-3.
           02 CAST2-ODA-KONUMU      PIC 99.
           02 CAST2-FIYAT-KONUMU    PIC 99.
           02 CAST2-ANLASMA         PIC XX.
           02 CAST2-PAN-TIPI        PIC XX.
           02 CAST2-ODA-ADET        PIC 9.
           02 CAST2-KISI-KONAKLAMA  PIC X. 
           02 FILLER                PIC X(10).

***********CAST2-ODA-ADET    0 Ise Sharing yapilmis rez demektir
***********                  Istatistiklerde oda sayilmamali.
***********                  Normalde her rez icin 1 olmali
***********CAST2-KISI-KONAKLAMA  "E" Kisi Konaklama Var
***********                      "H" Kisi Konaklama Yok
***********02 CAST2-BOS            PIC X(10).
