
       FD CASTDEV  LABEL RECORD STANDARD.
          01 CASTDEV-REC.
           02 CASTDEV-ANAH.
              03 CASTDEV-TARIH.
                 04 CASTDEV-YIL       PIC 9(4).
                 04 CASTDEV-AY        PIC 9(2).
                 04 CASTDEV-GUN       PIC 9(2).
              03 CASTDEV-ODA          PIC X(04).
           02 CASTDEV-SOZHRK-ANAH     PIC X(24).
           02 CASTDEV-SOZTAR-ANAH     PIC X(26).
           02 CASTDEV-BOS             PIC x(500).
           02 CASTDEV-STAF            PIC X(04).


