       FD CEK LABEL RECORD STANDARD.
       01 CEK-REC.
          02 CEK-ANAH.
             03 CEK-ISL-NO                  PIC 9(10).
          02 CEK-TIPI                       PIC XX.
          02 CEK-A-V                        PIC X.
          02 CEK-DURUMU                     PIC X.
          02 CEK-ISL-TAR.
             03 CEK-ISL-YIL                 PIC 9(04).
             03 CEK-ISL-AY                  PIC 9(02).
             03 CEK-ISL-GUN                 PIC 9(02).
          02 CEK-VADE.
             03 CEK-VADE-YIL                PIC 9(04).
             03 CEK-VADE-AY                 PIC 9(02).
             03 CEK-VADE-GUN                PIC 9(02).
          02 CEK-VALOR.
             03 CEK-VALOR-YIL               PIC 9(04).
             03 CEK-VALOR-AY                PIC 9(02).
             03 CEK-VALOR-GUN               PIC 9(02).
          02 CEK-ODEME.
             03 CEK-ODE-YIL                 PIC 9(04).
             03 CEK-ODE-AY                  PIC 9(02).
             03 CEK-ODE-GUN                 PIC 9(02).
          02 CEK-BANKA                      PIC 9(02).
          02 CEK-BANKA-SUBE                 PIC X(50).
          02 CEK-NO                         PIC X(15).
          02 CEK-HESAP-NO                   PIC X(15).
          02 CEK-KESIDE-YERI                PIC X(15).
          02 CEK-ILK-CARI                   PIC X(15).
          02 CEK-SON-CARI                   PIC X(15).
          02 CEK-TUTAR                      PIC 9(12)V99.
          02 CEK-ACIKLAMA                   PIC X(100).
          02 CEK-REFERANS                   PIC 9(03).
          02 CEK-MUHASEBE-EH                PIC X.
          02 CEK-DOVIZLIMI                  PIC X.
             88 CEK-TL       VALUE "T"," ".
             88 CEK-DOVIZLI  VALUE "D".
          02 CEK-DOVIZ-BANKA-KODU            PIC XX.
          02 CEK-DOVIZ-KODU                  PIC XX.
          02 CEK-DOVIZ-EFEKTIF-ALIS-SATIS    PIC XX.
             88 CEK-DOVIZ-ALIS   VALUE "DA".
          02 CEK-DOVIZ-TUTAR                 PIC 9(12)V9(2).
          02 CEK-DOVIZ-KUR                   PIC 9(06)V9(5).
          02 CEK-DOVIZ-KILIT                 PIC X.
             88 CEK-DOVIZ-KILITLI    VALUE "E".
          02 CEK-NOT-1                       PIC X(100).
          02 CEK-NOT-2                       PIC X(100).
          02 CEK-DEVRE-SOZLESME              PIC X(10).
          02 CEK-ONAY                        PIC 9.
          02 CEK-ODEYEN                      pic x(20).
          02 CEK-BOS                         PIC X(69).
          02 CEK-STAF                        PIC X(04).
*********> Cek-Tipi => C=>Cek    S=>Senet D=>Diger
*********> Cek-A-V  => A=>Alinan V=>Verilen
*********> Cek-Durumu => P=>Cek;Portfoyde (Elimizde)
*********>               X=>Cek;Tahsil Edildi veya Odenedi....
*********>               C=>Cek;Ciro Edildi...................
*********>               K=>Cek;Karsiliksiz...................
*********> Cek-Ilk-Cari => Cekin alindigi veya verildigi cari koddur...
*********> Cek-Son-Cari => Cekin ciro edildigi cari koddur.............
