         copy "genel.lib".
         copy "genelfis.lib".
         copy "isyeri.lib".
         copy "kllnc.lib".
         copy "konuk.lib".
         copy "romhrk.lib".
         copy "depkod.lib".
         copy "exthrk.lib".
         copy "cektr.lib".
         copy "kodlar02.lib".
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib". 
           copy "not.lib".
             copy "odalar.lib".                                  
