       FD CEKTR LABEL RECORD STANDARD.
       01 CEKTR-REC.
          02 CEKTR-ANAH.
             03 CEKTR-ESKI-FOLIO PIC 9(08). 
             03 CEKTR-YENI-FOLIO PIC 9(08). 
             03 CEKTR-ISLEM      PIC 9(08).
          02 CEKTR-ISL-TARIH.     
             03 CEKTR-ISL-YIL    PIC 9999.
             03 CEKTR-ISL-AY     PIC 99.
             03 CEKTR-ISL-GUN    PIC 99.
          02 CEKTR-ISLEM-TIPI    PIC X.
          02 CEKTR-ISLEM-TIPI2   PIC X.
          02 CEKTR-TARIH.     
             03 CEKTR-YIL        PIC 9999.
             03 CEKTR-AY         PIC 99.
             03 CEKTR-GUN        PIC 99.
          02 CEKTR-DEPKOD        PIC 999.
          02 CEKTR-CORR-DEPKOD   PIC 999.
          02 CEKTR-BA            PIC X.
          02 CEKTR-TL-TUTAR      PIC 9(12)V99 COMP-3.
          02 CEKTR-DV-TUTAR      PIC 9(09)V99 COMP-3.
          02 CEKTR-ZAMAN.
             03 CEKTR-SAAT       PIC 99.
             03 CEKTR-DAKIKA     PIC 99.
             03 CEKTR-SANIYE     PIC 99.
          02 CEKTR-KART-NO       PIC X(05).
          02 CEKTR-CEKNO         PIC 9(06).
          02 CEKTR-POS-KODU      PIC X(02).
          02 cektr-on-odeme      pic 9.
          02 CEKTR-BOS           PIC X(09).
          02 CEKTR-ESTAF         PIC X(04).
          02 CEKTR-STAF          PIC X(04).




