       FD CEVAP1 LABEL RECORD STANDARD.
       01 CEVAP1-REC.
          02 CEVAP1-ANAHTAR.
             03 CEVAP1-TARIH.
                04 CEVAP1-YIL           PIC 9(04).
                04 CEVAP1-AY            PIC 9(02).
                04 CEVAP1-GUN           PIC 9(02).
             03 CEVAP1-NO               PIC 9(06).
          02 CEVAP1-ADI                 PIC X(20).
          02 CEVAP1-SOYADI              PIC X(20).
          02 CEVAP1-ADRES1              PIC X(20).
          02 CEVAP1-ADRES2              PIC X(20).
          02 CEVAP1-ULKE                PIC X(3).
          02 CEVAP1-ACENTA              PIC X(4).
          02 CEVAP1-ODA-NO              PIC X(4).
          02 CEVAP1-TEL                 PIC X(20).
          02 CEVAP1-BOS                 PIC X(46).
          02 CEVAP1-STAF                PIC X(04).
