
         COPY "genelfis.lib".
         COPY "genel.lib".
         COPY "dokumer.lib" OF "..\..\OTEL\LIB-SEL".
         COPY "doviz.lib" OF "..\..\OTEL\LIB-SEL".
       COPY "errorlog.lib".
         copy "odalar.lib".
        COPY "logindex.lib".  
        copy "donem.lib".
        copy "donem2.lib". 
        copy "prim.lib". 
        copy "primhrk.lib".  
        copy "gorev.lib".  
        copy "danisman.lib".
        copy "musteri.lib".
