       FD danisman LABEL RECORD STANDARD.
        01 danisman-rec.
          02 danisman-anah.
             03 danisman-kodu                              pic 9(05). 
             03 danisman-anah-bos                          pic x(20).
          02 danisman-tc                                   pic 9(11).
          02 danisman-adi                                  pic x(20).
          02 danisman-soyadi                               pic x(20).
          02 danisman-prof-anah.
             03 danisman-prof-sirket                       pic x(8).
             03 danisman-prof-no                           pic 9(8).
          02 danisman-bagli-kodu                           pic 9(05).
          02 danisman-gorev-kodu                           pic 9(03).
          02 danisman-birim                                pic 9.
          02 danisman-pasif                                pic 9.
          02 danisman-onay                                 pic 9.
          02 danisman-kayit-tarih.
             03 danisman-kayit-yil                         pic 9999.
             03 danisman-kayit-ay                          pic 99.
             03 danisman-kayit-gun                         pic 99.
          02 danisman-puani                                pic 9(9).
          02 danisman-sabit-prim                           pic 9.
          02 danisman-bos                                  pic x(199).
          02 danisman-staf                                 pic x(4).




                                                                       
         
