         COPY "genel.lib".
         COPY "odalar.lib".
         COPY "konum.lib".
         COPY "genelfis.lib".
         COPY "acenta.lib".
         COPY "dokumer.lib".
         COPY "konuk.lib".
         COPY "odadegis.lib".
         COPY "takvim.lib".
         COPY "kllnc.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib". 
        copy "rez.lib".   
        copy "cast.lib". 
        copy "kodlar02.lib".                       
