fd demihk label record standard.
01 demihk-rec.
   02 demihk-anahtar.
      03 demihk-oda                    pic x(04).
      03 demihk-sira                   pic 9(04).
      03 demihk-anah-bos               pic x(20).
   02 demihk-demikod                   pic 9(06).
   02 demihk-adet                      pic 9(03).
   02 demihk-folio                     pic 9(8).  
   02 demihk-fat-maliyet               pic 9(6)v99.
   02 demihk-bos                       pic x(86).

fd demihktan label record standard.
01 demihktan-rec.
   02 demihktan-anahtar.
      03 demihktan-kodu                pic 9(6).
   02 demihktan-adi                    pic x(100).
   02 demihktan-bos                    pic x(500).
   02 demihktan-staf                   pic x(4).


