fd demi label record standard.
01 demi-rec.
   02 demi-anahtar.
      03 demi-oda                    pic x(04).
      03 demi-sira                   pic 9(04).
      03 demi-anah-bos               pic x(20).
   02 demi-satkod                    pic 9(04).
   02 demi-adet                      pic 9(03).
   02 demi-folio                     pic 9(8).  
   02 demi-fat-maliyet               pic 9(6)v99.
   02 demi-bos                       pic x(86).

