         COPY "genel.lib".
         COPY "depart.lib".
         COPY "genelfis.lib".
         COPY "errorlog.lib".
         COPY "logindex.lib".
         copy "prohrk.lib".
         copy "dokumer.lib".
         copy "odalar.lib".

