       FD depekhiz LABEL RECORD STANDARD.
          01 depekhiz-REC.
             02 depekhiz-ANAHTAR.
                03 depekhiz-rez         PIC 9(08).
                03 depekhiz-depkod      PIC 9(03).
                03 depekhiz-sira        PIC 9(06).
             02 depekhiz-tarih.                         
                03 depekhiz-yil              pic 9(04).      
                03 depekhiz-ay               pic 9(02).      
                03 depekhiz-gun              pic 9(02).      
             02 depekhiz-tipi            pic x(10).      
             02 depekhiz-doviz           pic 9(02).      
             02 depekhiz-tutar           pic 9(12)v9(2). 
             02 depekhiz-durumu          pic x.         
             02 depekhiz-aciklama        pic x(200).    
             02 depekhiz-staf            pic x(04).     
             02 depekhiz-isl-tarih.                     
                03 depekhiz-isl-yil          pic 9(04). 
                03 depekhiz-isl-ay           pic 9(02). 
                03 depekhiz-isl-gun          pic 9(02). 
             02 depekhiz-islem-durumu    pic x.         
             02 depekhiz-ucak-gel-tar.                  
                03 depekhiz-ucak-gel-yil     pic 9(4).  
                03 depekhiz-ucak-gel-ay      pic 9(2).  
                03 depekhiz-ucak-gel-gun     pic 9(2).  
             02 depekhiz-ucak-gel-zaman.                
                03 depekhiz-ucak-gel-saat    pic 9(2).
                03 depekhiz-ucak-gel-dakika  pic 9(2).
                03 depekhiz-ucak-gel-saniye  pic 9(2).
             02 depekhiz-ucus-no         pic x(20).
             02 depekhiz-kayit-staf      pic x(04).
             02 depekhiz-lobby-alinis.
                03 depekhiz-lbb-st           pic 99.
                03 depekhiz-lbb-dk           pic 99.
             02 depekhiz-bos             pic x(457).
             
*********> depekhiz-durumu = "I" Inhouse "S" Silinmis kayit
