       FD DEPKOD LABEL RECORD STANDARD.
       01 DEPKOD-REC.
          02 DEPKOD-ANAH.
             03 DEPKOD-KODU      PIC 9(03).
          02 DEPKOD-ADI          PIC X(30).
          02 DEPKOD-BA           PIC X.
          02 DEPKOD-KDV          PIC 99.
          02 DEPKOD-SERVIS-ORAN  PIC 99.
          02 DEPKOD-TURU         PIC 9.
          02 DEPKOD-TIPI         PIC 9.
          02 DEPKOD-MAKBUZ       PIC X.
          02 DEPKOD-MATRAH-HESAP PIC X(15).
          02 DEPKOD-KDV-HESAP    PIC X(15).
          02 DEPKOD-TOPLAM-HESAP PIC X(15).
          02 DEPKOD-MATRAH-BA    PIC X.
          02 DEPKOD-MAHSUP-DETAY PIC X. 
          02 DEPKOD-FATURA-TAKIP PIC X.
          02 depkod-kullanma     pic 9.
          02 DEPKOD-ref          PIC 9.
          02 DEPKOD-STAF         PIC X(04).
********> DEPKOD-BA = B=>Borc Departmani A=>Alacak Departmani
********> DEPKOD-TIPI = 1=>Genel, 2=>Oda, 3=>Extra, 4=>Telefon, 5=>Diger vs...
********> DEPKOD-SERVIS-ORAN = Bu departmana yapilan islemlerden servis
********>                      ayrilacak ise o girilir....
********> DEPKOD-MAKBUZ      = Bu departmana yapilan islemlerde makbuz
********>                      verilmesi isteniyors "E" girilir.....
********> DEPKOD-TURU  B Ise = 1-Genel
********>                    = 2-Correction
********>                    = 3-Guest Refund
********>                    = 4-Paid Out
********>                    = 5-Diger
********> DEPKOD-TURU  A Ise = 1-Genel
********>                    = 2-Correction
********>                    = 3-Nakit
********>                    = 4-Kredi
********>                    = 5-Kredi Karti
********>                    = 6-Diger
********> DEPKOD-FATURA-TAKIBI = "E" ise bu dep. fatura takibi var
**************
*************$XFD FILE =depkod2
      $XFD FILE =depkod2
       FD DEPKOD2 LABEL RECORD STANDARD.
       01 DEPKOD2-REC.
          02 DEPKOD2-ANAH.
             03 DEPKOD2-KODU      PIC 9(03).
          02 DEPKOD2-ADI          PIC X(30).
          02 DEPKOD2-BA           PIC X.
          02 DEPKOD2-KDV          PIC 99.
          02 DEPKOD2-MATRAH-HESAP PIC X(15).
          02 DEPKOD2-KDV-HESAP    PIC X(15).
          02 DEPKOD2-TOPLAM-HESAP PIC X(15).
          02 depkod2-sira         pic 999.
          02 Depkod2-ana          pic x(03).
          02 Depkod2-kate         pic x(01).
          02 Depkod2-alt-kate     pic x(02).
          02 DEPKOD2-kasa-HESAP PIC X(15).
          02 DEPKOD2k-MATRAH-HESAP PIC X(15).
          02 DEPKOD2k-KDV-HESAP    PIC X(15). 
          02 depkod2-sil-fis-ciksin pic 9.
          02 depkod2-upgrade      pic 9.
          02 depkod2-max-tut      pic 9(5)v99.
          02 depkod2-dov-kod      pic 99.
          02 depkod2-late-cout    pic 9.
          02 depkod2-isk-dep      pic 9.
          02 depkod2-havale       pic 9.
          02 depkod2-dov-tah      pic 9.
          02 depkod2-yeni-kdv     pic 99.
          02 depkod2-merkez-kodu  pic 999.
          02 depkod2-kv-uygula    pic 9.
          02 depkod2-kv-hesabi    pic 9.
          02 DEPKOD2-KV-HESAP    PIC X(15). 
          02 DEPKOD2-BOS          PIC X(9).
          02 DEPKOD2-STAF         PIC X(04).          
