         copy "genel.lib".
         copy "genelfis.lib". |in "../../muhb/lib-sel/".
         copy "depkod.lib".
         copy "merkod.lib".
         copy  "telkim.lib".
         copy  "odalar.lib".
         copy "fihrist.lib".
         copy "onkasa.lib".
         copy "doviz.lib".
         copy "dokumer.lib".
         copy "hesap.lib"   in "../../muhb/lib-sel/".
         copy "cari.lib"   in "../../muhb/lib-sel/".
         copy "errorlog.lib".
         copy "logindex.lib".