         COPY "genel.lib".
         COPY "genelfis.lib".
         COPY "depkod.lib".
         COPY "depozit.lib".
         COPY "konuk.lib".
         COPY "odalar.lib".
         COPY "doviz.lib".
         COPY "dokumer.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
