       FD devarac LABEL RECORD STANDARD.
        01 devarac-rec.
          02 devarac-anah.
             03 devarac-sira-no                          pic 9(6).
          02 devarac-arac-plaka                       pic x(10). 
          02 devarac-tarih.
              03 devarac-yil                              pic 9999.
              03 devarac-ay                               pic 99.
              03 devarac-gun                              pic 99.
          02 devarac-gelis-yeri                           pic x(50).
          02 devarac-arac-tur                             pic xx.
          02 devarac-tutar                                pic 9(9)v99.
          02 devarac-sofor                                pic x(50).
          02 devarac-telefon                              pic x(20).
          02 devarac-yolcu                                pic 9(4).
          02 devarac-bos                                  pic x(1000). ||mkmkmk

