       FD devaracl LABEL RECORD STANDARD.
        01 devaracl-rec.
          02 devaracl-anah.
              03 devaracl-sira-no                   pic 9(6).
              03 devaracl-sira                      pic 9(9).
          02 devaracl-arac-plaka                pic x(10). 
          02 devaracl-gelis-yeri                   pic x(50).
          02 devaracl-ad                           pic x(20).
          02 devaracl-soyad                        pic x(20).
          02 devaracl-tc                           pic 9(11).
          02 devaracl-cep                          pic x(20).
          02 devaracl-tel                          pic x(20).
         02 devaracl-danisman                      pic 99999.

