       FD DEVFIYAT LABEL RECORD STANDARD.
        01 devfiyat-rec.
          02 devfiyat-anah.
             03 devfiyat-konum-kodu                        pic 9(02). 
             03 devfiyat-anah-bos                          pic x(20).
          02 devfiyat-pesin                                pic 9(12)v99.
          02 devfiyat-pesin-pesinat                        pic 9(12)v99.
          02 devfiyat-taksit                               pic 9(12)v99.
          02 devfiyat-taksit-pesinat                       pic 9(12)v99.
          02 devfiyat-bos                                  pic x(200).
