         COPY "genel.lib".
         COPY "rez.lib".
         COPY "genelfis.lib".
         COPY "dokumer.lib".
         COPY "takvim.lib".
         COPY "onkasa.lib".
         COPY "onkasar.lib".
         COPY "depkod.lib".
          COPY "odalar.lib".
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
