       FD DEVREMULK LABEL RECORD STANDARD.
        01 devremulk-rec.
          02 devremulk-anah.
             03 devremulk-no                     pic 9(08). 
          02 devremulk-data.
             03 devremulk-profil-anah.
                05 devremulk-profil-sirket       pic x(08).
                05 devremulk-profil-no           pic 9(08).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=DEVREMULK_SATIS_TARIHI
             03 devremulk-satis-tarihi.
                05 devremulk-satis-yil           pic 9999.
                05 devremulk-satis-ay            pic 99.
                05 devremulk-satis-gun           pic 99.
             03 devremulk-baslama-yil            pic 9999.
             03 devremulk-bitis-yil              pic 9999.
             03 devremulk-satan-profil-anah.
                05 devremulk-satan-profil-sirket pic x(08).
                05 devremulk-satan-profil-no     pic 9(08).
             03 devremulk-kontak-profil-anah.
                05 devremulk-kontak-profil-sirket pic x(08).
                05 devremulk-kontak-profil-no     pic 9(08).
             03 devremulk-oda-konumu              pic 99.
             03 devremulk-oda-no                  pic x(04).
             03 devremulk-tapu-no                 pic x(50).
             03 devremulk-gun-sayisi              pic 9(3).
             03 devremulk-durumu                  pic x.
             |-- S = Silinmis Y = Kullanimda - K = Kapali
             03 devremulk-devre-ay                pic 99.
             03 devremulk-devre-donem             pic x(04).
             03 devremulk-aciklama                pic x(300).
             03 devremulk-satis-tutari            pic 9(8)v99.
             03 devremulk-kayit-tarihi.
                05 devremulk-kayit-yil           pic 9999.
                05 devremulk-kayit-ay            pic 99.
                05 devremulk-kayit-gun           pic 99.
             03 devremulk-staf                    pic x(04).
             03 devremulk-hesap-no                pic x(15).  
             |-----devremulk eklenenler---------------------|
             03 devremulk-sozlesme-no             pic x(10).
             03 devremulk-dosya-no                pic x(10).
             03 devremulk-satan-danisman          pic 9(5).
             03 devremulk-durum                   pic x(20).
             | en alt birimden üst birime kadar prim dagýlýmlarý ve bunlar ayrý datada tutulacak esnek olabilirmiþs !
             03 devremulk-p-asistan            pic 9(5).
             03 devremulk-p-danisman           pic 9(5).
             03 devremulk-p-liddanisman             pic 9(5).
             03 devremulk-p-yondanisman             pic 9(5).
             03 devremulk-p-ilsatmud                pic 9(5).
             03 devremulk-p-yrdkor                  pic 9(5).
             03 devremulk-p-kor                     pic 9(5).
             03 devremulk-p-bolgekor                pic 9(5).
             03 devremulk-p-bolgemud                pic 9(5).
             03 devremulk-p-gkor                    pic 9(5).
             03 devremulk-p-prokor                  pic 9(5). | proje kordinatoru yokkkmus 
             03 devremulk-p-yonkur                  pic 9(5). | proje kordinatoru yokkkmus 
             |prim dagýlýmlariii
             03 devremulk-ekleyen                 pic 9(5).
             03 devremulk-odeme-turu              pic 9.
             |1-pesin 2-kredi
             03 devremulk-vekalet                 pic 9.
             03 devremulk-vekalet-no              pic 9(5).
             03 devremulk-tapu-ekleyen            pic 9(5).
             03 devremulk-parsel-no               pic 9(10).
             03 devremulk-hasarli                 pic 9.
             03 devremulk-iptal                   pic 9.
             03 devremulk-tapu                    pic 9.
             03 devremulk-prim                    pic 9(12)v99.
             03 devremulk-pesinat                 pic 9(12)v99.
             03 devremulk-prim-kodu               pic 9(4).
             03 devremulk-sabit-prim-kodu         pic 9(4).
             03 devremulk-kilit                   pic 9.
             03 devremulk-mail-order              pic 9.
             03 devremulk-arac                    pic x(15).
             03 devremulk-tapu-ver-tar.
                05 devremulk-tapu-ver-yil         PIC 9999.
                05 devremulk-tapu-ver-ay          PIC 99.
                05 devremulk-tapu-ver-gun         PIC 99.
             03 devremulk-kampanya-kodu           pic 9(4).
             03 devremulk-onay                    pic 9.
             03 devremulk-prim-atandi             pic 9.
             03 devremulk-odenen                  pic s9(8)v99.
             03 devremulk-kalan                   pic s9(8)v99.
             03 devremulk-kesin-odenen            pic s9(8)v99.
             03 devremulk-kesin-kalan             pic s9(8)v99.
             03 devremulk-hes-prim                pic s9(8)v99.
             03 devremulk-odenen-prim             pic s9(8)v99.  
             03 devremulk-kalan-prim              pic s9(8)v99. 
             03 devremulk-prim-yok                Pic 9.
             03 devremulk-danisman-kendisi        pic 9.
             03 devremulk-aidat-doviz-kodu        pic 99.
             03 devremulk-aidat-tutar             pic 9(8)v99.
             03 devremulk-fatura.
                05 devremulk-fatura-tarihi.
                    10 devremulk-fatura-yil       pic 9(4).
                    10 devremulk-fatura-ay        pic 9(2).
                    10 devremulk-fatura-gun       pic 9(2).
                05 devremulk-fatura-saati.
                   10 devremulk-fatura-saat       pic 9(2).
                   10 devremulk-fatura-dakika     pic 9(2). 
                05 devremulk-fatura-no            pic 9(8).  
                05 devremulk-kdv-oran             pic 99.
             03 devremulk-kapanan-donem           pic x(04).
             03 devremulk-fix-aidat               pic 9.
             03 devremulk-referans                pic xx.
             03 devremulk-ozel-kod                pic xx.
             03 devremulk-rci-uyesi               pic 9.
             03 devremulk-rci-no                  pic x(9).
             03 devremulk-tapu-teb-tar.
                05 devremulk-tapu-teb-yil         PIC 9999.
                05 devremulk-tapu-teb-ay          PIC 99.
                05 devremulk-tapu-teb-gun         PIC 99.
             03 DEVREMULK-BOS                     PIC X(866).

