          FD DONEM2 LABEL RECORD STANDARD.
          01 DONEM2-REC.
            02 DONEM2-ANAH.
                 03 DONEM2-KODU          PIC X(4).
            02 DONEM2-ADI                PIC X(50). 
            02 DONEM2-GUN                PIC 9(2).
            02 DONEM2-BOS                PIC X(100).
            02 DONEM2-STAF               PIC X(4).

      
