          FD DONEM LABEL RECORD STANDARD.
          01 DONEM-REC.
            02 DONEM-ANAH.
                 03 DONEM-KODU        PIC X(4).
                 03 DONEM-YILI        PIC 9(4).
            02 DONEM-BAS-TAR.
                   03 DONEM-BAS-YIL    PIC 9(04).
                   03 DONEM-BAS-AY     PIC 9(02).
                   03 DONEM-BAS-GUN    PIC 9(02).
            02 DONEM-BIT-TAR.
                   03 DONEM-BIT-YIL    PIC 9(04).
                   03 DONEM-BIT-AY     PIC 9(02).
                   03 DONEM-BIT-GUN    PIC 9(02).
            02 DONEM-BOS                PIC X(100).
            02 DONEM-STAF               PIC X(4).

      
