          FD DONhrk LABEL RECORD STANDARD.
          01 DONhrk-REC.
            02 donhrk-ANAH.
                 03 donhrk-oda          pic x(04).
                 03 donhrk-KODU         PIC X(04).
                 03 donhrk-YILI         PIC 9(04).
                 03 donhrk-devremulk-no pic 9(8).
            02 donhrk-BAS-TAR.
                   03 donhrk-BAS-YIL    PIC 9(04).
                   03 donhrk-BAS-AY     PIC 9(02).
                   03 donhrk-BAS-GUN    PIC 9(02).
            02 donhrk-BIT-TAR.
                   03 donhrk-BIT-YIL    PIC 9(04).
                   03 donhrk-BIT-AY     PIC 9(02).
                   03 donhrk-BIT-GUN    PIC 9(02).                   
            02 donhrk-BOS                PIC X(100).
            02 donhrk-tip-donem          pic x. |K-KIRALANDI
            02 donhrk-rez-no             pic 9(8).
            02 donhrk-tip-1              pic x.
            02 donhrk-rez-no-2           pic 9(8).
            02 donhrk-tip-2              pic x.
            02 donhrk-rez-no-3           pic 9(8).
            02 donhrk-tip-3              pic x.
            02 donhrk-rez-no-4           pic 9(8).
            02 donhrk-tip-4              pic x.
            02 donhrk-rez-no-5           pic 9(8).
            02 donhrk-tip-5              pic x.
            02 donhrk-trez-a-gun         pic 9(3).
            02 donhrk-trez-k-gun         pic s9(3).
            02 donhrk-donem-kapali       pic 9.
            02 donhrk-bos2               pic x(157).
            02 donhrk-durumu             pic x. |Y-YENI KAYIT S-SILINEN KAYIT
            02 donhrk-STAF               PIC X(4).

      
