         copy "genel.lib".
         copy "kllnc.lib".
         copy "dov-boz.lib".
         copy "banka.lib".
         copy "doviz.lib".
         copy "ulke.lib".
          copy "odalar.lib".
        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".                                                    
