         copy "genel.lib".
         copy "banka.lib".
         copy "doviz.lib".
         copy "kur.lib".
        COPY "odalar.lib".                                           
        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".                                                    
