       FD doviz LABEL RECORD STANDARD.
       01 doviz-rec.
          02 doviz-kodu          pic 9(2).
          02 d-kisa-adi          pic x(05).
          02 d-adi-1             pic x(20).
          02 d-aciklama-1        pic x(05).
          02 d-muh-doviz-kodu    pic 9(2).
          02 d-merkez-banka-kodu pic x(03).
          02 D-hesap             pic x(10).
          02 d-staf              pic x(04).
