* 
fd dys label record standard.
01 dys-rec.
     02 dys-anahtar.
        03 dys-anah-tip1                    pic x(5).
           88 dys-anah-tip1-diger                   value "D".
        03 dys-anah-tip2                    pic x(5).
        03 dys-fis                          pic 9(10).
        03 dys-sira                         pic 9(5).
        03 ziller                           pic x(10).
     02 dys-bilgiler.
        03 dys-ekle.
           04 dys-ekle-tarih.
              05 dys-ekle-yil               pic 9(4).
              05 dys-ekle-ay                pic 9(2).
              05 dys-ekle-gun               pic 9(2).
           04 dys-ekle-zaman.
              05 dys-ekle-saat              pic 9(2).
              05 dys-ekle-dakika            pic 9(2).
              05 dys-ekle-saniye            pic 9(2).
           04 dys-ekle-staf                 pic x(4).
           04 dys-ekle-staf-adi             pic x(20).
        03 dys-dosya-boy                    pic 9(10).
        03 dys-etiket                       pic x(30).
        03 dys-dosya-adi                    pic x(200).
        03 dys-dosya-ext                    pic x(12).
        03 dys-erisim-bilgiler.
           04 dys-erisim-tipi               pic x. | Genel,kiþisel,yetki seviyesi bazýnda erisim vs.
              88 dys-erisim-genel           value "A".
              88 dys-erisim-kisisel         value "B".
              88 dys-erisim-yetki-seviyesi  value "C".
           04 dys-erisim-sifreleri.
              05 dys-erisim-gor-sifre       pic x(20).
              05 dys-erisim-edit-sifre      pic x(20).
              05 dys-erisim-sil-sifre       pic x(20).
           04 dys-erisim-filler             pic x(500).
        03 dys-arama-1                      pic x(50).
        03 dys-arama-2                      pic x(50).
        03 dys-arama-3                      pic x(50).
        03 dys-arama-4                      pic x(50).
        03 dys-arama-5                      pic x(50).
        03 dys-filtre1                      pic x(20). | Mahsup Tipi olabilir
        03 dys-filtre2                      pic x(20). | Mahsup fis kaynagi olabilir
        03 dys-filtre3                      pic x(20). | Vs.
        03 dys-cari                         pic x(20).
        03 dys-dosya-tip                    pic x.
           88 dys-dosya-efatura-pdf    value "P"," ".
           88 dys-dosya-efatura-ubl    value "U".
           88 dys-dosya-efatura-jpg    value "J".
        03 dys-fillerxx                     pic x(199).

     02 dys-diger-bilgiler.
        03 dys-anahtar-saha                 pic x(100).|dys'ye baðlantý yapan yerin anahtar sahasý
        03 dys-anahtar-tarih.
           04 dys-anahtar-yil               pic 9(4).
           04 dys-anahtar-ay                pic 9(2).
           04 dys-anahtar-gun               pic 9(2).
        03 dys-from-modul                   pic x(10). | muha otel 
        03 dys-from-prog                    pic x(08). | mahsup.asy
        03 dys-from-dosya                   pic x(20). | mahsup referans geel vs.
     02 dys-belge-tip.
        03 dys-belge-tip1                   pic x.
           88 dys-belge-tip1-efatura   value "E".
           88 dys-belge-tip1-earsiv    value "F".
*orj           88 dys-belge-tip1-efatura   value "P".
*orj           88 dys-belge-tip1-earsiv    value "E".
        03 dys-belge-tip2                   pic x.
     02 filler                              pic x(1497).
     02 filler pic x.
*        88 DYS-ANAH-TIP1-EFATURA value "P".
*        88 DYS-ANAH-TIP1-EARSIV value "E".
     02 dys-staf                            pic x(4).

