*
       copy "genelfis.lib".
       copy "errorlog.lib".
       copy "logindex.lib".
       copy "genel.lib".
         copy "odalar.lib".
       copy "dys.lib".
       copy "dys.lib" replacing leading "dys" by "obur-dys".
       copy "kllnc.lib".
