FD earsbil LABEL RECORD STANDARD.
01 earsbil-REC.
    02 earsbil-anah.
       03 earsbil-tip          pic x. | R-Rezervasyon F-FOlio
       03 earsbil-alt-anah     pic x(100).
       03 earsbil-alt-anah-bos pic x(50).
    02 earsbil-diger.
       03 earsbil-odeme-tarihi.
          04 earsbil-odeme-yil   pic 9(4).
          04 earsbil-odeme-ay    pic 9(2).
          04 earsbil-odeme-gun   pic 9(2).
       03 earsbil-odeme-tipi     pic x.
       03 earsbil-odeme-notu     pic x(100).
       03 earsbil-odeme-web-adresi pic x(100).
       03 earsbil-kredi-karti.
          04 earsbil-kredi-karti-1  pic x(4).
          04 earsbil-kredi-karti-2  pic x(4).
       03 earsbil-kredi-karti-onay-no pic x(20).
       03 earsbil-bos               pic x(480).

