*
fd efatci label record standard.
01 efatci-rec.
     02 efatci-anahtar.
        03 efatci-tipi                           pic x(5).
        03 efatci-kodu                           pic x(20).
        03 filler                                pic x(50).

     02 efatci-unvan                             pic x(100).
     02 efatci-giris-tarih.
        03 efatci-giris-yil                      pic 9(4).
        03 efatci-giris-ay                       pic 9(2).
        03 efatci-giris-gun                      pic 9(2).

     02 efatci-islem-tarih.
        03 efatci-islem-yil                      pic 9(4).
        03 efatci-islem-ay                       pic 9(2).
        03 efatci-islem-gun                      pic 9(2).

     02 efatci-islem-zaman.
        03 efatci-islem-saat                     pic 9(2).
        03 efatci-islem-dakika                   pic 9(2).
        03 efatci-islem-saniye                   pic 9(2).

     02 efatci-filler                            pic x(1000).
     02 efatci-staf                              pic x(04). 

