*
 fd errorlog label record standard.
 01 errorlog-rec.
    02 errorlog-tarih.
       03 errorlog-yil    pic 9(2).
       03 errorlog-ay     pic 9(2).
       03 errorlog-gun    pic 9(4).
    02 filler             pic x.
    02 errorlog-zaman.
       03 errorlog-saat   pic 9(2).
       03 errorlog-dakika pic 9(2).
       03 errorlog-saniye pic 9(2).
    02 filler             pic x.
    02 errorlog-hata-1    pic x(2).
    02 filler             pic x.
    02 errorlog-hata-2    pic x(2).
    02 filler             pic x.
    02 errorlog-kllnc     pic x(4).
    02 filler             pic x.
    02 errorlog-data-isim pic x(50).
    02 filler             pic x.
    02 errorlog-user      pic x(15).
    02 filler             pic x.
    02 errorlog-sirket    pic x(08).

