       FD esBILBORD LABEL RECORD STANDARD.
       01 esBILBORD-REC.
          02 esBILBORD-ANAH.
             03 esBILBORD-ACENTA     PIC X(04).
             03 esBILBORD-TARIH.
                04 esBILBORD-YIL     PIC 9999.
                04 esBILBORD-AY      PIC 99.
                04 esBILBORD-GUN     PIC 99.
             03 esBILBORD-ODA-TIP    PIC 99.

          02 esBILBORD-ODA           PIC 9(04) COMP-3.
          02 esBILBORD-release         PIC 9(04) COMP-3.
          02 esBILBORD-SAT-ODA       PIC 9(04) COMP-3.
          02 esBILBORD-SAT-BUYUK     PIC 9(04) COMP-3.

          02 esBILBORD-rson-tarih           PIC 9(10).
          
          02 esBILBORD-STAF          PIC X(04).
