*
 FD musteri LABEL RECORD STANDARD.
 01 musteri-REC.
   02 musteri-anah.
      03 musteri-tip                   pic x.
      03 m-profil.
	      05 musteri-sirket                pic x(08).
	      05 musteri-no                    pic 9(08).
      03 musteri-bos-anah              pic x(10).
   02 musteri-adi                      pic x(20).
   02 musteri-soyadi                   pic x(20).
   02 musteri-d-tarihi.
      03 musteri-dyil                  pic 9(4).
      03 musteri-day                   pic 9(2).
      03 musteri-dgun                  pic 9(2).
   02 musteri-e-tarihi.
      03 musteri-eyil                  pic 9(4).
      03 musteri-eay                   pic 9(2).
      03 musteri-egun                  pic 9(2).
   02 musteri-o-tarihi.
      03 musteri-oyil                  pic 9(4).
      03 musteri-oay                   pic 9(2).
      03 musteri-ogun                  pic 9(2).
   02 musteri-kaynak                   pic x(02).
   02 musteri-ulke                     pic x(03).
   02 musteri-dil-1                    pic x(02).
   02 musteri-dil-2                    pic x(02).
   02 musteri-dil-3                    pic x(02).
   02 musteri-din                      pic x(02).
   02 musteri-unvan                    pic x(20).
   02 musteri-cinsiyet                 pic x.
   02 musteri-meslek                   pic x(20).
   02 musteri-e-mail                   pic x(40).
   02 musteri-web-adresi               pic x(40).
   02 musteri-kis-adrs                 pic x(50).
   02 musteri-kis-adrs1                pic x(50).
   02 musteri-kart-tipi                pic x(2).
   02 musteri-gelis-sayisi             pic 9(3).
   02 musteri-gecmis-cl-tut            pic 9(8)v99.
   02 musteri-aciklama                 pic x(40).
*/:-) Fatura bilgileri 
   02 musteri-unvan1                   pic x(50).   
   02 musteri-unvan2                   pic x(50).
   02 musteri-adres1                   pic x(50).   
   02 musteri-adres2                   pic x(50).
   02 musteri-vdairesi                 pic x(20).
   02 musteri-vno                      pic x(15).
*   02 musteri-vno                      pic x(10).
   02 musteri-il                       pic x(20).
   02 musteri-ilce                     pic x(20).
   02 musteri-tel1                     pic x(15).
   02 musteri-tel2                     pic x(15).
   02 musteri-tel3                     pic x(15).
   02 musteri-fax                      pic x(15).
   02 musteri-gsm                      pic x(15).
   02 musteri-pk                       pic x(10).
*/:-) Diger BÝlgiler
   02 musteri-hobi1                    pic x(02).
   02 musteri-hobi2                    pic x(02).
   02 musteri-hobi3                    pic x(02).
   02 musteri-hobi4                    pic x(02).
   02 musteri-gazete-1                 pic x(02).
   02 musteri-gazete-2                 pic x(02).
   02 musteri-gazete-3                 pic x(02).
   02 musteri-tv-kanali-1              pic x(02).
   02 musteri-tv-kanali-2              pic x(02).
   02 musteri-tv-kanali-3              pic x(02).
   02 musteri-tv-prog-1                pic x(02).
   02 musteri-tv-prog-2                pic x(02).
   02 musteri-tv-prog-3                pic x(02).
   02 musteri-arac-model               pic x(19).
   02 musteri-silindi                  pic 9.
   02 musteri-plaka                    pic x(15).
*/:-) Odeme Bilgileri
   02 musteri-odeme-tipi               pic x.
   02 musteri-odeme-kart-tipi          pic x.
   02 musteri-kart-sahibi              pic x(25).
   02 musteri-muhasebe-kodu            pic x(15).
   02 musteri-kart-no                  pic x(40).
   02 musteri-son-k-tarih.
     03 musteri-son-k-ay               pic 9(02).
     03 musteri-son-k-yil              pic 9(04).
   02 musteri-g-kodu                   pic x(03).
*/:-)kimlik bilgileri
   02 musteri-kim-tcno                 pic 9(11).
   02 musteri-kim-uyruk                pic x(03).
   02 musteri-kim-cinsiyet             pic x.
   02 musteri-kim-medeni               pic x.
   02 musteri-kim-adrs                 pic x(50).
   02 musteri-kim-adrs1                pic x(50).
   02 musteri-b-turu                   pic x.
   02 musteri-seri-no                  pic x(15).
   02 musteri-baba-adi                 pic x(20).
   02 musteri-ana-adi                  pic x(20).
   02 musteri-d-yeri                   pic x(30).
   02 musteri-kim-il                   pic x(20).
   02 musteri-kim-ilce                 pic x(20).
   02 musteri-kim-mahalle              pic x(20).
   02 musteri-kim-cilt                 pic x(10).
   02 musteri-kim-aile-no              pic x(10).
   02 musteri-kim-sira-no              pic x(10).
   02 musteri-k-tarih.
     03 musteri-k-yil                  pic 9(04).
     03 musteri-k-ay                   pic 9(02).
     03 musteri-k-gun                  pic 9(02).
   02 musteri-g-tarih.
     03 musteri-g-yil                  pic 9(04).
     03 musteri-g-ay                   pic 9(02).
     03 musteri-g-gun                  pic 9(02).
   02 musteri-prb-ack                  pic x.
   02 musteri-fat-ulke                 pic x(15).
   02 musteri-kazanilan-puan           pic 9(6).
   02 musteri-kullanilan-puan          pic 9(6).
   02 musteri-puan-kart-no             pic x(10).
   02 musteri-hak-edilen-tip           pic x(02).
   02 musteri-kart-tipi-2              pic x(02).
   02 musteri-gecmis-geceleme          pic 9(5).
   02 musteri-gecmis-kalis-sayisi      pic 9(3).
*   02 musteri-bos                      pic x(08).
   02 musteri-staf-ilk                 pic x(04).
   02 musteri-staf-son                 pic x(04).

*
 FD hediye LABEL RECORD STANDARD.
 01 hediye-REC.
    02 hediye-ANAH.
       03 hediye-KODU       PIC X(02).
    02 hediye-adi           pic x(30).
    02 hediye-ozellikler.
       03 hediye-puan       pic 9(6).
       03 hediye-bos        pic x(500).
*
 FD hediyhrk LABEL RECORD STANDARD.
 01 hediyhrk-REC.
    02 hediyhrk-ANAH.
       03 hediyhrk-tarih. 
          05 hediyhrk-yil         pic 9(4).
          05 hediyhrk-ay          pic 9(2).
          05 hediyhrk-gun         pic 9(2).
       03 hediyhrk-profil-anah.
          05 hediyhrk-sirket      pic x(08).
          05 hediyhrk-musteri-no  pic 9(08).
       03 hediyhrk-islem-no       pic 9(6).
    02 hediyhrk-diger.
       03 hediyhrk-hediye-kodu    pic x(02).
       03 hediyhrk-hediye-puan    pic 9(06).
       03 hediyhrk-aciklama       pic x(100).
       03 hediyhrk-bos            pic x(500).
       03 hediyhrk-staf           pic x(04).
*
 FD karttip LABEL RECORD STANDARD.
 01 karttip-REC.
    02 karttip-ANAH.
       03 karttip-KODU       PIC X(02).
    02 karttip-adi           pic x(20).
    02 karttip-ozellikler.
       03 karttip-resim-adi  pic x(30).
       03 karttip-puan       pic 9(6).
       03 karttip-bos        pic x(464).
*
 FD pformul LABEL RECORD STANDARD.
 01 pformul-REC.
          02 pformul-ANAHTAR.
             03 pformul-sira        pic x(03).   
             03 pformul-anah-bos    pic x(20).   
          02 pformul-data.
                05 pformul-tarih.
                  09 pformul-yil            pic 9(4).
                  09 pformul-ay             pic 9(2).
                  09 pformul-gun            pic 9(2).
                05 pformul-gel-carpan       pic 9(6)v99.
                05 pformul-gec-carpan       pic 9(6)v99.
                05 pformul-tut-carpan       pic 9(3)v9(5).
                05 pformul-bos               pic x(40).
                05 filler occurs 50 times.
                   09 pformul-ust-sinir     pic 9(8) .
                   09 pformul-ust-carpan    pic 9(5)v9(6).
                   09 filler pic x(20).
          02 pformul-STAF                   PIC X(04).

