*
 FD esletab LABEL RECORD STANDARD.
 01 esletab-REC.
    02 esletab-ANAH.
       03 esletab-tipi     pic XX.
       03 esletab-kodu     PIC X(80).
       03 esletab-bos-anah pic x(100).
    02 esletab-Diger.
       03 esletab-adi      PIC x(100).
       03 esletab-ope-kodu PIC x(4).
       03 esletab-kon-kodu PIC x(2).
       03 esletab-bos      pic x(1000).

