*
         copy "genel.lib".
         copy "takvim.lib".
         copy "genelfis.lib".
         copy "fihrist.lib".
         copy "dokumer.lib".
         copy "acenta.lib".
         copy "ulke.lib".
         copy "konuk.lib".
         copy "ozluk.lib".
        COPY "errorlog.lib".                                                    
        COPY "odalar.lib".                                                    
        COPY "logindex.lib".                                                    
