*
         copy "genel.lib".
         copy "takvim.lib".
         copy "genelfis.lib".
         copy "fihrist.lib".
         copy "dokumer.lib".
    
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
