***************************       
       FD event LABEL RECORD STANDARD.
       01 event-REC.
          02 event-ANAH.
             05 event-anah-bos2   pic x(20).
             05 event-id       PIC 9(9).
             05 event-anah-bos   pic x(20).
          02 event-data.
              05 event-adi         pic x(50).
              05 event-ILK-TARIH.
                 06 event-ILK-YIL PIC 9999.
                 06 event-ILK-AY  PIC 99.
                 06 event-ILK-GUN PIC 99.
              05 event-SON-TARIH.
                 06 event-SON-YIL PIC 9999.
                 06 event-SON-AY  PIC 99.
                 06 event-SON-GUN PIC 99.
              05 event-aciklama    pic x(300).
              05 event-bos         pic x(500).
              05 event-STAF        PIC X(04).


