*
         COPY "genel.lib".
         COPY "extpost.lib".
         COPY "postkod.lib".

        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib". 
        COPY "odalar.lib".                                                                                              
