         copy "genel.lib".
         copy "genelfis.lib".
         copy "kllnc.lib".
         copy "extpost.lib".
         copy "konuk.lib".
         copy "postkod.lib".
         copy "depkod.lib".
         copy "dokumer.lib".
         copy "odalar.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
