       FD fatdokum LABEL RECORD STANDARD.
       01 fatdokum-REC.
           02 fatdokum-anah.
              03 fatdokum-tarih.
                 04 fatdokum-yil      pic 9(4).
                 04 fatdokum-ay       pic 9(2).
                 04 fatdokum-gun      pic 9(2).
              03 fatdokum-zaman.
                 04 fatdokum-saat       pic 9(2).
                 04 fatdokum-dakika     pic 9(2).
                 04 fatdokum-saniye     pic 9(2).
              03 fatdokum-fat-no        pic 9(10).
              03 fatdokum-fat-sira      pic 9(6).
           02 fatdokum-diger.
              03 fatdokum-detay         pic x(400).
              03 fatdokum-bos           pic x(180).
              03 fatdokum-aciklama      pic x(20).
              03 fatdokum-staf          pic x(04).


