         COPY "takvim.lib".
         COPY "genel.lib".
         COPY "matura.lib".

        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".                                                    
