          COPY "genel.lib".
          COPY "genelfis.lib".
          COPY "isyeri.lib".
          COPY "kllnc.lib".
          COPY "fatura.lib".
          COPY "acenta.lib".
          COPY "konuk.lib".
          COPY "takvim.lib".
          COPY "dokumer.lib".
          COPY "odalar.lib".
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
