FD FCARIHRK LABEL RECORD IS STANDARD.
01 FCARIHRK-REC.
     02 FCARIHRK-ANAHTAR.
         03 FCARIHRK-TIPI            PIC X.
         03 FCARIHRK-KODU            PIC X(05).
         03 FCARIHRK-ISLEM           PIC 9(08).
     02 FCARIHRK-DETAY.
         03 FCARIHRK-TARIH.        
             04 FCARIHRK-TARIH-YIL    PIC 9(04).
             04 FCARIHRK-TARIH-AY     PIC 9(02).
             04 FCARIHRK-TARIH-GUN    PIC 9(02).
         03 FCARIHRK-ZAMAN.        
             04 FCARIHRK-ZAMAN-SAAT   PIC 9(02).
             04 FCARIHRK-ZAMAN-DAKIKA PIC 9(02).
             04 FCARIHRK-ZAMAN-SANIYE PIC 9(02).
         03 FCARIHRK-ACIKLAMA         PIC X(100).
         03 FCARIHRK-BA               PIC X.
         03 FCARIHRK-TUTAR-TL         PIC 9(08)V99.
         03 FCARIHRK-TUTAR-DOVIZ      PIC 9(08)V99.
         03 FCARIHRK-TUTAR-BANKA      PIC xx.
         03 FCARIHRK-TUTAR-DOVIZ-KODU PIC 99.
         03 FCARIHRK-TUTAR-KUR        PIC 9(02)V9999.
         03 FCARIHRK-HRK-FOLIO        PIC 9(8).
         03 FCARIHRK-BOS              PIC X(492).
         03 FCARIHRK-STAF             PIC X(04).
