FD FCARI LABEL RECORD IS STANDARD.
01 FCARI-REC.
     02 FCARI-ANAHTAR.
         03 FCARI-TIPI            PIC X. | A-ACENTA F-FIRMA D-DIGER
         03 FCARI-KODU            PIC X(5).
     02 FCARI-DETAY.
         03 FCARI-ADI             PIC X(100).
         03 FCARI-UNVANI          PIC X(100).
         03 FCARI-BOS             PIC X(1000).
         03 FCARI-STAF            PIC X(04).
