$XFD FILE=fihrist
 FD FIHRIST LABEL RECORD STANDARD.
$XFD NAME=rec
 01 FIHRIST-REC.
$XFD NAME=anahtar
    02 FIHRIST-ANAHTAR.
$XFD NAME=harf
       03 FIHRIST-HARF                  PIC XX.
$XFD NAME=fno
       03 FIHRIST-NO                    PIC 9(06).
$XFD NAME=fgrup
    02 FIHRIST-GRUP                     PIC X(03).
$XFD NAME=adi
    02 FIHRIST-ADI                      PIC X(30).
$XFD NAME=soyadi
    02 FIHRIST-SOYADI                   PIC X(30).
$XFD NAME=unvani
    02 FIHRIST-UNVANI                   PIC X(40).
$XFD NAME=adres1
    02 FIHRIST-ADRES-1                  PIC X(40).
$XFD NAME=adres2
    02 FIHRIST-ADRES-2                  PIC X(40).
$XFD NAME=adres3
    02 FIHRIST-ADRES-3                  PIC X(40).
$XFD NAME=il
    02 FIHRIST-IL                       PIC X(20).
$XFD NAME=ilce
    02 FIHRIST-ILCE                     PIC X(20).
$XFD NAME=ulke
    02 FIHRIST-ULKE                     PIC X(20).
$XFD NAME=telefon
    02 FIHRIST-TELEFON                  PIC X(20).
$XFD NAME=mobil_tel
    02 FIHRIST-MOBIL-TEL                PIC X(20).
$XFD NAME=fax
    02 FIHRIST-FAX                      PIC X(20).
$XFD NAME=internet_adresi
    02 FIHRIST-INTERNET-ADRES           PIC X(40).
$XFD NAME=email
    02 FIHRIST-EMAIL                    PIC X(40).
$XFD NAME=fnot
    02 FIHRIST-NOT                      PIC X(20).
    02 FIHRIST-adres-filtre             PIC 9(2).
    02 FIHRIST-meslek-filtre            PIC 9(2).
    02 FIHRIST-posta-kodu               PIC 9(5).
$XFD NAME=bos
    02 FIHRIST-BOS                      PIC X(191).
$XFD NAME=staf
    02 FIHRIST-STAF                     PIC X(04).