*

 copy "genel.lib".
 copy "genelfis.lib".
 copy "fihrist.lib".
 copy "telkim.lib".
 
*
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib". 
        COPY "odalar.lib".                                                                                              
