*

 copy "genel.lib".
 copy "genelfis.lib".
 copy "fihrist.lib".

*
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".   
        copy "dokumer.lib".  
        COPY "odalar.lib".                                                                                  
