*
FD  firma LABEL RECORD IS STANDARD.
01 firma-REC.
     02 firma-ANAHTAR.
         03 firma-KODU      PIC  X(05).
     02 firma-ADI       PIC  X(30).
     02 firma-UNVANI    PIC  X(50).
     02 firma-ADRESIM   PIC  X(30).
     02 firma-fatalti-ind pic 99V99.
     02 firma-butce      PIC  X(4).
     02 firma-rate        pic x(4).
     02 firma-faturada-voucher pic 99.
     02 firma-bos2      pic  x(06). 
     02 firma-V-DAIRE   PIC  X(30).
     02 firma-V-NO      PIC  X(14).
     02 firma-profil-anah.
            05 firma-profil-sirket pic x(08).
            05 firma-profil-no     pic 9(08).
     02 firma-IL        PIC  X(20).
     02 firma-ILCE      PIC  X(20).
     02 firma-ULKE      PIC  X(03).
     02 filler    PIC  99.
     02 filler     PIC  99.
     02 filler  PIC  X(2).
     02 filler     PIC  X(2).
     02 firma-PERFORMANS PIC X(3).
     02 FILLER           PIC  X(2).
     02 firma-RAP-SIRA  PIC  X(04).
     02 firma-TELEFON   PIC  X(20).
     02 firma-FAX       PIC  X(20).
     02 firma-E-MAIL    PIC   X(15).
     02 firma-MUHNO2     PIC  X(15).
     02 firma-AVANO     PIC  X(15).
     02 firma-av-oran   pic  99v99.
     02 firma-bos3      pic x.          
     02 firma-MUHNO     PIC  X(15).
     02 firma-INDIRIM   PIC  9(02).
     02 firma-TIPI      PIC  9.
     02 firma-DETAY-MAHSUP   PIC X.
     02 firma-kom-orani pic 99.  
     02 firma-master    pic x(4).
     02 firma-ULKE-KODU PIC  9(3).
     02 firma-STAF      PIC  X(04).
     
     
     
