         COPY "acenta.lib".
         COPY "genel.lib".
         COPY "odalar.lib".

        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib". 
        copy "musteri.lib".                                           
