       FD FIYATANA LABEL RECORD STANDARD.
       01 FIYATANA-REC.
          02 FIYATANA-ANAH.
             03 FIYATANA-DIGER-ANAH.
                  04 FIYATANA-PER-ANAH.
                     05 FIYATANA-ACENTA     PIC X(4).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=fiyatana_ilk_TAR
                     05 FIYATANA-ILK-TARIH.
                        06 FIYATANA-ILK-YIL PIC 9999.
                        06 FIYATANA-ILK-AY  PIC 99.
                        06 FIYATANA-ILK-GUN PIC 99.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=fiyatana_son_TAR
                     05 FIYATANA-SON-TARIH.
                        06 FIYATANA-SON-YIL PIC 9999.
                        06 FIYATANA-SON-AY  PIC 99.
                        06 FIYATANA-SON-GUN PIC 99.
                   04 FIYATANA-REZ-TIPI   PIC 9.
                   04 FIYATANA-PAN-TIPI   PIC XX.
                   04 FIYATANA-BANKA      PIC 99.
                   04 FIYATANA-DOVIZ      PIC 99.
                   04 FIYATANA-ANLASMA    PIC XX.
             03 FIYATANA-BUYUK      PIC 99.
             03 FIYATANA-KUCUK      PIC 99.
          02 FIYATANA-ODA-DIZI.
             03 FIYATANA-KONUM-DIZI OCCURS 40 TIMES.
                04 FIYATANA-ODA-FIYATI PIC 9(12)V99 COMP-3.
          02 FIYATANA-KICK-BACK     PIC 999.
          02 FIYATANA-EB-EH         PIC X.
          02 FIYATANA-EB-ORAN       PIC 9(2). 
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=FIYATANA_EB_BAS_TARIH
          02 FIYATANA-EB-BAS-TARIH.
             03 FIYATANA-EB-BAS-YIL PIC 9(4).     
             03 FIYATANA-EB-BAS-AY  PIC 9(2).     
             03 FIYATANA-EB-BAS-GUN PIC 9(2). 
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=FIYATANA_EB_BIT_TARIH    
          02 FIYATANA-EB-BIT-TARIH.
             03 FIYATANA-EB-BIT-YIL PIC 9(4).     
             03 FIYATANA-EB-BIT-AY  PIC 9(2).     
             03 FIYATANA-EB-BIT-GUN PIC 9(2).

          02 FIYATANA-UG-EH         PIC X.
          02 FIYATANA-UG-ORAN       PIC 9(2).
          02 FIYATANA-UG-geceleme   PIC 9(3).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=FIYATANA_UG_BAS_TARIH
          02 FIYATANA-UG-BAS-TARIH.
             03 FIYATANA-UG-BAS-YIL PIC 9(4).     
             03 FIYATANA-UG-BAS-AY  PIC 9(2).     
             03 FIYATANA-UG-BAS-GUN PIC 9(2).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=FIYATANA_UG_BIT_TARIH     
          02 FIYATANA-UG-BIT-TARIH.
             03 FIYATANA-UG-BIT-YIL PIC 9(4).     
             03 FIYATANA-UG-BIT-AY  PIC 9(2).     
             03 FIYATANA-UG-BIT-GUN PIC 9(2).
          02 FIYATANA-ACIKLAMA      PIC X(20).
          02 fiyatana-fiks          pic 9.
          02 fiyatana-eb-kusur      pic 99.
          02 fiyatana-ug-kusur      pic 99.
          02 FIYATANA-KICK-BACK2    PIC 999.
          02 fiyatana-d-1yc         pic 99.
          02 fiyatana-d-1yf         pic 99.
          02 fiyatana-d-2yc         pic 99.
          02 fiyatana-d-2yf         pic 99.
          02 fiyatana-resim         pic x(20).
          02 fiyatana-komisyon      pic 999v99.
          02 fiyatana-haftasonuvar   pic 9.
          02 fiyatana-kick-onbin     pic 9.
          02 fiyatana-kkp-onbin     pic 9.
          02 FIYATANA-BOS           PIC X(22).
          02 FIYATANA-STAF          PIC X(04).

********* Fiyatana-konum-dizi -> Fiyatin oda tipi (standart,suit...)
********* Fiyat-Rez-tipi      -> Fiyatin rezervasyon tipi 1-Alotment 2-It.
********* Fiyat-Pan-tipi      -> Fiyatin Pansiyon    tipi BO,BB,HB,FB,HI..
********* Fiyat-Banka         -> Hangi banka ile calisiliyor..............
********* Fiyat-Doviz         -> Hangi kur ile calisiliyor................
********* Fiyatana-Anlasma    -> Aanlasma Tipi 
********* Fiyatana-Buyuk      -> Buyuk Kisi
********* Fiyatana-Kucuk      -> Ucretli Cocuk

      $XFD FILE =fiyatind
       FD fiyatind LABEL RECORD STANDARD.
       01 fiyatind-REC.
          02 fiyatind-ANAH.
             03 fiyatind-DIGER-ANAH.
                  04 fiyatind-PER-ANAH.
                     05 fiyatind-ACENTA     PIC X(4).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=fiyatind_ilk_tar
                     05 fiyatind-ILK-TARIH.
                        06 fiyatind-ILK-YIL PIC 9999.
                        06 fiyatind-ILK-AY  PIC 99.
                        06 fiyatind-ILK-GUN PIC 99.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=fiyatind_son_tar
                     05 fiyatind-SON-TARIH.
                        06 fiyatind-SON-YIL PIC 9999.
                        06 fiyatind-SON-AY  PIC 99.
                        06 fiyatind-SON-GUN PIC 99.
                   04 fiyatind-REZ-TIPI   PIC 9.
                   04 fiyatind-PAN-TIPI   PIC XX.
                   04 fiyatind-BANKA      PIC 99.
                   04 fiyatind-DOVIZ      PIC 99.
                   04 fiyatind-ANLASMA    PIC XX.
             03 fiyatind-BUYUK      PIC 99.
             03 fiyatind-KUCUK      PIC 99.
          02 fiyatind-ODA-DIZI.
             03 fiyatind-KONUM-DIZI OCCURS 40 TIMES.
                04 fiyatind-dizi-ODA-FIYATI PIC 9(12)V99 COMP-3.
                04 fiyatind-dizi-eb-oran    pic 999v99.
                04 fiyatind-dizi-kkp        pic 999v99.
                04 fiyatind-dizi-kb         pic 999v99.
                04 fiyatind-bos-dizi        pic x(50).
          02 fiyatind-KICK-BACK     PIC 999.
          02 fiyatind-EB-EH         PIC X.
          02 fiyatind-EB-ORAN       PIC 9(2).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=fiyatind_eb_bas_tarih
          02 fiyatind-EB-BAS-TARIH.
             03 fiyatind-EB-BAS-YIL PIC 9(4).     
             03 fiyatind-EB-BAS-AY  PIC 9(2).     
             03 fiyatind-EB-BAS-GUN PIC 9(2). 
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=fiyatind_eb_bit_tarih    
          02 fiyatind-EB-BIT-TARIH.
             03 fiyatind-EB-BIT-YIL PIC 9(4).     
             03 fiyatind-EB-BIT-AY  PIC 9(2).     
             03 fiyatind-EB-BIT-GUN PIC 9(2).

          02 fiyatind-UG-EH         PIC X.
          02 fiyatind-UG-ORAN       PIC 9(2).
          02 fiyatind-UG-geceleme   PIC 9(3).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=fiyatind_ug_bas_tarih
          02 fiyatind-UG-BAS-TARIH.
             03 fiyatind-UG-BAS-YIL PIC 9(4).     
             03 fiyatind-UG-BAS-AY  PIC 9(2).     
             03 fiyatind-UG-BAS-GUN PIC 9(2). 
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=fiyatind_ug_bit_tarih    
          02 fiyatind-UG-BIT-TARIH.
             03 fiyatind-UG-BIT-YIL PIC 9(4).     
             03 fiyatind-UG-BIT-AY  PIC 9(2).     
             03 fiyatind-UG-BIT-GUN PIC 9(2).
          02 fiyatind-ACIKLAMA      PIC X(20).
          02 fiyatind-fiks          pic 9.
          02 fiyatind-eb-kusur      pic 99.
          02 fiyatind-ug-kusur      pic 99.
          02 fiyatind-KICK-BACK2    PIC 999.
          02 fiyatind-d-1yc         pic 99.
          02 fiyatind-d-1yf         pic 99.
          02 fiyatind-d-2yc         pic 99.
          02 fiyatind-d-2yf         pic 99.
          02 fiyatind-resim         pic x(20).
          02 fiyatind-komisyon      pic 999v99.
          02 fiyatind-haftasonuvar   pic 9.
          02 fiyatind-BOS           PIC X(24).
          02 fiyatind-STAF          PIC X(04).

****************************
           copy "webfiyat.lib".
       
