* 
 FD takasfiyat LABEL RECORD STANDARD.
 01 takasfiyat-rec.
    02 takasfiyat-anah.
       05  takasfiyat-rez-no       PIC 9(8).
       05 takasfiyat-tarih.
          10 takasfiyat-yil        pic 9999.
          10 takasfiyat-ay         pic 99.
          10 takasfiyat-gun        pic 99.

    02 takasfiyat-gercek.
       05 takasfiyat-eb        pic 999v9(08).
       05 takasfiyat-aks       pic 999v9(08).
       05 takasfiyat-spc       pic 999v9(08).
       05 takasfiyat-ozl       pic 999v9(08).
       05 takasfiyat-kkp       pic 999v9(08).
       05 takasfiyat-kick      pic 999v9(08).
       05 takasfiyat-fiyat           PIC s9(10)v99.
       05 takasfiyat-kur             PIC 99v99999.
       05 takasfiyat-kurcev          PIC 99v99999.
       05 takasfiyat-fiyat-tl        PIC s9(10)v99.
       05 takasfiyat-fiyat-yiy       PIC s9(10)v99.
       05 takasfiyat-fiyat-ice       PIC s9(10)v99.
       05 takasfiyat-fiyat-dig       PIC s9(10)v99.
    02 takasfiyat-anlasma.     
       05 takasfiyat2-eb        pic 999v9(08).
       05 takasfiyat2-aks       pic 999v9(08).
       05 takasfiyat2-spc       pic 999v9(08).
       05 takasfiyat2-ozl       pic 999v9(08).
       05 takasfiyat2-kkp       pic 999v9(08).
       05 takasfiyat2-kick      pic 999v9(08).
       05 takasfiyat2-fiyat           PIC s9(10)v99.
       05 takasfiyat2-kur             PIC 99v99999.
       05 takasfiyat2-kurcev          PIC 99v99999.
       05 takasfiyat2-fiyat-tl        PIC s9(10)v99.
    02 takasfiyat-ek.
       05 takasfiyat-eb-oran        pic 999v99.

         copy "cast.lib" replacing leading "cast" by "cast3" .
 
