          COPY "konuk.lib".
          COPY "genel.lib".

        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib". 
        COPY "odalar.lib".                                                 
        COPY "logindex.lib".                                                    
