          COPY "genel.lib".
          COPY "konuk.lib".
          COPY "banka.lib".
          COPY "doviz.lib".
          COPY "kodlar02.lib".
          COPY "ulke.lib".
          COPY "acenta.lib".
          COPY "odalar.lib".
        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".                                                    
