       FD formulhes LABEL RECORD STANDARD.
         01 formulhes-REC.
            02 formulhes-anah.
               03 formulhes-rez-no        pic 9(8).
               03 formulhes-tarih.
                 04 formulhes-yil         pic 9999.
                 04 formulhes-ay          pic 99.
                 04 formulhes-gun         pic 99.
               03 formulhes-anah-bos      PIC X(18).
            02 formulhes-tum-formul       pic x(500).
            02 formulhes-bos              pic x(2000).
            02 formulhes-staf             pic x(4).      

                                                  
