       FD formul LABEL RECORD STANDARD.
       01 formul-REC.
          03 formul-anah.
             05 formul-anahtar.         
               07 formul-acenta       pic x(4).
               07 formul-sira         pic x.
             05 formul-anah-bos       PIC X(19).
          03 formul-ind-sira         pic 99.
          03 formul-eb-sira          pic 99.
          03 formul-ug-sira          pic 99.
          03 formul-ozl-sira         pic 99.
          03 formul-aks1-sira        pic 99.
          03 formul-aks2-sira        pic 99.
          03 formul-so1-sira         pic 99.
          03 formul-so2-sira         pic 99.
          03 formul-kkp-sira         pic 99.
          03 formul-kom-sira         pic 99.              
          03 formul-kb-sira          pic 99.
          03 formul-fm-sira          pic 99.
          03 formul-mo-sira          pic 99.
          03 formul-ind-kumule       pic 9.
          03 formul-eb-kumule        pic 9.    
          03 formul-ug-kumule        pic 9.    
          03 formul-ozl-kumule       pic 9.    
          03 formul-aks1-kumule      pic 9.    
          03 formul-aks2-kumule      pic 9.    
          03 formul-so1-kumule       pic 9.    
          03 formul-so2-kumule       pic 9.    
          03 formul-kkp-kumule       pic 9.    
          03 formul-kom-kumule       pic 9.    
          03 formul-kb-kumule        pic 9. 
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=formul_bas_tar
          03 formul-bas-tar.
             04 formul-bas-yil       pic 9999.
             04 formul-bas-ay        pic 99.
             04 formul-bas-gun       pic 99.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=formul_bit_tar
          03 formul-bit-tar.
             04 formul-bit-yil       pic 9999.
             04 formul-bit-ay        pic 99.
             04 formul-bit-gun       pic 99.
          03 formul-tip              pic x.
          03 formul-bos              pic x(164).

