*
 FD formyaz label record is standard.
 01 formyaz-rec.
    02 formyaz-anah.
       03 formyaz-tipi                      pic x.
          88 formyaz-baslik  values are "B","b".
          88 formyaz-detay   values are "D","d".
          88 formyaz-ara-top values are "A","a".
          88 formyaz-gen-top values are "G","g".
          88 formyaz-sonuc   values are "S","s".
          88 formyaz-ozellik values are "O","o".
          88 formyaz-modul   values are "M","m".
       03 formyaz-kodu                      pic x(03).
       03 formyaz-sira                      pic 9(10).
    02 formyaz-deger                        pic x(100).
*
