       FD GALA LABEL RECORD STANDARD.
        01 GALA-REC.
                  02 GALA-ANAH.
                     03 GALA-REZ-NO        PIC 9(8).
                     03 GALA-TARIH.
                        04 GALA-TARIH-YIL  PIC 9(4).
                        04 GALA-TARIH-AY   PIC 9(2).
                        04 GALA-TARIH-GUN  PIC 9(2).
                     03 GALA-DEP-KOD       PIC 9(3).
                  02 GALA-DOVIZ-KODU       PIC X(2).
                  02 GALA-BASILACAK-TUTAR  PIC 9(8)V99.
                  02 GALA-BASILAN-TUTAR    PIC 9(8)V99.
                  02 GALA-BASILAN-FOLIO    PIC 9(8).
                  02 GALA-FOLIO-ISLENDI    PIC 9.
                  02 GALA-BOS              PIC X(500).
            
            
      
      
      
