       FD gelist  LABEL RECORD STANDARD.
       01 gelist-REC.
          02 gelist-ANAH.
             03 gelist-TARIH.  
                04 gelist-YIL           PIC 9999.
                04 gelist-AY            PIC 99.
                04 gelist-GUN           PIC 99.
             03 gelist-rez              PIC 9(8).
             03 gelist-folio            PIC 9(8). 
             
**********> Toplam Kismi........
          02 gelist-TOPLAM.
             03 gelist-oda              PIC s9(09)v99.
             03 gelist-yiy              pic s9(09)v99.
             03 gelist-ice              PIC s9(09)v99.
             03 gelist-dig              pic s9(09)v99.



       FD gelist2  LABEL RECORD STANDARD.
       01 gelist2-REC.
          02 gelist2-ANAH.
             03 gelist2-TARIH.  
                04 gelist2-YIL           PIC 9999.
                04 gelist2-AY            PIC 99.
                04 gelist2-GUN           PIC 99.
             03 gelist2-rez              PIC 9(8).
             03 gelist2-folio            PIC 9(8). 
             
**********> Toplam Kismi........
          02 gelist2-TOPLAM.
             03 gelist2-oda              PIC s9(09)v99.
             03 gelist2-yiy              pic s9(09)v99.
             03 gelist2-ice              PIC s9(09)v99.
             03 gelist2-dig              pic s9(09)v99.
             03 gelist2-alk              pic s9(09)v99.
             03 gelist2-bos              pic x(150).




