         COPY "takvim.lib".
         COPY "genelfis.lib".
         COPY "genel.lib".
         COPY "rez.lib".
         COPY "acenta.lib".
         COPY "konum.lib".
         COPY "kodlar02.lib".
         COPY "dokumer.lib".

         COPY "errorlog.lib".                                                    
         COPY "logindex.lib".   
         copy "cast.lib". 
         copy "firma.lib".
         copy "gruplar.lib".  
         copy "odalar.lib".          
