*
 fd genel2 label record standard.                  
 01 genel2-rec.                                    
    02 genel2-anah                                 pic 9. 
    02 genel2-parametreler.                        
       03 genel2-extra-post-isaretle               pic 9.        |Degisken (c-in)            sayfasindadir.   
       03 genel2-cin-mail-tel-zorunlu              pic 9.        |Degisken (onkasa)          sayfasindadir.
       03 genel2-mah-havale-virman-aktif           pic 9.        |Degisken (onkasa)          sayfasindadir.
       03 genel2-hr-musaitlik-devrede              pic 9.
       03 genel2-e-arsiv-e-fatura-kullanici-degil  pic 9.        |Degisken (rezervasyon)     sayfasindadir.
       03 genel2-useinbox-devrede                  pic 9.        |Degisken (c-in)            sayfasindadir.
       03 genel2-useinbox-mail                     pic x(150).   |Degisken (genel parametre) sayfasindadir.
       03 genel2-useinbox-pw                       pic x(20).    |Degisken (genel parametre) sayfasindadir.
       03 genel2-fat-bilgi-kisisel                 pic 9.        |Degisken (onkasa)          sayfasindadir.
       03 genel2-ozel-gunlerde-giz-cikma           pic 9.        |Degisken (c-in)            sayfasindadir.
       03 genel2-kdv-gecerlilik-tar.                            |Degisken (genel parametre) sayfasindadir.
          04 genel2-kdv-yil                   pic 9999.
          04 genel2-kdv-ay                    pic 99.
          04 genel2-kdv-gun                   pic 99.
       03 genel2-kdv-eski-depkod                   pic 9(03).    |Degisken (genel parametre) sayfasindadir.
       03 genel2-sendmail-api-key                  pic x(50).    |Degisken (genel parametre) sayfasindadir.
       03 genel2-sifir-pax-izin-verme              pic x.        |Degisken (rezervasyon)     sayfasindadir.
       03 genel2-toplam-fiyat-aktif                pic 9.        |Degisken (rezervasyon)     sayfasindadir.
       03 genel2-mahsup-matrah-kdv-degistirilsin   pic 9.
       03 genel2-kullanici-sifre-gizli             pic 9.        |Degisken (telefon)         sayfasindadir.
       03 genel2-hes-kk                            pic x(50).    |Degisken (genel parametre) sayfasindadir.
       03 genel2-hes-pw                            pic x(20).    |Degisken (genel parametre) sayfasindadir.
       03 genel2-kvkk-sorgu                        pic 9.        |Degisken (c-in)            sayfasindadir.
       03 genel2-upgrade-mail-gonderme             pic 9.        |Degisken (c-in)            sayfasindadir.
       03 genel2-aceanlas-referansli               pic 9.        |Degisken (c-in)            sayfasindadir.
       03 genel2-acenta-puan-devrede               pic 9.        |Degisken (c-in)            sayfasindadir.
       03 genel2-web-servis-kodu                   pic x(04).    |Degisken (genel parametre) sayfasindadir.
       03 genel2-mahsup-fiyat-ref                  pic 9.                                                     
       03 genel2-gelismis-telefon                  pic 9.        |Degisken (c-in)            sayfasindadir.
       03 genel2-uyumsoft-fat-ent-devrede          pic 9.        |Degisken (onkasa)          sayfasindadir.
       03 genel2-muh-refsiz-onb-refli              pic 9.        |Degisken (onkasa)          sayfasindadir.
       03 genel2-cout-late-ve-upg-kontrolu-devrede pic 9.        |Degisken (c-in)            sayfasindadir.
       03 genel2-kdv-bit-tar.                                    |Degisken (genel parametre) sayfasindadir.
          04 genel2-kdv-bit-yil                   pic 9999.
          04 genel2-kdv-bit-ay                    pic 99.
          04 genel2-kdv-bit-gun                   pic 99.
       03 genel2-dovboz-banka                      pic 99.       |Degisken (onkasa)          sayfasindadir.
       03 genel2-upg-sabit-doviz-kodu              pic 99.       |Degisken (onkasa)          sayfasindadir.
       03 genel2-rapor-comp-durumu                 pic 9.        |Degisken (genel parametre) sayfasindadir.
       03 genel2-oda-post-dep2                     PIC xxx.      |Degisken (onkasa)          sayfasindadir.
       03 genel2-upg-eur-alsin                     pic 9.
       03 genel2-kvkk-perdeleme-yil                pic 9999.
       03 genel2-kolbandi-algo-stok-yok            pic 9.
       03 genel2-onb-refsiz                        pic 9.
       03 genel2-muh-acik-acendov                  pic 9.
       03 genel2-kolayrez-dys-tip                  pic 9.        |Degisken (onkasa)          sayfasindadir.
       03 genel2-parametre-bos                     pic x(1648).        

