
       FD GENEL LABEL RECORD STANDARD.
       01 GENEL-REC.
          
          02 GENEL-ANAHTAR        PIC 9.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
          02 DONEM-BASI.
             03 DONEM-BASI-YIL    PIC 9(04).
             03 DONEM-BASI-AY     PIC 9(02).
             03 DONEM-BASI-GUN    PIC 9(02).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
        
          02 DONEM-SONU.
             03 DONEM-SONU-YIL    PIC 9(04).
             03 DONEM-SONU-AY     PIC 9(02).
             03 DONEM-SONU-GUN    PIC 9(02).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
          02 muha-gecen-sene pic x(8).
          02 genel-web-odeme pic xxx.
          02 genel-web-stil   pic x.
          02 genel-grup-extra-oda-no      pic x(4).
     
          02 CALISMA-TARIHI.
             03 CALIS-YIL         PIC 9(04).
             03 CALIS-AY          PIC 9(02).
             03 CALIS-GUN         PIC 9(02).
          02 SIRKET-ADRESKERI.
             03 OTEL-SIRKETI      PIC X(08).
             03 MUHA-SIRKETI      PIC X(08).
             03 STOK-SIRKETI      PIC X(08).
             03 COST-SIRKETI      PIC X(08).
             03 PERS-SIRKETI      PIC X(08).
             03 POSA-SIRKETI      PIC X(08).
             03 XXX1-SIRKETI      PIC X(08).
             03 genel-jandarma-bildirim.
                04 genel-jandarma-tcno pic x(11).
                04 genel-jandarma-sifre pic x(6).
      *       03 XXX2-SIRKETI      PIC X(08).
      *       03 XXX3-SIRKETI      PIC X(08).
      *    02 SCRSAVER             PIC X.
      *    02 SCR-ZAMAN            PIC 9(10).
      *    02 TEXT-ADRES           PIC X(30).
          02 genel-max-sifre-ara   pic 9(3).
          02 genel-max-dok-ara     pic 9(3).
          02 genel-max-rez-kat     pic 9.
          02 genel-max-dok-ara2    pic 9(3).
          02 genel-aktif-sifre     pic 9.
          02 genel-netsis-earsiv   pic 9.
          02 genel-depozit-oto-sil  pic 9.
          02 genel-eski-on-odeme-devrede pic 9 .
          02 GENEL-ODA-KIRLETME-DEVREDe pic 9.
          02 genel-oto-cari-ac  pic 9.
          02 genel-oda-cout-extra-kontrol-var pic 9.
          02 genel-guest-oto-isaretle pic 9.
          02 House-touch          pic x(02).
          02 genel-cari-yerelde pic 9.
          02 genel-plaka   pic 9.
          02 genel-onay   pic 9.
          02 genel-uzun-oda-no-kullanilsin pic 9.
          02 genel-beko         pic 9.
          02 genel-html-kullan pic 9.
          02 telpara-uyandirma-bas-oda pic 99.
          02 telpara-uyandirma-bit-oda pic 99.
          02 genel-online-onek  pic x(7).
          02 genel-konum-upgrade-devrede pic 9.
          02 genel-fiks-yok   pic 9.
          02 genel-dusuk-yok   pic 9.

          02 EKRAN-SEKME-SAYISI   PIC 9.
          02 genel-profil-kolbandi-aktif PIC 9.
          02 GENEL-AJANDA-CALIS   PIC X(01).
          02 GENEL-PRINTER-FILTRE PIC X.
          02 GENEL-HIST-OZ-FIH    PIC 9.
             88 HIST-OZ-FIH-COK   VALUE IS 0.
             88 HIST-OZ-FIH-TEK   VALUE IS 1.
          02 GENEL-TESIS-KODU     PIC X(05).
          02 GENEL-MALI-ESAS      PIC 9.
          02 GENEL-LOG            PIC 9.
             88 GENEL-LOG-VAR     VALUE 1.
          02 GENEL-LOG-SEVIYE     PIC 9.
          02 GENEL-OTO-PERYOT     PIC X.
***********E ise oto peryot degisimi var
          02 GENEL-sirket-grup    PIC 9(02). 
          02 GENEL-DIL            PIC X(01).
             88 GENEL-TURKCE    VALUE " ","T".
          02 genel-onodeme-odano pic xxxx.
          02 genel-proformali-calisma          PIC 9.
          02 GENEL-REZPARA.
********Rezervasyon Esnasinda default deger olarak kullanilacak bilgiler....
********Banka,Doviz,Pansiyon,Odeme,Ulke Kodlari.K-G-B Kodu,Aylik Kur-Gunluk kur
********bilgisi ortel shorta dustugunde uyarsin mi uyaririsa gecsin mi yoksa
********rezervasyon yapmaya izin vermesin mi? Stop sale dikkate alsin mi ?
********Girilen kisinin eskiden gelip gelmedigini kontrol etsin mi?
********Mukerrer rezervasyon kontrolu yapsin mi? bu kontrolui voucher nosuna
********gore mi isime gore mi yapsin? ozluk bilgileri girilsin mi.....
********Isim soy isim hanesi bos gecilsin mi ?
             03 REZPARA-BANKA             PIC 99.
             03 REZPARA-DOVIZ             PIC 99.
             03 REZPARA-PAN-TIPI          PIC XX.
             03 REZPARA-ODEME-TIPI        PIC XX.
             03 REZPARA-ULKE              PIC XXX.
             03 REZPARA-AYGUN             PIC X.
             03 REZPARA-K-G-B             PIC X.
             03 REZPARA-ADI-BOSGEC        PIC X.
             03 REZPARA-SOYADI-BOSGEC     PIC X.
             03 REZPARA-SHORT-UYARI       PIC X.
             03 REZPARA-SHORT-GECSIN      PIC X.
             03 REZPARA-STOPS-UYARI       PIC X.
             03 REZPARA-STOPS-GECSIN      PIC X.
             03 REZPARA-ESKIMUS-ARA       PIC X.
             03 REZPARA-MUKERRER-ARA      PIC X.
             03 REZPARA-MUKERRER-NASIL    PIC X.
                88 REZPARA-VOUCHERDEN-ARA VALUE "V".
                88 REZPARA-ISIMDEN-ARA    VALUE "I".
                88 REZPARA-TUMUNDE-ARA    VALUE "T".
             03 REZPARA-MUKERRER-GECSIN   PIC X.
             03 REZPARA-DETAY-ALSIN       PIC X.
             03 REZPARA-BLOKAJ            PIC X.
             03 REZPARA-FIS-SOR           PIC X.
             03 REZPARA-DUZ-FIS           PIC X.
             03 REZPARA-BLOKAJ-FARKLI     PIC X.
             03 REZPARA-CIFTE-BLOKAJ      PIC X.
             03 REZPARA-ANLASMA           PIC XX.
             03 REZPARA-KONT-UYARI        PIC X.
             03 REZPARA-KONT-GECSIN       PIC X.
             03 REZPARA-KONT-TIPI         PIC 9.
             03 REZPARA-PAZAR             PIC X(02).
             03 REZ-PARA-ISL-SISTEMDEN    PIC 9.
             03 REZPARA-TRACE             PIC 9.
********** REZPARA-TRACE = 1 Ise Kisi sayilari ve fiyatlari rezden degil
**********                 Cast tan alinacak demektir.
             03 rezpara-eskimus-soyad     Pic 9.
             03 rezpara-sifir-pax         pic 9.
             03 rezpara-ortak-profil      pic 9.
             03 rez-para-profil-yok       pic 9.
             03 rez-para-share-yok        pic 9.
             03 rezpara-web-ulke          pic xxx.
             03 genel-muha-refk           pic 9(3).
************/antalya source birlesmede kullanildi             
*/***********  03 GENEL-REZ-BOS             PIC X(06).
          02 GENEL-CINPARA.
             03 CINPARA-EXT-FOLIO.
*********C-In Esnasinda Extra Foliolar Icin bu Bolum Uygulanacak ise extra folio
*********aciksin mi? Acilaceksa kac adet acilsin ve bunlara ait bilgiler.....
*********Ayni Durum Telefon Foliosu Icin de gecerlidir.......................
*********Breakdown Uygulamasi yapilacakmi? yapilacak ise rez fiyati dagilimdan
*********kucuk olursa c-ine devam etsin mi programdan mi ciksin?
*********Dolu odaya c-in yapsin mi..Musteri listesi koduna ne atsin...?
                04 CINPARA-EXT-UYGULA    PIC X.
                04 CINPARA-EXT-FOL-AC    PIC X.
                04 CINPARA-EXT-FOL-ADET  PIC 9.
                04 CINPARA-EXT-FOL-BANKA PIC 99.
                04 CINPARA-EXT-FOL-DOVIZ PIC 99.
                04 CINPARA-EXT-FOL-PAN   PIC XX.
                04 CINPARA-EXT-FOL-ODE   PIC XX.
                04 CINPARA-EXT-FOL-ULKE  PIC XXX.
                04 CINPARA-EXT-FOL-AYGUN PIC X.
             03 CINPARA-TEL-FOLIO.
                04 CINPARA-TEL-UYGULA    PIC X.
                04 CINPARA-TEL-FOL-AC    PIC X.
                04 CINPARA-TEL-FOL-ADET  PIC 9.
                04 CINPARA-TEL-FOL-BANKA PIC 99.
                04 CINPARA-TEL-FOL-DOVIZ PIC 99.
             03 ONKPARA-duzeltme-dep   PIC XXX.
             03 genel-peryot-ayirma   PIC 9.
             03 ONKPARA-oda-post-dep  PIC XXX.
             03 genel-trace-acik             PIC 9.
             03 CINPARA-BREAKDOWN        PIC X.
             03 CINPARA-BREAKDOWN-CIK    PIC X.
             03 CINPARA-DOLU-ODAYA       PIC X.
             03 CINPARA-MUSTERI-KODU     PIC X.
             03 CINPARA-FARKLI-KONUMA-CIN PIC X.
             03 CINPARA-OTO-SLIP          PIC X.
             03 CINPARA-MUS-KDV           PIC 99.
             03 CINPARA-BANKA             PIC 99.
             03 CINPARA-DOLU-ODA-CHG      PIC X.
             03 CINPARA-FARKLI-KONUM-CHG  PIC X.
             03 CINPARA-SHORTTA-UZAT      PIC X.
             03 CINPARA-TUMTAR-UZAT       PIC X.
             03 CINPARA-CIN-HOUSE         PIC XX.
             03 CINPARA-KUR-DUZELT        PIC X.
             03 CINPARA-PERYOT-KURU       PIC X.
             03 CINPARA-REG-VARMI         PIC X.
             03 CINPARA-REG-FIS           PIC X.
             03 CINPARA-PAX-DEGIS         PIC X.
             03 CINPARA-BOS-ODALAR-CIKSIN PIC X.
             03 CINPARA-DAG-KOMISYONDAN   PIC X.
             03 CINPARA-EXTRA-MANUEL      PIC X.
             03 CINPARA-TASTIKLI-BAS-BOS  PIC 9(2).
             03 CINPARA-TASTIKLI-KAYIT-SAYI PIC 9(2).
             03 CINPARA-TASTIKLI-ACENTA-UNVAN PIC 9.
             03 CINPARA-SIFIR-PAX-OLSUN   PIC 9. 
             03 CINPARA-TASTIKLI-SAGDAN-SAYI  PIC 99. 
             03 cinpara-kartsiz-pos        pic 9.
             03 CINPARA-TASTIKLI-0-ciksin  PIC 9.
             03 GENEL-devremulk           PIC 9.
             03 genel-oto-kapi             pic 9.
        
          02 GENEL-ONKPARA.
             03 ONKPARA-BANKA             PIC 99.
             03 ONKPARA-DOVIZ             PIC 99.
             03 ONKPARA-D-E               PIC X.
             03 ONKPARA-A-S               PIC X.
             03 ONKPARA-REOPEN            PIC X.
             03 ONKPARA-IPT-POST-YAZ      PIC X.
             03 ONKPARA-CORR-ARTI         PIC 999.
             03 ONKPARA-CORR-EKSI         PIC 999.
             03 ONKPARA-PAID-OUT          PIC 999.
             03 ONKPARA-GUEST-REFUND      PIC 999.
             03 ONKPARA-OUTLET-CASH       PIC 999.
             03 ONKPARA-DEPOZIT           PIC 999.
             03 ONKPARA-DISCOUNT          PIC 999.
             03 ONKPARA-MUHTELIF          PIC 999.
             03 ONKPARA-KREDI-KARTI       PIC 999.
             03 ONKPARA-CITY-LEDGER       PIC 999.
             03 ONKPARA-DIGER1            PIC 999.
             03 ONKPARA-DIGER2            PIC 999.
             03 ONKPARA-COT-HOUSE         PIC XX.
*/
             03 ONKPARA-MAIL-DEP          PIC 9(03).
             03 ONKPARA-MAIL-BOL          PIC 9.
             03 ONKPARA-MAIL-FIS          PIC X.
             03 ONKPARA-MAIL-gun          PIC 99.
             03 ONKPARA-MAIL-DOV          PIC XX.
*/
             03 ONKPARA-KART-ODENMEZ-YARAT  PIC X.
             03 ONKPARA-DOV-BOZ-TLDEN       PIC X.
             03 ONKPARA-FOLIO-DEP-TOPLAM    PIC X.
             03 ONKASA-SIFIR-GECELEME-LISTE PIC 9.
             03 onkpara-referans-var        PIC 9.
             03 ONKPARA-MERKEZ-BANKA-KODU   PIC 99.
             03 onkpara-fatura-cout-tar-kontrol pic 9.   |onkpara-fatura-tahsilatda
             03 fatura-tahsilden-hesapla    pic 9.
             03 onkpara-referans-nerden     pic 9.
             03 ONKPARA-FOLIO-KDV-TOPLAM    pic 9.
          02 GENEL-HOUSE-TEKNIK.
             03 GENEL-HOUSE-TEKNIK-KAYIT-BELIRLE-BP   PIC 9(3).
      $XFD NAME=GENEL-H-TEK-KAYIT-BELIRLE-AU
             03 GENEL-HOUSE-TEKNIK-KAYIT-BELIRLE-AU   PIC 9(3).
             03 GENEL-HOUSE-TEKNIK-KAYIT-SABIT-KOSUL  PIC X(4).
             03 GENEL-HOUSE-TEKNIK-ODA-NO-BP          PIC 9(3).
             03 GENEL-HOUSE-TEKNIK-ODA-NO-AU          PIC 9(3).
             03 GENEL-HOUSE-TEKNIK-ODA-DURUM-KODU-BP  PIC 9(3).
      $XFD NAME=GENEL-H-TEK-ODA-DURUM-KODU-AU
             03 GENEL-HOUSE-TEKNIK-ODA-DURUM-KODU-AU  PIC 9(3).
             03 GENEL-HOUSE-TEKNIK-MAID-KODU-BP       PIC 9(3).
             03 GENEL-HOUSE-TEKNIK-MAID-KODU-AU       PIC 9(3).
             03 genel-muha-uzak-ip                    pic x(15).
             03 genel-muha-ref                        pic 9(03).
             03 ONKPARA-kredi-kilit                  PIC 9.
********      *    02 GENEL-TOMPARA.
********     * *       03 TOMPARA-TOM-SATIS         PIC 999.
**********      *       03 TOMPARA-TOM-IADE          PIC 999.
*********      *       03 TOMPARA-KURFARKI-B        PIC 999.
*********      *       03 TOMPARA-KURFARKI-A        PIC 999.
*********      *       03 TOMPARA-EKSI-TRANS        PIC 999.
*********      *       03 TOMPARA-ARTI-TRANS        PIC 999.
*********      *       03 TOMPARA-FOLIO-SIFIRLA     PIC 999.
*********      *       03 TOMPARA-MINIBAR           PIC 999.
*********      *       03 TOMPARA-TELEFON           PIC 999.
*********      *       03 TOMPARA-DATA-ADRES        PIC X(16).
*********      *       03 TOMPARA-TOM-SIFIRLA       PIC 999.
*********      *       03 TOMPARA-BOS               PIC X(001).
          02 GENEL-TELPARA.
             03 TELPARA-C-MALIYET      PIC 9(12)V99.
             03 TELPARA-C-SATIS        PIC 9(12)V99.
             03 TELPARA-DEPKOD         PIC 999.
             03 TELPARA-FOL-TIPI       PIC X.
             03 TELPARA-ODA.
                04 TELPARA-ODA-BAS     PIC 999.
                04 TELPARA-ODA-HANE    PIC 9.
             03 TELPARA-KONTUR.
                04 TELPARA-KON-BAS     PIC 999.
                04 TELPARA-KON-HANE    PIC 9.
             03 TELPARA-TELNO.
                04 TELPARA-TEL-BAS     PIC 999.
                04 TELPARA-TEL-HANE    PIC 99.
             03 TELPARA-FIS            PIC X.
             03 TELPARA-DAKIKA         PIC 99.
             03 TELPARA-AKTAR-ENGELLE  PIC 9.
             03 TELPARA-KONTURSUZ-CIK  PIC 9.
             03 TELPARA-ODA-OKEY-EH    PIC X.
             03 TELPARA-LOCK-KONTROL            PIC X(01).
          02 HOUSE-PARAM.
             03 HOUSE-BT            PIC X(02).
             03 HOUSE-BK            PIC X(02).
             03 HOUSE-DT            PIC X(02).
             03 HOUSE-DK            PIC X(02).
             03 HOUSE-CI            PIC X(02).
             03 HOUSE-CO            PIC X(02).
             03 HOUSE-AO            PIC X(02).
             03 HOUSE-RE            PIC X(02).
             03 HOUSE-PS            PIC X(02).
             03 HOUSE-SO            PIC X(02).
          02 genel-fiyatgir-carpan-uygula PIC 9(01).
      *    02 genel-fiyatgir-carpan-uygula PIC 9.
          02 genel-acenta-oto-fiy-bakim-yapma pic 9.
          02 genel-oto-proforma-aktif  pic 9.
          02 genel-hk-kisi-sifirla     pic 9.
          02 genel-efatura-kllnc-degil pic 9.
          02 genel-sejour-grepeat-pasif pic 9.
          02 genel-otel-kod pic x(6).
              88 genel-kaya-otelleri    value "kayagr".
              88 genel-liberty-otelleri value "libert".
          02 genel-bavel-on-ek  pic 9(4).
          02 genel-iso          pic 9.
          02 GENEL-odaya-extra-basilamaz pic 9.
          02 genel-max-blok-gun  pic 99.
          02 genel-extra-post-bas    pic 9.
          02 genel-extra-tlden   pic 9.
          02 genel-yas-zorunlu   pic 9.
          02 genel-extrapos-coutbos  pic 9.
          02 genel-folfatta-def-arsiv  pic 9.
          02 genel-dis-cikmasin   pic 9.
          02 genel-konum-upgrade-sifresi  pic x(10).  
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
          02 genel-e-arsiv-gecis-tarihi.  
             03 genel-e-arsiv-yil   pic 9(4).
             03 genel-e-arsiv-ay    pic 9(2).
             03 genel-e-arsiv-gun   pic 9(2).
          02 genel-br-ayir-cikma    pic 9.
          02 genel-bavel-fat-kes-tar pic 9.
      $XFD HIDDEN
          02 genel-oda-disi-fatura-aciklama  pic x(12).
      $XFD HIDDEN
           02 genel-resmi-muha   pic x(8).
      $XFD HIDDEN
           02 genel-resmi-ref    pic 999.
      $XFD HIDDEN
           02 HOUSE-ok           PIC X(02).
      $XFD HIDDEN
          02 onkpara-eski-folio-lst pic 9.
      $XFD HIDDEN
          02 onkpara-dovboz-elle    pic 9.
      $XFD HIDDEN
          02 genel-bavel-adres      pic x(19).
      $XFD HIDDEN
          02 genel-rez-sil-kontrol    pic 9.
      $XFD HIDDEN
          02 onkpara-dovboz-komisyon-bas    pic 9.
      $XFD HIDDEN
          02 onkpara-dovboz-kom-dep         pic 9(3).
      $XFD HIDDEN
          02 onkpara-dovboz-kom-tah-dep     pic 9(3).
      $XFD HIDDEN
          02 GENEL-MINIBAR.
             03 GENEL-MINIBAR-KAYIT-BELIRLE-BP   PIC 9(3).
      $XFD HIDDEN
             03 GENEL-MINIBAR-KAYIT-BELIRLE-AU   PIC 9(3).
      $XFD HIDDEN
             03 GENEL-MINIBAR-KAYIT-SABIT-KOSUL  PIC X(4).
      $XFD HIDDEN
             03 GENEL-MINIBAR-ODA-NO-BP          PIC 9(3).
      $XFD HIDDEN
             03 GENEL-MINIBAR-ODA-NO-AU          PIC 9(3).
      $XFD HIDDEN
             03 GENEL-MINIBAR-UCRET-BP           PIC 9(3).
      $XFD HIDDEN
             03 GENEL-MINIBAR-UCRET-AU           PIC 9(3).
      $XFD HIDDEN
             03 GENEL-MINIBAR-DEVREDE            PIC X.
      $XFD HIDDEN
             03 GENEL-MINIBAR-ONB-DEP            PIC X(3).
      $XFD HIDDEN
             03 GENEL-MINIBAR-COST-ANA-DEP       PIC X(2).
      $XFD HIDDEN
             03 GENEL-MINIBAR-COST-ALT-DEP       PIC X(3).
      $XFD HIDDEN
             03 GENEL-MINIBAR-DOVIZ-TL           PIC X(1).
      $XFD HIDDEN
             03 GENEL-MINIBAR-POS-DEP            pic x(2).
      $XFD HIDDEN
             03 GENEL-MINIBAR-KONT               pic x(2).
      $XFD HIDDEN            
      *    02 GENEL-WORD             PIC X(1).
          02 genel-toplu-folio-faturasi-kesilsin pic 9.
      $XFD HIDDEN
          02 genel-extralar-cin-kurundan pic 9.
      $XFD HIDDEN
          02 genel-hkrap-auto          pic 9.
      $XFD HIDDEN
          02 genel-musteri-listesi-yeni-ayarlar pic 9.
      $XFD HIDDEN
          02 genel-sejour-bay-kabul-etme pic 9.
      $XFD HIDDEN
          02 genel-acenta-odeme-sistemi-devrede pic 9.
      $XFD HIDDEN
          02 genel-kaynak1-zorunlu  pic 9.
      $XFD HIDDEN
          02 genel-kaynak2-zorunlu  pic 9.
      $XFD HIDDEN
          02 genel-kaynak3-zorunlu  pic 9.
      $XFD HIDDEN
          02 genel-devre-tatil-aktif   pic 9.
      $XFD HIDDEN
          02 genel-devremulk-cakisma-yok  PIC 9.
      $XFD HIDDEN 
          02 GENEL-PROFIL-GONDER      pic 9 .
      $XFD HIDDEN
          02 genel-efat2onb-okuma   PIC 9.
      $XFD HIDDEN
          02 genel-netsis-cari-al   pic 9.
      $XFD HIDDEN
          02 genel-onburo-temizlemez pic 9.
      $XFD HIDDEN
          02 genel-paylas-oda    pic 9.
      $XFD HIDDEN
          02 genel-dosya-kilit-devrede pic 9.
      $XFD HIDDEN
          02 genel-fatura-oto-cari  pic 9.
      $XFD HIDDEN
          02 genel-folfat-kdv-yuvarlama pic 9.
      $XFD HIDDEN
          02 genel-voucher-zorunlu    pic 9.
      $XFD HIDDEN
          02 genel-dolu-pm-cin-kontrol pic 9.
      $XFD HIDDEN
          02 genel-oto-sant-kapat    pic 9.
      $XFD HIDDEN
          02 genel-4ipnet-devrede    pic 9.
      $XFD HIDDEN
          02 genel-acik-hesap-aktif  pic 9.
      $XFD HIDDEN
          02 GENEL-AKBS-adres        PIC X(34).
      $XFD HIDDEN
          02 genel-touch-kullan      pic x.
      $XFD HIDDEN
          02 genel-kbs-bolgesi       pic x.
      $XFD HIDDEN
          02 genel-precin-aktif      pic x.
      $XFD HIDDEN
          02 genel-tesis-kodu-ek     pic x.
      $XFD HIDDEN
          02 GENEL-mah-mat-ref-dagit pic 9.
      $XFD HIDDEN
          02 TELPARA-dishat-ac-kapa-dahili pic 9.
      $XFD HIDDEN
          02 genel-taksilattan-muhasebe  pic 9.
      $XFD HIDDEN
          02 GENEL-RES-ADRES        PIC X(36).
      $XFD HIDDEN
          02 genel-ogretmenevi-online pic 9.
      $XFD HIDDEN
           02 GENEL-ONODEME-DOV-DERLE     PIC 9.
      $XFD HIDDEN
           02 genel-fol-fat-no2           pic 9(06) .
      $XFD HIDDEN
           02 genel-fol-fat-no3           pic 9(06) .
      $XFD HIDDEN
           02 genel-fol-fat-no4           pic 9(06) .
      $XFD HIDDEN
           02 genel-fol-fat-no5           pic 9(06) .
      $XFD HIDDEN
           02 genel-efol-fat-no           pic 9(06) .
      $XFD HIDDEN
           02 genel-acen-fat-no           pic 9(06). 
      $XFD HIDDEN
           02 genel-eacen-fat-no          pic 9(06). 
      $XFD HIDDEN
          02 genel-karsi-muha       pic x(8).
      $XFD HIDDEN
          02 genel-kom-uygula       pic 9.
      $XFD HIDDEN
          02 genel-bas-tar          pic x(8).
      $XFD HIDDEN
          02 genel-rezde-profil-gec pic 9.
      $XFD HIDDEN
          02 genel-rezidance        pic 9.
      $XFD HIDDEN
          02 GENEL-DIGPARA.
             03 TELPARA-GER-ZAMAN.
      $XFD HIDDEN
                04 TELPARA-GER-SAAT-BAS  PIC 999.
      $XFD HIDDEN
                04 TELPARA-GER-SAAT-HANE PIC 99.
      $XFD HIDDEN
             03 GENEL-YILBASI               PIC X. 
********** Y-ise ilk defa acildiginda bakim K ise kilitli
             03 GENEL-Y-CASH              PIC 9(3).
      $XFD HIDDEN
             03 GENEL-NOKTA-VIRGUL        PIC X.
      $XFD HIDDEN
             03 genel-fol-fat-no            pic 9(08) comp-3.
      $XFD HIDDEN
             03 TELPARA-dishat-ac-kapa    pic 9.
      $XFD HIDDEN
             03 telpara-sure-bas          pic 999.
      $XFD HIDDEN
             03 telpara-sure-hane         pic 9.
      $XFD HIDDEN
             03 TEL-PARA-KONTROLLU        Pic 9.
      $XFD HIDDEN
             03 ONKPARA-Dolar             pic 99.
      $XFD HIDDEN
             03 onkpara-cift              pic 9.
      $XFD HIDDEN
             03 grupda-share-yok          pic 9.
      $XFD HIDDEN
             03 onkpara-yeni-fatura       pic 9.
      $XFD HIDDEN
             03 genel-transfer-kopya      pic 9.
      $XFD HIDDEN
             03 TELPARA-dishat-ac-kapa-ignore    pic 9.            
      $XFD HIDDEN
             03 genel-def-var             pic 9.
      $XFD HIDDEN
             03 onkpara-cout-kuru         pic 9.
          02 GENEL-STAF                   PIC X(04).
       
