*
 FD  GENELFIS      LABEL RECORD IS STANDARD.
  01 GENELFIS-REC.
             02 GENELFIS-ANAHTAR   PIC  9.
             02 REZ-OTO            PIC  9(08).
             02 share-no redefines rez-oto pic 9(08).
             02 FOLIO-OTO          PIC  9(08).
             02 CEKGIR-OTO         PIC  9(08).
             02 FIHRIST-OTO        PIC  9(10).
             02 DOV-BOZ-OTO        PIC  9(06).
             02 PRINT-NO           PIC  9(04).
             02 acenta-no redefines print-no pic 9(04).
             02 EKRAN-FIS-1        PIC  9(04).
             02 GENELFIS-LOG-NO    PIC  9(10).
             02 TEL-FIS-OTO        PIC  9(06).
             02 firma-no redefines TEL-FIS-OTO pic 9(05).
             02 filler   redefines TEL-FIS-OTO pic x.
             02 HK-TK-SERVIS-NO    PIC  9(08).
             02 POS-OTO-ODENMEZ-NO PIC  9(08).
             02 GRUP-OTO           PIC  9(04).
             02 profile-oto        pic  9(08).
*     02 GENELFIS-BOS       PIC  X(04).
*     02 GENELFIS-STAF      PIC  X(04).
*/genelfis-anahtar = 2 için print-no acenta kodu arttýrmak için kullanýldý.


  fd muhasebe-genelfis label record standard.
  01 muhasebe-genelfis-rec.
     02 muhasebe-genelfis-anahtar     pic 9.
     02 mahsup-oto           pic 9(06).
     02 mcek-oto              pic 9(10).
     02 mprint-no             pic 9(04).
     02 mekran-fis-1          pic 9(04).
     02 fihrist-oto          pic 9(10).
     02 muhasebe-genelfis-log-no      pic 9(10).
     02 muhasebe-genelfis-dekont-no   pic 9(6).
     02 muhasebe-genelfis-talimat-no  pic 9(6).
     02 muhasebe-genelfis-bos         pic x(028).
     02 muhasebe-genelfis-staf        pic x(04).



 
