       FD gerfat LABEL RECORD STANDARD.
       01 gerfat-REC. 
          02 gerfat-ANAH.
             03 gerfat-SERI       PIC XX. 
             03 gerfat-NO         PIC 9(08). 
          02 gerfat-gerfat.
             03 gerfat-onek     pic x(7).
             03 gerfat-gerfatno pic 9(9).
          02 GERFAT-gonderim     pic x. | Kagit Elektronik
          02 gerfat-fat-tar      pic x(10).
          02 gerfat-durumu       pic x.  | [B]-Bos Fatura [D]-Dolu Fatura [I]-Iptal Fatura
          02 gerfat-no-alindi      pic 9.
          02 gerfat-muhagerfat  pic x(16).
          02 gerfat-BOS            PIC X(50).
          02 gerfat-STAF          PIC X(04). 
