*
 COPY "genel.sel".
 COPY "errorlog.sel".
 COPY "genelfis.sel".                                                    
 COPY "logindex.sel".    
 copy "musteri.sel".   
 copy "acenta.sel".
 copy "ulke.sel".       
 copy "kodlar02.sel".    
 copy "prohrk.sel".    
 copy "uyruk.sel".   
 copy "polisxml.sel".                 
 copy "depart.sel".     
 copy "takvim.sel".        
 copy "odalar.sel".        
 copy "prolog.sel".              
