FD gidenbav LABEL RECORD STANDARD.
01 gidenbav-rec.
   02 gidenbav-anah.
      03 gidenbav-fat-no                       pic 9(6).
      03 gidenbav-bos-anah                     pic x(100).
   02 gidenbav-diger.                          
      03 gidenbav-acenta                       pic x(4).
      03 gidenbav-durumu                       pic x.
         88 gidenbav-csv-olustu     value "C".
         88 gidenbav-xml-olustu     value "X".
         88 gidenbav-iptal-edildi   value "I".
      03 gidenbav-eski-durumu                  pic x.
      03 gidenbav-odano                        pic x(5).
      03 gidenbav-adi                          pic x(30).
      03 gidenbav-soyadi                       pic x(30).
      03 gidenbav-bas-dov                      PIC s9(09)V99.
      03 gidenbav-dov-kod                      PIC X(3).     
      03 gidenbav-fat-tut                      PIC s9(09)V99.
      03 gidenbav-gir-tar                      pic 9(8).     
      03 gidenbav-cik-tar                      pic 9(8).     
      03 gidenbav-fat-gon-tar                  pic 9(8).     
      03 gidenbav-bos-diger                    pic x(1000).
      03 gidenbav-staff                        PIC X(4).     

