       FD GOREV LABEL RECORD STANDARD.
        01 gorev-rec.
          02 gorev-anah.
             03 gorev-kodu                             pic 9(03). 
             03 gorev-anah-bos                         pic x(20).
          02 gorev-adi                                 pic x(30).
          02 gorev-tur                                 pic 9.
          02 gorev-sira                                pic 999.
          02 gorev-bos                                 pic x(100).



                                                                       
         
