       FD grupfiy LABEL RECORD STANDARD.
       01 grupfiy-REC.
          02 grupfiy-ANAHTAR.
             03 grupfiy-kodu      PIC 9(6).
             03 grupfiy-bas-tarih.
                04 grupfiy-bas-yil    pic 9(4).
                04 grupfiy-bas-ay     pic 9(2).
                04 grupfiy-bas-gun    pic 9(2).
             03 grupfiy-bit-tarih.
                04 grupfiy-bit-yil    pic 9(4).
                04 grupfiy-bit-ay     pic 9(2).
                04 grupfiy-bit-gun    pic 9(2).
             03 grupfiy-konum     pic 9(2).
             03 grupfiy-pax       pic 9(2).
             03 grupfiy-child     pic 9(2).
             03 grupfiy-filler    pic x(20).
          02 grupfiy-bilgiler.
             04 grupfiy-ayrilan-tutar pic 9(12)v9(2).
             04 grupfiy-staf          pic x(04).
          02 filler                   pic x(096).
           
             

