       FD gruplog LABEL RECORD STANDARD.
       01 gruplog-REC.
          02 gruplog-ANAHTAR.
             03 gruplog-kodu      PIC 9(6).
             03 gruplog-log-tar.
                04 gruplog-log-yil pic 9(4).
                04 gruplog-log-ay  pic 9(2).
                04 gruplog-log-gun pic 9(2).
             03 gruplog-log-zaman.
                04 gruplog-log-saat pic 9(2).
                04 gruplog-log-dak  pic 9(2).
                04 gruplog-log-saniye pic 9(2).
          02 gruplog-detay.
             03 gruplog-adi           Pic x(100).
             03 gruplog-firma         pic x(5).
             03 gruplog-acenta        pic x(04).
             03 gruplog-grup-statu    pic x.
             03 gruplog-banka         pic 99.
             03 gruplog-doviz         pic 99.
             03 gruplog-pan-tipi      pic xx.
             03 gruplog-anlasma       pic xx.
             03 gruplog-odeme         pic xx.
             03 gruplog-pazar         pic xx.
             03 gruplog-ulke          pic xxx.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=gruplog-gel-tar
             03 gruplog-gel-tar.
                04 gruplog-gel-yil    pic 9(4).
                04 gruplog-gel-ay     pic 9(2).
                04 gruplog-gel-gun    pic 9(2).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=gruplog-git-tar
             03 gruplog-git-tar.
                04 gruplog-git-yil    pic 9(4).
                04 gruplog-git-ay     pic 9(2).
                04 gruplog-git-gun    pic 9(2).
             03 gruplog-not1          pic x(100).
             03 gruplog-not2          pic x(100).
             03 gruplog-toplam-oda-geceleme pic 9(5).
             03 gruplog-toplam-pax-geceleme pic 9(5).
             03 gruplog-kaynak-1      pic x(02).
             03 gruplog-kaynak-2      pic x(02).
             03 gruplog-kaynak-3      pic x(02).
             03 gruplog-durumu        pic x.|S-Silindi I-iptal
             03 gruplog-silme-iptal-nedeni pic x(50).
             03 gruplog-staf          pic x(4).
             03 gruplog-isl-tar       pic x(8).
             03 gruplog-sil-tar       pic x(8).
             03 gruplog-satis-tar     pic x(8).           
             03 gruplog-kur           pic 99v99999.
             03 gruplog-extra-ind     pic 999v99.
             03 gruplog-skur          pic 9.
             03 gruplog-room-kdv-yok   pic x.
             03 gruplog-extra-kdv-yok  pic x.
             03 gruplog-sabit-tarih-kur pic 9.
             03 gruplog-sabit-kur-tarih.
                04 gruplog-sabit-kur-yil pic 9(4).
                04 gruplog-sabit-kur-ay  pic 9(2).
                04 gruplog-sabit-kur-gun pic 9(2).
             03 gruplog-kalanlar-double  pic 9.
             03 filler                pic x(414).
             

