*
 COPY "genelfis.lib".
 COPY "genel.lib".
 COPY "grup.lib".
 copy "acenta.lib".
 copy "depkod.lib".
 COPY "dokumer.lib".
 COPY "isyeri.lib".
 COPY "odalar.lib".
 copy "ulke.lib".
*
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
