       FD GRUPREZ LABEL RECORD STANDARD.
       01 GRUPREZ-REC.
          02 GRUPREZ-ANAH.
             03 GRUPREZ-GNO        PIC X(04).
             03 GRUPREZ-GADI       PIC X(15).
          02 GRUPREZ-ODA       PIC 99.
          02 GRUPREZ-RNO       PIC 9(08)  OCCURS 100 TIMES.   
          02 GRUP-BOS          PIC X(50).
          02 GRUP-STAF         PIC X(04).
