       FD gruplar LABEL RECORD STANDARD.
       01 gruplar-REC.
          02 gruplar-ANAHTAR.
             03 gruplar-kodu      PIC 9(6).
             03 gruplar-filler    pic x(15).
          02 gruplar-detay.
             03 gruplar-adi           Pic x(100).
             03 gruplar-firma         pic x(5).
             03 gruplar-acenta        pic x(04).
             03 gruplar-grup-statu    pic x.
             03 gruplar-banka         pic 99.
             03 gruplar-doviz         pic 99.
             03 gruplar-pan-tipi      pic xx.
             03 gruplar-anlasma       pic xx.
             03 gruplar-odeme         pic xx.
             03 gruplar-pazar         pic xx.
             03 gruplar-ulke          pic xxx.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=gruplar-gel-tar
             03 gruplar-gel-tar.
                04 gruplar-gel-yil    pic 9(4).
                04 gruplar-gel-ay     pic 9(2).
                04 gruplar-gel-gun    pic 9(2).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=gruplar-git-tar
             03 gruplar-git-tar.
                04 gruplar-git-yil    pic 9(4).
                04 gruplar-git-ay     pic 9(2).
                04 gruplar-git-gun    pic 9(2).
             03 gruplar-not1          pic x(100).
             03 gruplar-not2          pic x(100).
             03 gruplar-toplam-oda-geceleme pic 9(5).
             03 gruplar-toplam-pax-geceleme pic 9(5).
             03 gruplar-kaynak-1      pic x(02).
             03 gruplar-kaynak-2      pic x(02).
             03 gruplar-kaynak-3      pic x(02).
             03 gruplar-durumu        pic x.|S-Silindi I-iptal
             03 gruplar-silme-iptal-nedeni pic x(50).
             03 gruplar-staf          pic x(4).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=gruplar-isl-tar
             03 gruplar-isl-tar.
                04 gruplar-isl-yil    pic 9(4).
                04 gruplar-isl-ay     pic 9(2).
                04 gruplar-isl-gun    pic 9(2).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=gruplar-sil-tar
             03 gruplar-sil-tar.
                04 gruplar-sil-yil    pic 9(4).
                04 gruplar-sil-ay     pic 9(2).
                04 gruplar-sil-gun    pic 9(2).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=gruplar-satis-tar
             03 gruplar-satis-tar.
                04 gruplar-satis-yil  pic 9(4).
                04 gruplar-satis-ay   pic 9(2).
                04 gruplar-satis-gun  pic 9(2).                
             03 gruplar-kur           pic 99v99999.
             03 gruplar-extra-ind     pic 999v99.
             03 gruplar-skur          pic 9.
             03 gruplar-room-kdv-yok    pic x.
             03 gruplar-extra-kdv-yok   pic x.
             03 gruplar-sabit-tarih-kur pic 9.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=gruplar-sabit-kur-tar
             03 gruplar-sabit-kur-tarih.
                04 gruplar-sabit-kur-yil pic 9(4).
                04 gruplar-sabit-kur-ay  pic 9(2).
                04 gruplar-sabit-kur-gun pic 9(2).
             03 gruplar-kalanlar-double  pic 9.
             03 gruplar-gel-zaman.
                04 gruplar-gel-saat      pic 99.
                04 gruplar-gel-dakika    pic 99.
             03 gruplar-git-zaman.
                04 gruplar-git-saat      pic 99.
                04 gruplar-git-dakika    pic 99.
             03 filler                pic x(406).
           
             

