*
 COPY "genel.lib".
 COPY "takvim.lib".
 copy "rez.lib".
 copy "konuk.lib".
*
        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib". 
       COPY "odalar.lib".                                                                                                       
