         COPY "genelfis.lib".
         COPY "genel.lib".
         COPY "halk.lib".
         COPY "dokumer.lib".
          COPY "odalar.lib".
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
