         COPY "genelfis.lib".
         COPY "genel.lib".
         COPY "cevap1.lib".
         COPY "cevap2.lib".
         COPY "halk.lib".
         COPY "soru.lib".
         COPY "dokumer.lib".

         COPY "errorlog.lib".                                                    
         COPY "logindex.lib".
         copy "odalar.lib".                                           
