         COPY "takvim.lib".
         COPY "genelfis.lib".
         COPY "genel.lib".
         COPY "halk.lib".
         COPY "soru.lib".
         COPY "cevap1.lib".
         COPY "cevap2.lib".
         COPY "kllnc.lib".
         COPY "dokumer.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
