*
 COPY "dokumer.lib".
 COPY "genel.lib".
 COPY "musteri.lib".
 COPY "genelfis.lib".
 copy "konum.lib".
 copy "hediye.lib".
 copy "odalar.lib".
*
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
