       FD HELPMENU
           LABEL RECORD IS STANDARD.
       01 HELPMENU-REC.
           02 MENU-KODU.
              03 HELPMENU-KULLANICI     PIC X(4).
              03 MENU-SIRA              PIC 9(2).
           02 MENU-ADI                  PIC X(30).
           02 MENU-COB                  PIC X(50).
           02 MENU-YETKI                PIC X.
           02 MENU-TIP                  PIC X.
******************** A ISE COBOL DEGIL
           02 MENU-BOS                  PIC X(09).
           02 MENU-STAF                 PIC XXXX.
