         copy "hesap.lib"  of "..\..\muhb\lib-sel".
         copy "cari.lib"  of "..\..\muhb\lib-sel".
         copy "genel.lib"  of "..\..\muhb\lib-sel".
       COPY "errorlog.lib".
        COPY "genelfis.lib".                                                    
        COPY "odalar.lib".                                                    
        COPY "logindex.lib".                                                    