       FD hessorgu LABEL RECORD STANDARD.
       01 hessorgu-rec.
          02 hessorgu-anah.
             03 hessorgu-hes-kodu        pic x(15).
             03 hessorgu-tarih.
                04 hessorgu-yil             pic 9(04).
                04 hessorgu-ay              pic 9(02).
                04 hessorgu-gun             pic 9(02).
             03 hessorgu-zaman.
                04 hessorgu-saat            pic 9(02).
                04 hessorgu-dakika          pic 9(02).
                04 hessorgu-saniye          pic 9(02).
          02 hessorgu-bilgi.
             03 hessorgu-donus-kodu      pic 9(03).
             03 hessorgu-donus-mesaj     pic x(100).
             03 hessorgu-donus-durum     pic 9(01).
             03 hessorgu-yrez-anah.
                04 hessorgu-yrez-no         pic 9(08).
                04 hessorgu-yrez-sira       pic 9(02).
             03 hessorgu-staff           pic x(04).
             03 hessorgu-nereden         pic x.
             03 hessorgu-filler          pic x(199).
              
