         copy "genel.lib".
         copy "genelfis.lib".
         copy "kllnc.lib".
         copy "konuk.lib".
         copy "hkonuk.lib".
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
