         copy "genel.lib".
         copy "genelfis.lib".
         copy "kllnc.lib".
         copy "konuk.lib".
         copy "hkonuk.lib".
         copy "romhrk.lib".
         copy "exthrk.lib".
         copy "ozluk.lib".


        COPY "errorlog.lib".                                                    
        COPY "logindex.lib". 
        copy "odalar.lib".                                           
