       FD HKONUK LABEL RECORD STANDARD.
       01 HKONUK-REC.
          02 HKONUK-ANAH.
             03 HKONUK-FOLIO       PIC 9(08).
          02 HKONUK-DURUMU         PIC X.
*********> Konuk-Durumu   => Folionun iceridemi yoksa histroyde mi oldugunu
*********> belirtir...I-> Iceride H->Historyde Gibi............
          02 HKONUK-FOL-KODU       PIC X.
*********> Konuk-Fol-Kodu => R-> Oda E-> Extra T-> Telefon G-> Grup B-> Bos
          02 HKONUK-ADI            PIC X(20).
          02 HKONUK-SOYADI         PIC X(20).
          02 HKONUK-S-D-T-G        PIC 9.
          02 HKONUK-ODA-KONUMU     PIC 99.
          02 HKONUK-ODEME-TIPI     PIC XX.
          02 HKONUK-ODANO          PIC X(04).
          02 HKONUK-REZ-NO         PIC 9(08).
          02 HKONUK-ULKE           PIC XXX.
          02 HKONUK-KISI.
             03 HKONUK-BUYUK       PIC 9(02).
             03 HKONUK-KUCUK       PIC 9(02).
             03 HKONUK-BEBEK       PIC 9(01).
             03 HKONUK-FREE        PIC 9(01).
          02 HKONUK-ACENTA         PIC X(04).
          02 HKONUK-filler       PIC x(04).
          02 HKONUK-VOUCHER        PIC X(30).
          02 HKONUK-NOR-INDIRIM    PIC 99V99.
          02 HKONUK-PAN-TIPI       PIC XX.
          02 HKONUK-REZ-TIPI       PIC 9.
          02 HKONUK-BANKA          PIC 99.
          02 HKONUK-DOVIZ          PIC 99.
          02 HKONUK-ANLASMA        PIC XX.
          02 HKONUK-KUR-AYGUN      PIC X.
*********> Konuk-Kur-Aygun = A-> Aybasi Kuru G-> Gunluk kur
          02 HKONUK-FATURA         PIC X.
          02 HKONUK-CIK-CIKMA      PIC X.
          02 HKONUK-ERKEN-CIK      PIC X.
          02 HKONUK-UZATMA         PIC X.
          02 HKONUK-POSTING        PIC X.
          02 HKONUK-VIP            PIC X.
          02 HKONUK-ODADEGIS       PIC X.
*********> Konuk-Erken-Cik = Early C/Out E/H
*********> Konuk-Uzatma    = Uzatma      E/H
*********> Konuk-Posting   = Posting     E/H
*********> Konuk-Vip       = V-> V.I.P T-> Top V.I.P
*********> Konuk-Fatura    = E-> Faturasi Kesilmis.. H-> Faturasi Kesilmemis
*********> Konuk-Cik-Cikma = E-> Musteri Listesi Cik H-> Musteri Listesi Cikma
*********> Konuk-Odadegis  = E-> Bu Oda Room change yapilmistir.....
          02 HKONUK-ACIK-KAPALI    PIC X.
*********> Konuk-Acik-kapali = O-> Open C-> Close
          02 HKONUK-GEL-TAR.
             03 HKONUK-GEL-YIL     PIC 9999.
             03 HKONUK-GEL-AY      PIC 99.
             03 HKONUK-GEL-GUN     PIC 99.
          02 HKONUK-GIT-TAR.
             03 HKONUK-GIT-YIL     PIC 9999.
             03 HKONUK-GIT-AY      PIC 99.
             03 HKONUK-GIT-GUN     PIC 99.
          02 HKONUK-GEL-ZAMAN.
             03 HKONUK-GEL-SAAT     PIC 99.
             03 HKONUK-GEL-DAKIKA   PIC 99.
             03 HKONUK-GEL-SANIYE   PIC 99.
          02 HKONUK-GIT-ZAMAN.
             03 HKONUK-GIT-SAAT     PIC 99.
             03 HKONUK-GIT-DAKIKA   PIC 99.
             03 HKONUK-GIT-SANIYE   PIC 99.

          02 HKONUK-ODA-TUTAR       PIC 9(12)V99   COMP-3.
          02 HKONUK-EXTBED-TUTAR    PIC 9(12)V99   COMP-3.
          02 HKONUK-KAHVALTI-TUTAR  PIC 9(12)V99   COMP-3.
          02 HKONUK-OGLE-TUTAR      PIC 9(12)V99   COMP-3.
          02 HKONUK-AKSAM-TUTAR     PIC 9(12)V99   COMP-3.
          02 HKONUK-ICECEK-TUTAR    PIC 9(12)V99   COMP-3.
          02 HKONUK-EXTRA-TUTAR     PIC 9(12)V99   COMP-3.
          02 HKONUK-TOP-BORC        PIC S9(12)V99  COMP-3.
          02 HKONUK-TOP-ALAC        PIC S9(12)V99  COMP-3.
          02 HKONUK-KUR-DEGERI      PIC 9(9)V9(05) COMP-3.
          02 HKONUK-DV-DEGERI       PIC 9(12)V99   COMP-3.

          02 HKONUK-ACIK.
             03 HKONUK-ACIK-1       PIC X(100).
             03 HKONUK-ACIK-2       PIC X(100).
          02 HKONUK-KARTNO          PIC X(07).
          02 HKONUK-REOPEN          PIC X.
          02 hKONUK-OPERATOR         PIC X(02).
          02 hKONUK-GRUP-NO          PIC 9(06).
          02 hkonuk-filler           pic x(06).
          02 HKONUK-PAZAR           pic X(02).
          02 HKONUK-EB              pic X.

          02 HKONUK-FIYAT-FIX       PIC X.
          02 hKONUK-GELIS-SAYISI     PIC 9(2).
          02 hKONUK-FIYAT-KONUMU     PIC 99.
          02 hKONUK-GEC-GIRIS        PIC 9.
          02 hKONUK-FAT-NO           PIC 9(06).
          02 hKONUK-UG-INDIRIMI      PIC 9.
          02 hKONUK-BILBORD-EH       PIC X.
          02 hKONUK-EXTRA-REZ-NO     PIC 9(08).
          02 hKONUK-TITLE            PIC X(13).
          02 hKONUK-SAFE             PIC 9.
          02 hKONUK-ANAHTAR          PIC 9.
          02 hKONUK-LATE-ZAMAN.
            03 hKONUK-LATE-GEL-SAAT  PIC 99.
            03 hKONUK-LATE-GEL-DAK   PIC 99.
          02 hKONUK-AKSIYON-EH       PIC X.
          02 hkonuk-share            pic 9.
          02 hkonuk-SPECIAL-EH         pic 9.
          02 hkonuk-sehir            pic xxx.
          02 hKONUK-BOS              PIC X(05).
          02 hKONUK-STAF             PIC X(04).
          02 hkonuk-hdurumu          pic x.
          02 hkonuk-kredi-kart.
             03 hkonuk-kart-tipi     pic x.
             03 hkonuk-kart-no1      pic x(04).
             03 hkonuk-kart-no2      pic x(04).
             03 hkonuk-kart-no3      pic x(04).
             03 hkonuk-kart-no4      pic x(04).
             03 hkonuk-cvv-kodu      pic x(03).
             03 hkonuk-onay-kodu     pic x(15).
             03 hkonuk-onay-tutar    pic 9(6)v99.
             03 hkonuk-onay-doviz    pic x(02).
             03 hkonuk-kart-sahibi   pic x(50).
             03 hkonuk-kart-son-ay   pic 9(2).
             03 hkonuk-kart-son-yil  pic 9(2).

********> Konuk-Durumu.....Degiskeni  folionun iceridemi yoksa History de mi
********> Oldugunu gosterir.. Anahtar sahalar icin gerekli................
********> I-> Iceride H-> Historyde...........
********> Konum-tom-var-yok => "E" Ise bu folioya ait tom var demektir....
********> Konum-tom-alkol   => Musterinin alkol seviyesini belirler........
********>                 0 => Alkolsuz............
********>                 1 => Az Alkollu..........
********>                 2 => Orta Alkollu........
********>                 3 => Cok Alkollu.........

