*
 fd htmldok label record standard.
 01 htmldok-rec.
    02 htmldok-anah.
       03 htmldok-kodu                 pic x(20).
       03 htmldok-sira                 pic 9(9).
       03 htmldok-kaynak               pic x(100).
    02 htmldok-hedef                   pic x(100).
    02 htmldok-RL                      pic x. 
    02 htmldok-repeat                  pic 9.
    02 filler                          pic x(200).
 

