*
      copy "genel.lib".
      copy "genelfis.lib".
      copy "errorlog.lib".
      copy "logindex.lib".
      copy "htmldok.lib".
      copy "kllnc.lib".
      copy "odalar.lib".

*
 fd html-oku label record standard.
 01 html-oku-rec          pic x(10000).

*
 fd html-yaz label record standard.
 01 html-yaz-rec          pic x(10000).

