           copy "useinbox.lib".
           copy "genel.lib".
           copy "genel2.lib".
           copy "errorlog.lib".                                                    
           copy "genelfis.lib".                                                    
           copy "logindex.lib". 
           copy "odalar.lib".                                                                                                       
