         COPY "genel.lib". 
         COPY "genelfis.lib". 
         COPY "kllnc.lib". 
         COPY "rez.lib". 
         COPY "acenta.lib". 
         COPY "kodlar02.lib". 
         COPY "konum.lib". 
         COPY "dokumer.lib". 
         COPY "odalar.lib". 

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
