         COPY "genelfis.lib".
         COPY "genel.lib".
         COPY "kodlar02.lib".
         COPY "dokumer.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".
        copy "odalar.lib".                                            
