          COPY "kodlar02.lib".
          COPY "genel.lib".

        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".   
        copy "odalar.lib". 
                                                                                    
