*
 fd islkilit label record standard.
 01 islkilit-rec.
    02 islkilit-anah                  pic 9.
    02 islkilit-terminal              pic x(10).
    02 islkilit-machine               pic x(64).
    02 islkilit-user                  pic x(12).
    02 islkilit-station               pic x(12).
    02 islkilit-kllnc-kodu            pic x(04).
    02 islkilit-son-tarih.
       03 islkilit-son-yil            pic 9(4).
       03 islkilit-son-ay             pic 9(2).
       03 islkilit-son-gun            pic 9(2).
    02 islkilit-son-zaman.
       03 islkilit-son-saat           pic 9(2).
       03 islkilit-son-dakika         pic 9(2).
       03 islkilit-son-saniye         pic 9(2).
    02 islkilit-process-id            pic 9(7).
    02 filler                         pic x(100).
