*
     copy "genel.lib".
     copy "genelfis.lib".
     copy "islkilit.lib".
     copy "errorlog.lib".
     copy "logindex.lib".
     copy "kllnc.lib".
           COPY "odalar.lib".
*
 fd cakisma label record standard.
 01 cakisma-rec.
    02 cakisma-makina    pic x(21).
    02 cakisma-bos-1     pic x(01).
    02 cakisma-kullanici pic x(15).
    02 cakisma-bos-2     pic x(01).
    02 cakisma-pid-no    pic x(07).


