          COPY "kllnc.lib".
          COPY "prosif.lib".
          COPY "menutext.lib".
          COPY "errorlog.lib".        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".                                                    
