         COPY "genel.lib".
         COPY "konuk.lib".
         COPY "kodlar02.lib".
         COPY "istdata.lib".
         COPY "detist.lib".
         COPY "turizm.lib".

        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib". 
        COPY "odalar.lib".                                                                                              
