       FD ISTDATAr  LABEL RECORD STANDARD.
       01 ISTDATAr-REC.
          02 ISTDATAr-ANAH.
             03 istr-ref              pic 9.
             03 ISTr-TARIH.  
                04 ISTr-YIL           PIC 9999.
                04 ISTr-AY            PIC 99.
                04 ISTr-GUN           PIC 99.
             03 ISTr-ACENTA           PIC X(04).
             03 ISTr-REZ-TIPI         PIC 9. 
**********> Toplam Kismi........
          02 ISTr-TOP-ODA          PIC 9(4) COMP-3.
          02 ISTr-TOP-KISI.  
             03 ISTr-TOP-BUYUK     PIC 9(4) COMP-3.
             03 ISTr-TOP-KUCUK     PIC 9(4) COMP-3.
             03 ISTr-TOP-FREE      PIC 9(4) COMP-3.
          02 ISTr-TOP-TUTAR        PIC s9(14)V99 COMP-3.
**********> Oda           Kismi ......
          02 ISTr-ODA-ODA          PIC 9(4) COMP-3.
          02 ISTr-ODA-KISI.  
             03 ISTr-ODA-BUYUK     PIC 9(4) COMP-3.
             03 ISTr-ODA-KUCUK     PIC 9(4) COMP-3.
             03 ISTr-ODA-FREE      PIC 9(4) COMP-3.
          02 ISTr-ODA-TUTAR        PIC 9(15)V99 COMP-3.
**********> Kahvalti      Kismi ......
          02 ISTr-KAH-ODA          PIC 9(4) COMP-3.
          02 ISTr-KAH-KISI.  
             03 ISTr-KAH-BUYUK     PIC 9(4) COMP-3.
             03 ISTr-KAH-KUCUK     PIC 9(4) COMP-3.
             03 ISTr-KAH-FREE      PIC 9(4) COMP-3.
          02 ISTr-KAH-TUTAR        PIC 9(15)V99 COMP-3.
**********> Ogle  Yemegi  Kismi ......
          02 ISTr-OGL-ODA          PIC 9(4) COMP-3.
          02 ISTr-OGL-KISI.  
             03 ISTr-OGL-BUYUK     PIC 9(4) COMP-3.
             03 ISTr-OGL-KUCUK     PIC 9(4) COMP-3.
             03 ISTr-OGL-FREE      PIC 9(4) COMP-3.
          02 ISTr-OGL-TUTAR        PIC 9(15)V99 COMP-3.
**********> Aksam Yemegi  Kismi ......
          02 ISTr-AKS-ODA          PIC 9(4) COMP-3.
          02 ISTr-AKS-KISI.  
             03 ISTr-AKS-BUYUK     PIC 9(4) COMP-3.
             03 ISTr-AKS-KUCUK     PIC 9(4) COMP-3.
             03 ISTr-AKS-FREE      PIC 9(4) COMP-3.
          02 ISTr-AKS-TUTAR        PIC 9(15)V99 COMP-3.
**********> Icecek        Kismi ......
          02 ISTr-ICE-ODA          PIC 9(4) COMP-3.
          02 ISTr-ICE-KISI.  
             03 ISTr-ICE-BUYUK     PIC 9(4) COMP-3.
             03 ISTr-ICE-KUCUK     PIC 9(4) COMP-3.
             03 ISTr-ICE-FREE      PIC 9(4) COMP-3.
          02 ISTr-ICE-TUTAR        PIC 9(15)V99 COMP-3.
**********> Extralar      Kismi ......
          02 ISTr-EXT-ODA          PIC 9(4) COMP-3.
          02 ISTr-EXT-KISI.  
             03 ISTr-EXT-BUYUK     PIC 9(4) COMP-3.
             03 ISTr-EXT-KUCUK     PIC 9(4) COMP-3.
             03 ISTr-EXT-FREE      PIC 9(4) COMP-3.
          02 ISTr-EXT-TUTAR        PIC 9(15)V99 COMP-3.
**********> Ectra Bed     Kismi ......
          02 ISTr-EXB-ODA          PIC 9(4) COMP-3.
          02 ISTr-EXB-KISI.  
             03 ISTr-EXB-BUYUK     PIC 9(4) COMP-3.
             03 ISTr-EXB-KUCUK     PIC 9(4) COMP-3.
             03 ISTr-EXB-FREE      PIC 9(4) COMP-3.
          02 ISTr-EXB-TUTAR        PIC 9(15)V99 COMP-3.
**********> Diger-1       Kismi ......
          02 ISTr-DI1-ODA          PIC 9(4) COMP-3.
          02 ISTr-DI1-KISI.  
             03 ISTr-DI1-BUYUK     PIC 9(4) COMP-3.
             03 ISTr-DI1-KUCUK     PIC 9(4) COMP-3.
             03 ISTr-DI1-FREE      PIC 9(4) COMP-3.
          02 ISTr-DI1-TUTAR        PIC 9(15)V99 COMP-3.
**********> Complimentary Kismi ......
          02 ISTr-COM-ODA          PIC 9(4) COMP-3.
          02 ISTr-COM-KISI.  
             03 ISTr-COM-BUYUK     PIC 9(4) COMP-3.
             03 ISTr-COM-KUCUK     PIC 9(4) COMP-3.
             03 ISTr-COM-FREE      PIC 9(4) COMP-3.
          02 ISTr-COM-TUTAR        PIC 9(15)V99 COMP-3.
**********> House Use     Kismi ......
          02 ISTr-HOU-ODA          PIC 9(4) COMP-3.
          02 ISTr-HOU-KISI.  
             03 ISTr-HOU-BUYUK     PIC 9(4) COMP-3.
             03 ISTr-HOU-KUCUK     PIC 9(4) COMP-3.
             03 ISTr-HOU-FREE      PIC 9(4) COMP-3.
          02 ISTr-HOU-TUTAR        PIC 9(15)V99 COMP-3.
**********> No Show  Kismi ......
          02 ISTr-NOS-ODA          PIC 9(4) COMP-3.
          02 ISTr-NOS-KISI.  
             03 ISTr-NOS-BUYUK     PIC 9(4) COMP-3.
             03 ISTr-NOS-KUCUK     PIC 9(4) COMP-3.
             03 ISTr-NOS-FREE      PIC 9(4) COMP-3.
          02 ISTr-NOS-TUTAR        PIC 9(15)V99 COMP-3.
**********> Single-Double-Triple-Group Istatistigi...........
          02 ISTr-SDT OCCURS 4 TIMES. 
             03 ISTr-SDT-ODA          PIC 9(4) COMP-3.
             03 ISTr-SDT-KISI.  
                04 ISTr-SDT-BUYUK     PIC 9(4) COMP-3.
                04 ISTr-SDT-KUCUK     PIC 9(4) COMP-3.
                04 ISTr-SDT-FREE      PIC 9(4) COMP-3.
             03 ISTr-SDT-TUTAR        PIC 9(15)V99 COMP-3.
          02 ISTr-TOP-corr-TUTAR      PIC 9(08)v99. 
          02 ISTr-BOS                 PIC X(20). 
