*
 fd istek label record standard.
 01 istek-rec.
    02 istek-anah.  
       03 istek-rez-no       pic 9(08).
       03 istek-folio-no     pic 9(08).
       03 istek-sifre        pic 9(06).
       03 istek-turu         pic x. | F-Folio R-Rez
       03 istek-anah-bos     pic x(100).
    02 istek-diger.   
       03 istek-durumu           pic 9. |1-Aktif 2-Pasif       
       03 istek-tar.
          04 istek-yil     pic 9999.
          04 istek-ay      pic 99.
          04 istek-gun     pic 99.
       03 istek-zaman.
          04 istek-saat    pic 9999.
          04 istek-dakika  pic 99.
          04 istek-saniye  pic 99.
       03 istek-staff      pic x(4).
       03 istek-aciklama   pic x(300).
       03 istek-bos              pic x(1000).

