         COPY "genel.lib".
         COPY "genelfis.lib".
         COPY "kodlar02.lib".
         COPY "dokumer.lib".
         copy "banka.lib".
         copy "doviz.lib".
         COPY "errorlog.lib".                                                    
         COPY "logindex.lib".
         COPY "odalar.lib".
         COPY "depkod.lib".                                            
