*
 COPY "genel.lib".
 COPY "genelfis.lib".
 COPY "kllnc.lib".
 COPY "rez.lib".
 COPY "konuk.lib".
 COPY "acenta.lib".
 COPY "kur.lib".
 COPY "kodlar02.lib".
 COPY "dagilim.lib".
 COPY "fiyat.lib".
 COPY "fiyatana.lib".
 COPY "odalar.lib".
 COPY "aksiyhrk.lib".
 COPY "takvim.lib".
 COPY "cast.lib".
 copy "dokumer.lib".
*
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
