*
 FD KARALIST LABEL RECORD IS STANDARD.
 01 KARALIST-REC.
    02 KARALIST-ANAH.
       03 KARALIST-TIPI        PIC  X.
       03 KARALIST-ADI         PIC  X(20).
       03 KARALIST-SOYADI      PIC  X(20).
    02 KARALIST-ACK-1          PIC  X(40).
    02 KARALIST-ACK-2          PIC  X(40).
    02 KARALIST-ADI-EK         PIC  X(15).
    02 KARALIST-BOS            PIC  X(185).
    02 KARALIST-STAF           PIC  X(04).
*
*******>Karalist-tipi.. Karalisteye alinmis kisinin tipini belirtir..
*******>M->Musteri P->Personel A->Acenta vs..gibi
