*
 COPY "genelfis.lib".
 COPY "dokumer.lib".
 COPY "karalist.lib".
 COPY "acenta.lib".
 COPY "genel.lib".
 COPY "odalar.lib".
*
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
