*
 copy "genel.lib".
 copy "odalar.lib".
 copy "konuk.lib".
 copy "kart.lib" of "../../cost/lib-sel".
 copy "errorlog.lib" of "../../cost/lib-sel".

*
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".                                                    
