fd kart label record standard.
01 kart-rec.
   02 kart-no               pic x(07).
   02 kart-data.
   03 kart-kim.
      04 kart-tipi          pic x.
         88 kart-musteri value "M".
         88 kart-odenmez value "O".
         88 kart-ikram   value "I".

         88 kart-tip-gecerli values are "M","O","I".
      04 kart-folio         pic 9(08).
   03 kart-durumu           pic x.
   03 kart-cin.
      04 kart-cin-yil       pic 9(04).
      04 kart-cin-ay        pic 9(02).
      04 kart-cin-gun       pic 9(02).
   03 kart-cot.
      04 kart-cot-yil       pic 9(04).
      04 kart-cot-ay        pic 9(02).
      04 kart-cot-gun       pic 9(02).
   03 kart-ind              pic 9(02).
   03 kart-tutar            pic s9(12)v99 comp-3.
   03 kart-limit            pic s9(12)v99 comp-3.
   03 kart-limit-uyari      pic x.
   03 kart-happy            pic x.
   03 kart-happy-ind        pic x.
      88 kart-happyde-happy-indirim     value "H".
      88 kart-happyde-kart-indirim      value "K".
      88 kart-happyde-tum-indirim       value "T".
   03 kart-aciklama         pic x(050).
   03 kart-kisi.
      04 kart-buyuk         pic 9(2).
      04 kart-kucuk         pic 9(2).
      04 kart-free          pic 9(2).
   03 kart-sira             pic x(002).
   03 kart-staf             pic x(4).
   03 kart-bos              pic x(040).

*/kart-tipi       => [O]->Odenmez [I]->Ikram [M]->Musteri
*/kart-durumu     => [I]->Iceride [S]->Silinmis veya C/Out
