       FD kasagir LABEL RECORD STANDARD.
       01 kasagir-REC.
          03 kasagir-ANAH.
            04 kasagir-tarih. 
               05 kasagir-yil    pic 9(4).
               05 kasagir-ay     pic 9(2).
               05 kasagir-gun    pic 9(2).
            04 kasagir-fis-no    pic 9(8).
            04 kasagir-tip       pic x.
          03 kasagir-diger.
             04 kasagir-tutar        pic 9(7)v99.
             04 kasagir-doviz-kodu   pic 9(2).
             04 kasagir-aciklama     pic x(500).
             04 kasagir-saat         pic x(4).
             04 kasagir-bos          pic x(496).
             04 kasagir-staf         pic x(4).

             


