         COPY "dokumer.lib".
         COPY "genel.lib".
         COPY "kodlar02.lib".
         COPY "genelfis.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".   
        COPY "odalar.lib".                                                                                            
