         COPY "dokumer.lib".
         COPY "genel.lib".
         COPY "kategori.lib".
         COPY "genelfis.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
        COPY "odalar.lib".                                                    
