*
 fd kbantsor label record standard.
 01 kbantsor-rec.
    02 kbantsor-anah.  | x(90)
       03 kbantsor-tarih.
          04 kbantsor-yil pic 9999.
          04 kbantsor-ay  pic 99.
          04 kbantsor-gun pic 99.
       03 kbantsor-zaman.
          04 kbantsor-saat    pic 99.
          04 kbantsor-dakika  pic 99.
          04 kbantsor-saniye  pic 99.
       03 kbantsor-anah-bos   pic x(50).
    02 kbantsor-diger.  | x(1025).
       03 kbantsor-seri-no    pic x(30).
       03 kbantsor-staff      pic x(4).
       03 kbantsor-bos        pic x(1000).

