
         COPY "genelfis.lib".
         COPY "genel.lib".
         COPY "dokumer.lib" OF "..\..\OTEL\LIB-SEL".
         COPY "doviz.lib" OF "..\..\OTEL\LIB-SEL".
         COPY "errorlog.lib".
         COPY "logindex.lib". 
         COPY "odalar.lib".
         COPY "merkod.lib".
         COPY "merkod.lib"   replacing  leading "merkod" by "mer2".

