       FD KIMLIK LABEL RECORD STANDARD.
       01 KIMLIK-REC.
          02 KIMLIK-ANAH.
             03 KIMLIK-FOLIO       PIC 9(08).
             03 KIMLIK-TIPI        PIC X.
             03 KIMLIK-SIRA        PIC 9(03).
          02 KIMLIK-DURUMU         PIC X.
*********> KIMLIK-Durumu   => Folionun iceridemi yoksa histroyde mi oldugunu
*********> belirtir...   I-> Iceride H->Historyde Gibi............
          02 KIMLIK-ADI             PIC X(20).
          02 KIMLIK-SOYADI          PIC X(20).
          02 KIMLIK-REZ-NO          PIC 9(08).
          02 KIMLIK-MESLEK          PIC X(20).
          02 KIMLIK-BABA-ADI        PIC X(20).
          02 KIMLIK-ANA-ADI         PIC X(20).
          02 KIMLIK-CINSIYET        PIC X.
          02 KIMLIK-MEDENI-HAL      PIC X.
          02 KIMLIK-KAN-GRUBU       PIC X(10).
          02 KIMLIK-ADRES.
             03 KIMLIK-ADRES1       PIC X(20).
             03 KIMLIK-ADRES2       PIC X(20).
             03 KIMLIK-IL           PIC X(20).
             03 KIMLIK-ILCE         PIC X(20).
          02 KIMLIK-UYRUK           PIC X(10).
          02 KIMLIK-E-MAIL          PIC X(40).
          02 KIMLIK-TELEFON         PIC X(25).
          02 KIMLIK-KIMLIK.
             03 KIMLIK-KIM-TURU     PIC 9.
             03 KIMLIK-KIM-NO       PIC X(10).
             03 KIMLIK-KIM-VERYER   PIC X(20).
             03 KIMLIK-KIM-TAR.
                04 KIMLIK-KIM-YIL   PIC 9999.
                04 KIMLIK-KIM-AY    PIC 99.
                04 KIMLIK-KIM-GUN   PIC 99.
          02 KIMLIK-DOGUM.
             03 KIMLIK-DOGUM-TAR.
                04 KIMLIK-DOGUM-YIL PIC 9999.
                04 KIMLIK-DOGUM-AY  PIC 99.
                04 KIMLIK-DOGUM-GUN PIC 99.
             03 KIMLIK-DOGUM-YERI   PIC X(20).
          02 KIMLIK-EVL-TAR.
             04 KIMLIK-EVL-YIL      PIC 9999.
             04 KIMLIK-EVL-AY       PIC 99.
             04 KIMLIK-EVL-GUN      PIC 99.
          02 KIMLIK-OZL-TAR.
             04 KIMLIK-OZL-YIL      PIC 9999.
             04 KIMLIK-OZL-AY       PIC 99.
             04 KIMLIK-OZL-GUN      PIC 99.

          02 KIMLIK-PLAKA           PIC X(15).
          02 KIMLIK-MESAJ.
             03 KIMLIK-MESAJ1       PIC X(40).
             03 KIMLIK-MESAJ2       PIC X(40).
          02 KIMLIK-BOS             PIC X(35).
          02 KIMLIK-STAF            PIC X(4).
********> Ozluk-Durumu..... Degiskeni    folionun iceridemi yoksa History de mi
********> Oldugunu gosterir.. Anahtar sahalar icin gerekli................
********> I-> Iceride H-> Historyde...........

