       FD KLLNC LABEL RECORD STANDARD.
       01 KLLNC-REC.
          02 K-KODU              PIC X(4).
          02 K-ADI               PIC X(20).
          02 K-SOYADI            PIC X(20).
          02 K-UNVAN             PIC X(20).
          02 K-ADRES-1           PIC X(30).
          02 K-ADRES-2           PIC X(30).
          02 K-TELEFON           PIC X(15).
          02 K-GIR-TAR.
             03 K-GIR-YIL        PIC 9(04).
             03 K-GIR-AY         PIC 9(02).
             03 K-GIR-GUN        PIC 9(02).
          02 K-CIK-TAR.
             03 K-CIK-YIL        PIC 9(04).
             03 K-CIK-AY         PIC 9(02).
             03 K-CIK-GUN        PIC 9(02).
          02 K-YETKI.
             03 K-SUPER          PIC X.
             03 K-USER           PIC X.
          02 K-KULLANIMDA        PIC X.
          02 K-SIFRE             PIC X(10).
          02 K-DOGUM-TARIH.
             03 K-DOGUM-YIL      PIC 9(4).
             03 K-DOGUM-AY       PIC 9(2).
             03 K-DOGUM-GUN      PIC 9(2).
          02 K-CEP-TEL           PIC X(15).
          
          02 K-EMAIL             PIC X(38).
          02 k-fiy-sup           pic 9.
          02 k-kisi-goremez      pic 9.
          02 K-SIRKET-YETKI      PIC X.
             88 K-SIRKET-EVET    VALUE "E".
             88 K-SIRKET-HAYIR   VALUE "H".
          02 K-OZL-ISL-YETKI     PIC X.
             88 K-OZL-ISL-EVET   VALUE "E".
             88 K-OZL-ISL-HAYIR  VALUE "H".
          02 K-FIS-YETKI.
             03 K-MAHSUP-YETKI   PIC X.
             03 K-TAHSIL-YETKI   PIC X.
             03 K-TEDIYE-YETKI   PIC X.
          02 K-PERYOT-UYAR       PIC X.
          02 k-tfiyat-bas-tar.
            03 k-tfiyat-bas-yil  pic 9999.
            03 k-tfiyat-bas-ay   pic 99.
            03 k-tfiyat-bas-gun  pic 99.
          02 k-tfiyat-bit-tar.
            03 k-tfiyat-bit-yil  pic 9999.
            03 k-tfiyat-bit-ay   pic 99.
            03 k-tfiyat-bit-gun  pic 99.
          02 k-dokumer-tipi      pic 9.
          02 k-cek-silemez       pic 9.
          02 k-kasa              pic 9.
          02 K-REST-SUP          PIC 9.  
          02 K-SKIN              PIC X(14). | kvkk icin 1 hane aldim 
          02 k-kvkk-yetki        pic x.     |firattt
          02 K-muh-SUP           PIC 9.       
          02 k-default-email     PIC 9.
          02 K-DEV-TAH-YETKI     pic 9.
          02 K-DEV-PRIM-YETKI    pic 9.
          02 k-blok-kitler       pic 9.
          02 k-blok-acar         pic 9.
          02 K-DEV-YETKI         pic 9.
          02 k-rackde-satir      pic 99.
          02 k-ayrac-degistir    pic 9.
          02 K-grup              pic X.
          02 K-grup-kodu                pic x(4).
          02 k-durum-degistiremez       pic 9.
          02 k-kirli-odaya-cin-yapamaz  pic 9.
          02 k-corr-yapabilir           pic 9.
          02 k-konum-upgrade-yapabilir  pic 9.
          02 k-konum-upgrade-sifresi    pic x(8).
          02 k-rezer-sup                pic 9.
          02 k-onaylar                  pic 9.
          02 k-kvkk-bilgileri-gorebilir pic 9.
          02 k-cektr-yapamaz            pic 9.
          02 k-ccenter-user             pic 9.
          02 k-ccenter-supervisor       pic 9.
          02 k-fis-kopyalayabilir       pic 9.
          02 k-fiy-planlama-yapamaz     pic 9.
          02 k-fix-fiyat-etkin          pic 9.
          02 k-fatura-iptal-edemez      pic 9.
          02 k-folio-efat-kesemez       pic 9.
          02 k-folio-duzeltme-talep-etme pic 9.
          02 k-folio-duzeltme-talep-onay pic 9.
          02 k-kayip-gecmis-duzenleyemez pic 9.
          02 k-upgrade-supervisor        pic 9.
          02 K-BOS                      PIC X(17).
          02 K-tamam-kyt-acma           PIC X. 
          02 k-ref                      pic 9.
          02 K-DEP-YETKI-SEV            PIC X.
          02 K-DEPARTMAN                PIC X(02).
          02 K-STAF                     PIC X(04).
