       fd kodlar03 label record standard.
       01 kodlar03-rec.
           02 kodlar03-anahtar.
            03 kodlar03-tipi          pic xx.
            03 kodlar03-kodu1         pic x(15).
            03 kodlar03-kodu2         pic 9(09).
            03 kodlar03-bos           pic x(15).
           02 kodlar03-adi            pic x(50).
           02 kodlar03-aciklama-1     pic x(50).
           02 kodlar03-aciklama-2     pic x(50).
           02 filler                  pic x(500).

