       fd kodlar10 label record standard.
       01 kodlar10-rec.
           02 kodlar10-anahtar.
              03 kodlar10-tipi        pic xx.
              03 kodlar10-tarih.
                 04 kodlar10-yil      pic 9(4).
                 04 kodlar10-ay       pic 9(2).
                 04 kodlar10-gun      pic 9(2).
              03 kodlar10-fis         pic 9(10).
              03 kodlar10-sira        pic 9(10).
              03 kodlar10-kodu-tum.
                04 kodlar10-kodu1       pic x(15).
                04 kodlar10-kodu2       pic x(15).
           02 kodlar10-adi            pic x(50).
           02 kodlar10-aciklama-1     pic x(50).
           02 kodlar10-aciklama-2     pic x(50).
           02 kodlar10-miktar         pic 9(12)v999.
           02 kodlar10-tutar          pic 9(12)v99.
           02 kodlar10-stk-kodu       pic x(8).
           02 kodlar10-ref               pic x(03).
           02 kodlar10-is-sure.
             03 kodlar10-is-saat      pic 9(2).
             03 kodlar10-is-dakika    pic 9(2). 
           02 kodlar10-rusca-istipidetay pic x(200).
           02 kodlar10-mobil-ciksin    pic 9.
           02 kodlar10-aciklama-girilemez pic 9.
           02 filler                  pic x(291).
           02 kodlar10-staf           pic x(04).
************kodlar10-tipi AA- Takip Malzeme tanimlamasi
************kodlar10-tipi AB- Sikayet/Dilek/Oneri kaynagi
************kodlar10-tipi AC- Bolum Tanimlama
************kodlar10-tipi AD- Yer Tanimlama
************kodlar10-tipi AE- Departman Tanimlama
************kodlar10-tipi AF- IS TIPI Tanimlama
************kodlar10-tipi AH- IS TIPI Detay Tanimlama
************kodlar10-tipi AG- ODA NUMARASI
