*
 COPY "genel.lib".
 COPY "odalar.lib".
 COPY "kodlar02.lib".
 COPY "konuk.lib".
 copy "konum.lib".
 COPY "errorlog.lib".
*
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".                                                    
