*
 fd kolbant label record standard.
 01 kolbant-rec.
    02 kolbant-anah.  | x(90)
       03 kolbant-rez-no       pic 9(8).
       03 kolbant-seri-no      pic x(30).
       03 kolbant-anah-bos     pic x(50).
    02 kolbant-diger.  | x(1025).
       03 kolbant-durumu       pic 9. |1-Aktif 2-Zaiyat 3-Kayip 4-Cout       
       03 kolbant-kayit-tar.
          04 kolbant-kayit-yil pic 9999.
          04 kolbant-kayit-ay  pic 99.
          04 kolbant-kayit-gun pic 99.
       03 kolbant-kayit-staff  pic x(4).
       03 kolbant-deg-tar.
          04 kolbant-deg-yil   pic 9999.
          04 kolbant-deg-ay    pic 99.
          04 kolbant-deg-gun   pic 99.
       03 kolbant-deg-staff    pic x(4).
       03 kolbant-mus-anah.
          04 kolbant-mus-sirket   pic x(8).
          04 kolbant-mus-profil   pic 9(8).
       03 kolbant-p-aciklama      pic x(200).
       03 kolbant-p-bilinci       pic 9.
       03 kolbant-ex-pax          pic 9.
       03 kolbant-uzatma          pic 9.
       03 kolbant-duzeltme        pic 9.
       03 kolbant-p-bil-aciklama  pic x(100).
       03 kolbant-bakim           pic 9.
       03 kolbant-bos             pic x(679).


