         COPY "dokumer.lib".
         COPY "takvim.lib".
         COPY "genel.lib".
         COPY "uyruk.lib".
         COPY "konum.lib".
         COPY "genelfis.lib".
         COPY "errorlog.lib".                                                    
         COPY "logindex.lib".  
         copy "acenta.lib".                          
         copy "odalar.lib".
         copy "konstop.lib".                          
