*************
 FD konstop  LABEL RECORD STANDARD.
  01 konstop-REC.
           02 konstop-ANAH.
              03 konstop-ilk-TARIH.
                 04 konstop-ilk-YIL       PIC 9(4).
                 04 konstop-ilk-AY        PIC 9(2).
                 04 konstop-ilk-GUN       PIC 9(2).
              03 konstop-son-TARIH.
                 04 konstop-son-YIL       PIC 9(4).
                 04 konstop-son-AY        PIC 9(2).
                 04 konstop-son-GUN       PIC 9(2).
           
               03 konstop-KONUM      PIC 99.
           
           02 konstop-bos              pic x(28).   
           02 konstop-staff              pic x(04).    


