       FD KONTRAT LABEL RECORD STANDARD.
       01 KONTRAT-REC.
          02 KONTRAT-ANAH.
             03 KONTRAT-ACENTA PIC X(4).
             03 kontrat-eksi       pic x.
             03 KONTRAT-ILK-TARIH.
                04 KONTRAT-ILK-YIL PIC 9999.
                04 KONTRAT-ILK-AY  PIC 99.
                04 KONTRAT-ILK-GUN PIC 99.
             03 KONTRAT-SON-TARIH.
                04 KONTRAT-SON-YIL PIC 9999.
                04 KONTRAT-SON-AY  PIC 99.
                04 KONTRAT-SON-GUN PIC 99.
             03 KONTRAT-TIPI       PIC 9.
             03 KONTRAT-PAN-TIPI   PIC XX.
             
           02 KONTRAT-BEKLE-GUNU   PIC 999.
           02 KONTRAT-ODA-ATA.
              03 KONTRAT-ODA-DIZI OCCURS 41 TIMES.
                 04 KONTRAT-ODA       PIC 9(4) COMP-3.
           02 KONTRAT-BOS          PIC X(20).
           02 KONTRAT-STAF         PIC X(04).
**************  Kontrat-Tipi   = 1 Single Oda
**************  Kontrat-Tipi   = 2 Double Oda
**************  Kontrat-Tipi   = 3 Triple Oda
**************  Kontrat-Tipi   = 4 Group  Oda
**************  Kontrat-Oda    = 1-9 Arasi Oda Tipi var hangisi oldugu
**************  Kontrat-Pan-tipi = su anda kullanilmiyor bos ... Ileri icin ...
