*
         COPY "genel.lib".
         COPY "genelfis.lib".
         COPY "dokumer.lib".
         COPY "konum.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
