       FD KONUM LABEL RECORD STANDARD.
       01 KONUM-REC.
           02 KONUM-ANAHTAR      PIC 99.
           02 KONUM-ADI          PIC X(13).
           02 KONUM-MAX-KAPASITE PIC 9.
           02 KONUM-WEBTE-SATIS  PIC 9.
           02 KONUM-TOP-ODA      PIC 9(04).
           02 KONUM-HAZIR-ODA    PIC 9(04).
           02 konum-ref          pic 9.
           02 konum-satis        pic 9.
           02 konum-ust1         pic 99.
           02 konum-ust2         pic 99.
           02 konum-sira         pic 99.
           02 konum-max-pax      pic 9.
           02 KONUM-TUTAR-SIRA   PIC X(01).
           02 KONUM-STAF         PIC X(04).
**********-> Oda Konumlarini belirten datadir...
**********-> 1.Kara Tarifi 2.Deniz Tarafi gibi..
**********-> KONUM-TOP-ODA  -> Bu tipte kac oda oldugunu belirtir....
**********-> KONUM-HAZIR-ODA-> Bu tipte satisa hazir kac oda oldugunu belirtir.


       FD KONUMEK LABEL RECORD STANDARD.
       01 KONUMEK-REC.
           02 KONUMEK-ANAHTAR      PIC 99.
           02 KONUMEK-TUTAR        PIC 9(6)V99.
           02 konumek-carpan       pic 9(2)v99.                
           02 konumek-cocuk-yok    pic 9.
           02 KONUMEK-TUTAR-usd    PIC 9(6)V99.
           02 KONUMEK-TUTAR-tl     PIC 9(6)V99.
           02 KONUMEK-TUTAR-gbp    PIC 9(6)V99.
           02 konumek-dv-1         pic 99.
           02 konumek-dv-2         pic 99.
           02 konumek-dv-3         pic 99.
           02 konumek-dv-4         pic 99.
           02 konumek-adi          pic x(50).
           02 konumek-web-eur      pic 9.
           02 konumek-web-usd      pic 9.
           02 konumek-web-tl       pic 9.
           02 konumek-web-gbp      pic 9.
           02 konumek-kisi-bebek   pic 9.
           02 konumek-kapasite-uyari pic 999.
           02 konumek-upg-olarak-kullanma  pic 9.
           02 konumek-rapor-ref    pic 9.
           02 konumek-bos          pic x(403).
           02 konumek-staf         pic x(4).

