*
         copy "genel.lib".
         copy "genelfis.lib".
         copy "konuk.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".  
        COPY "odalar.lib".                                                                                                                                               
