       FD KONUK LABEL RECORD STANDARD.
       01 KONUK-REC.
          02 KONUK-ANAH.
             03 KONUK-FOLIO         PIC 9(08).
          02 KONUK-DURUMU           PIC X.
*********> Konuk-Durumu   => Folionun iceridemi yoksa histroyde mi oldugunu
*********> belirtir...I-> Iceride H->Historyde Gibi............
          02 KONUK-FOL-KODU         PIC X.
*********> Konuk-Fol-Kodu => R-> Oda E-> Extra T-> Telefon G-> Grup B-> Bos
          02 KONUK-ADI              PIC X(20).
          02 KONUK-SOYADI           PIC X(20).
          02 KONUK-S-D-T-G          PIC 9.
          02 KONUK-ODA-KONUMU       PIC 99.
          02 KONUK-ODEME-TIPI       PIC XX.
          02 konuk-odano            PIC X(04).
          02 KONUK-REZ-NO           PIC 9(08).
          02 KONUK-ULKE             PIC XXX.
          02 KONUK-KISI.
             03 KONUK-BUYUK         PIC 9(02).
             03 KONUK-KUCUK         PIC 9(02).
             03 KONUK-BEBEK         PIC 9(01).
             03 KONUK-FREE          PIC 9(01).
          02 konuk-acenta           PIC X(04).
          02 konuk-mini-ok          pic 9.
          02 konuk-plan             pic 9.
          02 konuk-duzeltme         pic 9.
          02 KONUK-bos3             PIC X(01).
          02 KONUK-VOUCHER          PIC X(30).
          02 KONUK-NOR-INDIRIM      PIC 99V99.
          02 KONUK-PAN-TIPI         PIC XX.
          02 KONUK-REZ-TIPI         PIC 9.
          02 KONUK-BANKA            PIC 99.
          02 KONUK-DOVIZ            PIC 99.
          02 KONUK-ANLASMA          PIC XX.
          02 KONUK-KUR-AYGUN        PIC X.
*********> Konuk-Kur-Aygun = A-> Aybasi Kuru G-> Gunluk kur
          02 KONUK-FATURA           PIC X.
          02 KONUK-CIK-CIKMA        PIC X.
          02 KONUK-ERKEN-CIK        PIC X.
          02 KONUK-UZATMA           PIC X.
          02 KONUK-POSTING          PIC X.
          02 KONUK-VIP              PIC X.
          02 KONUK-ODADEGIS         PIC X.
*********> Konuk-Erken-Cik = Early C/Out E/H
*********> Konuk-Uzatma    = Uzatma      E/H
*********> Konuk-Posting   = Posting     E/H
*********> Konuk-Vip       = V-> V.I.P T-> Top V.I.P
*********> Konuk-Fatura    = E-> Faturasi Kesilmis.. H-> Faturasi Kesilmemis
*********> Konuk-Cik-Cikma = E-> Musteri Listesi Cik H-> Musteri Listesi Cikma
*********> Konuk-Odadegis  = E-> Bu Oda Room change yapilmistir.....
          02 KONUK-ACIK-KAPALI      PIC X.
*********> Konuk-Acik-kapali = O-> Open C-> Close
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=KONUK_GEL_TAR
          02 KONUK-GEL-TAR.
             03 KONUK-GEL-YIL       PIC 9999.
             03 KONUK-GEL-AY        PIC 99.
             03 KONUK-GEL-GUN       PIC 99.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=KONUK_GIT_TAR
          02 KONUK-GIT-TAR.
             03 KONUK-GIT-YIL       PIC 9999.
             03 KONUK-GIT-AY        PIC 99.
             03 KONUK-GIT-GUN       PIC 99.
          02 KONUK-GEL-ZAMAN.
             03 KONUK-GEL-SAAT      PIC 99.
             03 KONUK-GEL-DAKIKA    PIC 99.
             03 KONUK-GEL-SANIYE    PIC 99.
          02 KONUK-GIT-ZAMAN.
             03 KONUK-GIT-SAAT      PIC 99.
             03 KONUK-GIT-DAKIKA    PIC 99.
             03 KONUK-GIT-SANIYE    PIC 99.

          02 KONUK-ODA-TUTAR        PIC s9(12)V99   COMP-3.
          02 KONUK-EXTBED-TUTAR     PIC s9(12)V99   COMP-3.
          02 KONUK-KAHVALTI-TUTAR   PIC s9(12)V99   COMP-3.
          02 KONUK-OGLE-TUTAR       PIC s9(12)V99   COMP-3.
          02 KONUK-AKSAM-TUTAR      PIC s9(12)V99   COMP-3.
          02 KONUK-ICECEK-TUTAR     PIC s9(12)V99   COMP-3.
          02 KONUK-EXTRA-TUTAR      PIC s9(12)V99   COMP-3.

          02 KONUK-TOP-BORC         PIC S9(12)V99  COMP-3.
          02 KONUK-TOP-ALAC         PIC S9(12)V99  COMP-3.
          02 KONUK-KUR-DEGERI       PIC 9(9)V9(05) COMP-3.
          02 KONUK-DV-DEGERI        PIC 9(12)V99   COMP-3.

          02 KONUK-ACIK.
             03 KONUK-ACIK-1        PIC X(100).
             03 KONUK-ACIK-2        PIC X(100).
          02 KONUK-KARTNO           PIC X(07).
          02 KONUK-REOPEN           PIC X.
          02 KONUK-OPERATOR         PIC X(02).
          02 KONUK-GRUP-NO          PIC 9(06).
          02 konuk-al-tar.
             05 konuk-al-yil        pic 99.
             05 konuk-al-ay         pic 99.
             05 konuk-al-gun        pic 99.
**********          02 KONUK-TOM.
**********              03 KONUK-TOM-VAR-YOK   PIC X.
**********              03 KONUK-TOM-ALKOL     PIC 9.
**********              03 KONUK-TOM-SERINO    PIC X(12).
          02 KONUK-PAZAR            PIC X(02).
          02 KONUK-EB               PIC X.
          02 KONUK-FIYAT-FIX        PIC X.
          02 KONUK-GELIS-SAYISI     PIC 9(2).
          02 KONUK-FIYAT-KONUMU     PIC 99.
          02 KONUK-GEC-GIRIS        PIC 9.
          02 KONUK-FAT-NO           PIC 9(06).
          02 KONUK-UG-INDIRIMI      PIC 9.
          02 KONUK-BILBORD-EH       PIC X.
          02 KONUK-EXTRA-REZ-NO     PIC 9(08).
          02 KONUK-TITLE            PIC X(3).
          02 konuk-profil-no        pic 9(8).
          02 konuk-rehber           pic x(2).
          02 KONUK-SAFE             PIC 9.
          02 KONUK-ANAHTAR          PIC 9.
          02 konuk-late-zaman.
            03 konuk-late-gel-saat  PIC 99.
            03 konuk-late-gel-dak   PIC 99.
          02 KONUK-AKSIYON-EH       PIC X.
          02 konuk-share            pic 9.
          02 konuk-SPECIAL-EH         pic 9.
          02 konuk-sehir            pic xxx.
          02 KONUK-firma            PIC X(05).
          02 konuk-stafbos          pic x(4).
          02 konuk-sharenum         pic 9(8).
          02 konuk-acik-hesap       pic 9.
          02 konuk-kapat-tarih.
              05 konuk-kapat-yil    pic 9999.
              05 konuk-kapat-ay     pic 99.
              05 konuk-kapat-gun    pic 99.
          02 konuk-kapat-zaman. 
             05 konuk-kapat-saat    pic 99.
             05 konuk-kapat-dak    pic 99.
             05 konuk-kapat-san    pic 99.
          02 konuk-cout-staf         pic xxxx.
          02 konuk-acik-hesap-staf   pic xxxx.
          02 konuk-kapat-staf        pic xxxx.
          02 konuk-cin-staf          pic xxxx.
          02 konuk-gunsonu-cout      pic 9.
          02 konuk-kredi-kart.
             03 konuk-kart-tipi     pic x.
             03 konuk-kart-no1      pic x(04).
             03 konuk-kart-no2      pic x(04).
             03 konuk-kart-no3      pic x(04).
             03 konuk-kart-no4      pic x(04).
             03 konuk-cvv-kodu      pic x(03).
             03 konuk-onay-kodu     pic x(15).
             03 konuk-onay-tutar    pic 9(7)v99.
             03 konuk-onay-doviz    pic x(02).
             03 konuk-kart-sahibi   pic x(50).
             03 konuk-kart-son-ay   pic 9(2).
             03 konuk-kart-son-yil  pic 9(2).
             03 konuk-provizyon-notu pic x(20).
      *    02 konuk-bos9             pic x(968).
          02 konuk-room-kdv-yok     pic x.
          02 konuk-extra-kdv-yok    pic x.
          02 konuk-kaynak-1       pic x(02).
          02 konuk-kaynak-2       pic x(02).
          02 konuk-kaynak-3       pic x(02).
          02 konuk-telefon-no     pic x(15).
          02 konuk-vip-turu       pic x.
          02 konuk-dig-plan.
                03 konuk-oda-plan       pic 9.
                03 konuk-kisi-plan      pic 9.
                03 konuk-fkonum-plan    pic 9.
                03  konuk-pans-plan    pic 9.
          02 konuk-proforma      pic 9.
          02 konuk-paylas-oda     pic 9.
          02 konuk-dys-fis          pic 9(10).
          02 konuk-vip-oto-degis    pic 9.
          02 konuk-fix-anl          pic 9.
          02 konuk-odano-uzun       pic x(5).
          02 konuk-online-cin       pic 9.
          02 konuk-mail-adr         pic x(30).
          02 konuk-bos9             pic x(770).
          02 KONUK-STAF             PIC X(04).
********> Konuk-Durumu.....Degiskeni  folionun iceridemi yoksa History de mi
********> Oldugunu gosterir.. Anahtar sahalar icin gerekli................
********> I-> Iceride H-> Historyde...........
********> Konum-tom-var-yok => "E" Ise bu folioya ait tom var demektir....
********> Konum-tom-alkol   => Musterinin alkol seviyesini belirler........
********>                 0 => Alkolsuz............
********>                 1 => Az Alkollu..........
********>                 2 => Orta Alkollu........
********>                 3 => Cok Alkollu.........

