       FD konuk LABEL RECORD STANDARD.
       01 konuk-REC.
          02 konuk-ANAH.
             03 konuk-FOLIO         PIC 9(08).
          02 konuk-DURUMU           PIC X.
*********> konuk-Durumu   => Folionun iceridemi yoksa histroyde mi oldugunu
*********> belirtir...I-> Iceride H->Historyde Gibi............
          02 konuk-FOL-KODU         PIC X.
*********> konuk-Fol-Kodu => R-> Oda E-> Extra T-> Telefon G-> Grup B-> Bos
          02 konuk-ADI              PIC X(20).
          02 konuk-SOYADI           PIC X(20).
          02 konuk-S-D-T-G          PIC 9.
          02 konuk-ODA-KONUMU       PIC 99.
          02 konuk-ODEME-TIPI       PIC XX.
          02 konuk-ODANO            PIC X(04).
          02 konuk-REZ-NO           PIC 9(08).
          02 konuk-ULKE             PIC XXX.
          02 konuk-KISI.
             03 konuk-BUYUK         PIC 9(02).
             03 konuk-KUCUK         PIC 9(02).
             03 konuk-BEBEK         PIC 9(01).
             03 konuk-FREE          PIC 9(01).
          02 konuk-ACENTA           PIC X(04).
          02 konuk-mini-ok          pic 9.
          02 konuk-plan             pic 9.
          02 konuk-duzeltme         pic 9.
          02 konuk-bos3             PIC X(01).
          02 konuk-VOUCHER          PIC X(10).
          02 konuk-NOR-INDIRIM      PIC 99V99.
          02 konuk-PAN-TIPI         PIC XX.
          02 konuk-REZ-TIPI         PIC 9.
          02 konuk-BANKA            PIC 99.
          02 konuk-DOVIZ            PIC 99.
          02 konuk-ANLASMA          PIC XX.
          02 konuk-KUR-AYGUN        PIC X.
*********> konuk-Kur-Aygun = A-> Aybasi Kuru G-> Gunluk kur
          02 konuk-FATURA           PIC X.
          02 konuk-CIK-CIKMA        PIC X.
          02 konuk-ERKEN-CIK        PIC X.
          02 konuk-UZATMA           PIC X.
          02 konuk-POSTING          PIC X.
          02 konuk-VIP              PIC X.
          02 konuk-ODADEGIS         PIC X.
*********> konuk-Erken-Cik = Early C/Out E/H
*********> konuk-Uzatma    = Uzatma      E/H
*********> konuk-Posting   = Posting     E/H
*********> konuk-Vip       = V-> V.I.P T-> Top V.I.P
*********> konuk-Fatura    = E-> Faturasi Kesilmis.. H-> Faturasi Kesilmemis
*********> konuk-Cik-Cikma = E-> Musteri Listesi Cik H-> Musteri Listesi Cikma
*********> konuk-Odadegis  = E-> Bu Oda Room change yapilmistir.....
          02 konuk-ACIK-KAPALI      PIC X.
*********> konuk-Acik-kapali = O-> Open C-> Close
          02 konuk-GEL-TAR.
             03 konuk-GEL-YIL       PIC 9999.
             03 konuk-GEL-AY        PIC 99.
             03 konuk-GEL-GUN       PIC 99.
          02 konuk-GIT-TAR.
             03 konuk-GIT-YIL       PIC 9999.
             03 konuk-GIT-AY        PIC 99.
             03 konuk-GIT-GUN       PIC 99.
          02 konuk-GEL-ZAMAN.
             03 konuk-GEL-SAAT      PIC 99.
             03 konuk-GEL-DAKIKA    PIC 99.
             03 konuk-GEL-SANIYE    PIC 99.
          02 konuk-GIT-ZAMAN.
             03 konuk-GIT-SAAT      PIC 99.
             03 konuk-GIT-DAKIKA    PIC 99.
             03 konuk-GIT-SANIYE    PIC 99.
          02 konuk-ODA-TUTAR        PIC s9(12)V99   COMP-3.
          02 konuk-EXTBED-TUTAR     PIC s9(12)V99   COMP-3.
          02 konuk-KAHVALTI-TUTAR   PIC s9(12)V99   COMP-3.
          02 konuk-OGLE-TUTAR       PIC s9(12)V99   COMP-3.
          02 konuk-AKSAM-TUTAR      PIC s9(12)V99   COMP-3.
          02 konuk-ICECEK-TUTAR     PIC s9(12)V99   COMP-3.
          02 konuk-EXTRA-TUTAR      PIC s9(12)V99   COMP-3.
          02 konuk-TOP-BORC         PIC S9(12)V99  COMP-3.
          02 konuk-TOP-ALAC         PIC S9(12)V99  COMP-3.
          02 konuk-KUR-DEGERI       PIC 9(9)V9(05) COMP-3.
          02 konuk-DV-DEGERI        PIC 9(12)V99   COMP-3.
          02 konuk-ACIK.
             03 konuk-ACIK-1        PIC X(20).
             03 konuk-ACIK-2        PIC X(20).
          02 konuk-KARTNO           PIC X(07).
          02 konuk-REOPEN           PIC X.
          02 konuk-OPERATOR         PIC X(02).
          02 konuk-GRUP-NO          PIC 9(06).
          02 konuk-al-tar.
             05 konuk-al-yil        pic 99.
             05 konuk-al-ay         pic 99.
             05 konuk-al-gun        pic 99.
**********          02 konuk-TOM.
**********              03 konuk-TOM-VAR-YOK   PIC X.
**********              03 konuk-TOM-ALKOL     PIC 9.
**********              03 konuk-TOM-SERINO    PIC X(12).
          02 konuk-PAZAR            PIC X(02).
          02 konuk-EB               PIC X.
          02 konuk-FIYAT-FIX        PIC X.
          02 konuk-GELIS-SAYISI     PIC 9(2).
          02 konuk-FIYAT-KONUMU     PIC 99.
          02 konuk-GEC-GIRIS        PIC 9.
          02 konuk-FAT-NO           PIC 9(06).
          02 konuk-UG-INDIRIMI      PIC 9.
          02 konuk-BILBORD-EH       PIC X.
          02 konuk-EXTRA-REZ-NO     PIC 9(08).
          02 konuk-TITLE            PIC X(3).
          02 konuk-profil-no        pic 9(8).
          02 konuk-rehber           pic x(2).
          02 konuk-SAFE             PIC 9.
          02 konuk-ANAHTAR          PIC 9.
          02 konuk-LATE-ZAMAN.
            03 konuk-LATE-GEL-SAAT  PIC 99.
            03 konuk-LATE-GEL-DAK   PIC 99.
          02 konuk-AKSIYON-EH       PIC X.
          02 konuk-share            pic 9.
          02 konuk-SPECIAL-EH         pic 9.
          02 konuk-sehir            pic xxx.
          02 konuk-firma            PIC X(05).
          02 konuk-stafbos          pic x(4).
          02 konuk-sharenum         pic 9(8).
          02 konuk-acik-hesap       pic 9.
          02 konuk-kapat-tarih.
              05 konuk-kapat-yil    pic 9999.
              05 konuk-kapat-ay     pic 99.
              05 konuk-kapat-gun    pic 99.
          02 konuk-kapat-zaman. 
             05 konuk-kapat-saat    pic 99.
             05 konuk-kapat-dak    pic 99.
             05 konuk-kapat-san    pic 99.
          02 konuk-cout-staf         pic xxxx.
          02 konuk-acik-hesap-staf   pic xxxx.
          02 konuk-kapat-staf        pic xxxx.
          02 konuk-cin-staf          pic xxxx.
          02 konuk-gunsonu-cout      pic 9.
          02 konuk-kredi-kart.
             03 konuk-kart-tipi     pic x.
             03 konuk-kart-no1      pic x(04).
             03 konuk-kart-no2      pic x(04).
             03 konuk-kart-no3      pic x(04).
             03 konuk-kart-no4      pic x(04).
             03 konuk-cvv-kodu      pic x(03).
             03 konuk-onay-kodu     pic x(15).
             03 konuk-onay-tutar    pic 9(7)v99.
             03 konuk-onay-doviz    pic x(02).
             03 konuk-kart-sahibi   pic x(50).
             03 konuk-kart-son-ay   pic 9(2).
             03 konuk-kart-son-yil  pic 9(2).
             03 konuk-provizyon-notu pic x(20).
          02 konuk-room-kdv-yok     pic x.
          02 konuk-extra-kdv-yok    pic x.
          02 konuk-kaynak-1       pic x(02).
          02 konuk-kaynak-2       pic x(02).
          02 konuk-kaynak-3       pic x(02).
          02 konuk-telefon-no     pic x(15).
          02 konuk-vip-turu       pic x.
          02 konuk-bos9             pic x(824).
          02 konuk-STAF             PIC X(04).