         copy "genel.lib".
         copy "not.lib".
         copy "takvim.lib".
         copy "odalar.lib".
         

        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".                                                    
