       fd kvkky label record standard.
       01 kvkky-rec.
          02 kvkky-anah. 
             03 kvkky-modul                     pic x(4).
                88 kvkk-modul-muha value "muha".
                88 kvkk-modul-otel value "otel".
                88 kvkk-modul-stok value "stok".
                88 kvkk-modul-sati value "sati".
                88 kvkk-modul-cost value "cost".
                88 kvkk-modul-kios value "kios".
                88 kvkk-modul-call value "call".
             03 kvkky-program                   pic x(50).
             03 kvkky-kolon-adi                 pic x(50).
             03 kvkky-bos-anah                  pic x(100).
          02 kvkky-kvkky-bilgiler.
             03 kvkky-eh                        pic x.
                88 kvkky-yetki-var value "E".
                88 kvkky-yetki-yok value "H"," ".
             03 kvkky-filler                    pic x(1000).
 
