*
 FD kvkksoru LABEL RECORD IS STANDARD.
 01 kvkksoru-rec.
    02 kvkksoru-anah.
       03 kvkksoru-sira             PIC  9(03).
    02 kvkksoru-diger.
       03 kvkksoru-baslik           PIC  X(150).
       03 kvkksoru-cevap            PIC  X(01).
       03 kvkksoru-bas-tar          PIC  9(08).
       03 kvkksoru-bit-tar          PIC  9(08).
       03 kvkksoru-text             PIC  X(1000).
    02 kvkksoru-bos                 PIC  X(1000).

