         COPY "genelfis.lib".
         COPY "genel.lib".
         COPY "dokumer.lib".
         COPY "errorlog.lib".                                                    
         COPY "logindex.lib".
         COPY "odalar.lib".
         COPY "kvkksoru.lib".
         COPY "yanrez.lib".

