       FD Ldevremulk LABEL RECORD STANDARD.
        01 Ldevremulk-rec.
          02 Ldevremulk-anah.
             03 Ldevremulk-no                     pic 9(08). 
          02 Ldevremulk-data.
             03 Ldevremulk-profil-anah.
                05 Ldevremulk-profil-sirket       pic x(08).
                05 Ldevremulk-profil-no           pic 9(08).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=Ldevremulk_SATIS_TARIHI
             03 Ldevremulk-satis-tarihi.
                05 Ldevremulk-satis-yil           pic 9999.
                05 Ldevremulk-satis-ay            pic 99.
                05 Ldevremulk-satis-gun           pic 99.
             03 Ldevremulk-baslama-yil            pic 9999.
             03 Ldevremulk-bitis-yil              pic 9999.
             03 Ldevremulk-satan-profil-anah.
                05 Ldevremulk-satan-profil-sirket pic x(08).
                05 Ldevremulk-satan-profil-no     pic 9(08).
             03 Ldevremulk-kontak-profil-anah.
                05 Ldevremulk-kontak-profil-sirket pic x(08).
                05 Ldevremulk-kontak-profil-no     pic 9(08).
             03 Ldevremulk-oda-konumu              pic 99.
             03 Ldevremulk-oda-no                  pic x(04).
             03 Ldevremulk-tapu-no                 pic x(50).
             03 Ldevremulk-gun-sayisi              pic 9(3).
             03 Ldevremulk-durumu                  pic x.
             |-- S = Silinmis Y = Kullanimda - K = Kapali
             03 Ldevremulk-devre-ay                pic 99.
             03 Ldevremulk-devre-donem             pic x(04).
             03 Ldevremulk-aciklama                pic x(300).
             03 Ldevremulk-satis-tutari            pic 9(8)v99.
             03 Ldevremulk-kayit-tarihi.
                05 Ldevremulk-kayit-yil           pic 9999.
                05 Ldevremulk-kayit-ay            pic 99.
                05 Ldevremulk-kayit-gun           pic 99.
             03 Ldevremulk-staf                    pic x(04).
             03 Ldevremulk-hesap-no                pic x(15).  
             |-----Ldevremulk eklenenler---------------------|
             03 Ldevremulk-sozlesme-no             pic x(10).
             03 Ldevremulk-dosya-no                pic x(10).
             03 Ldevremulk-satan-danisman          pic 9(5).
             03 Ldevremulk-durum                   pic x(20).
             | en alt birimden üst birime kadar prim dagýlýmlarý ve bunlar ayrý datada tutulacak esnek olabilirmiþs !
             03 Ldevremulk-p-asistan            pic 9(5).
             03 Ldevremulk-p-danisman           pic 9(5).
             03 Ldevremulk-p-liddanisman             pic 9(5).
             03 Ldevremulk-p-yondanisman             pic 9(5).
             03 Ldevremulk-p-ilsatmud                pic 9(5).
             03 Ldevremulk-p-yrdkor                  pic 9(5).
             03 Ldevremulk-p-kor                     pic 9(5).
             03 Ldevremulk-p-bolgekor                pic 9(5).
             03 Ldevremulk-p-bolgemud                pic 9(5).
             03 Ldevremulk-p-gkor                    pic 9(5).
             03 Ldevremulk-p-prokor                  pic 9(5). | proje kordinatoru yokkkmus 
             03 Ldevremulk-p-yonkur                  pic 9(5). | proje kordinatoru yokkkmus 
             |prim dagýlýmlariii
             03 Ldevremulk-ekleyen                 pic 9(5).
             03 Ldevremulk-odeme-turu              pic 9.
             |1-pesin 2-kredi
             03 Ldevremulk-vekalet                 pic 9.
             03 Ldevremulk-vekalet-no              pic 9(5).
             03 Ldevremulk-tapu-ekleyen            pic 9(5).
             03 Ldevremulk-parsel-no               pic 9(10).
             03 Ldevremulk-hasarli                 pic 9.
             03 Ldevremulk-iptal                   pic 9.
             03 Ldevremulk-tapu                    pic 9.
             03 Ldevremulk-prim                    pic 9(12)v99.
             03 Ldevremulk-pesinat                 pic 9(12)v99.
             03 Ldevremulk-prim-kodu               pic 9(4).
             03 Ldevremulk-sabit-prim-kodu         pic 9(4).
             03 Ldevremulk-kilit                   pic 9.
             03 Ldevremulk-mail-order              pic 9.
             03 Ldevremulk-arac                    pic x(15).
             03 Ldevremulk-tapu-ver-tar.
                05 Ldevremulk-tapu-ver-yil         PIC 9999.
                05 Ldevremulk-tapu-ver-ay          PIC 99.
                05 Ldevremulk-tapu-ver-gun         PIC 99.
             03 Ldevremulk-kampanya-kodu           pic 9(4).
             03 Ldevremulk-onay                    pic 9.
             03 Ldevremulk-prim-atandi             pic 9.
             03 Ldevremulk-odenen                  pic s9(8)v99.
             03 Ldevremulk-kalan                   pic s9(8)v99.
             03 Ldevremulk-kesin-odenen            pic s9(8)v99.
             03 Ldevremulk-kesin-kalan             pic s9(8)v99.
             03 Ldevremulk-hes-prim                pic s9(8)v99.
             03 Ldevremulk-odenen-prim             pic s9(8)v99.  
             03 Ldevremulk-kalan-prim              pic s9(8)v99. 
             03 Ldevremulk-prim-yok                Pic 9.
             03 Ldevremulk-danisman-kendisi        pic 9.
             03 Ldevremulk-aidat-doviz-kodu        pic 99.
             03 Ldevremulk-aidat-tutar             pic 9(8)v99.
             03 Ldevremulk-fatura.
                05 Ldevremulk-fatura-tarihi.
                    10 Ldevremulk-fatura-yil       pic 9(4).
                    10 Ldevremulk-fatura-ay        pic 9(2).
                    10 Ldevremulk-fatura-gun       pic 9(2).
                05 Ldevremulk-fatura-saati.
                   10 Ldevremulk-fatura-saat       pic 9(2).
                   10 Ldevremulk-fatura-dakika     pic 9(2). 
                05 Ldevremulk-fatura-no            pic 9(8).  
                05 Ldevremulk-kdv-oran             pic 99.
             03 Ldevremulk-kapanan-donem           pic x(04).
             03 Ldevremulk-BOS                     PIC X(889).
             02 Ldevremulk-log-fis                 PIC 9(10).   

