*
 fd log-index label record standard.
 01 log-index-rec.
    02 log-index-anah.
       03 log-index-cal-tarih.
          04 log-index-cal-yil        pic 9(4).
          04 log-index-cal-ay         pic 9(2).
          04 log-index-cal-gun        pic 9(2).
       03 log-index-sirket            pic x(8).
       03 log-index-islem-turu        pic x.
          88 log-index-islem-write    value "W".
          88 log-index-islem-rewrite  value "R".
          88 log-index-islem-delete   value "D".
       03 log-index-islem-no          pic 9(10).
    02 log-index-kullanici            pic x(4).
    02 log-index-sys-tarih.
       03 log-index-sys-yil           pic 9(4).
       03 log-index-sys-ay            pic 9(2).
       03 log-index-sys-gun           pic 9(2).
    02 log-index-sys-zaman.
       03 log-index-sys-saat          pic 9(2). 
       03 log-index-sys-dakika        pic 9(2). 
       03 log-index-sys-saniye        pic 9(2).
    02 log-index-record-size          pic 9(5).
    02 log-index-user-id              pic x(15).
    02 log-index-station-id           pic x(15).
    02 log-index-terminal-name        pic x(15).
    02 log-index-client-machine-name  pic x(65).
    02 log-index-program-name         pic x(40).
    02 log-index-filler               pic x(60).


         

