         FD  mailhvz  LABEL RECORD IS STANDARD.
         01 mailhvz-REC.
                 02 mailhvz-ANAH.
                    03 mailhvz-gon-tarih.  
                       04 mailhvz-gon-yil       pic 9(4).
                       04 mailhvz-gon-ay        pic 9(2).
                       04 mailhvz-gon-gun       pic 9(2).
                    03 mailhvz-musteri-no       pic 9(8).
                    03 mailhvz-mailsab-anah.
                       04 mailhvz-mailsab-tip            pic x.
                       04 mailhvz-mailsab-dil            PIC x(2).
                       04 mailhvz-mailsab-ulke-kodu      pic x(3).
                       04 mailhvz-mailsab-sablon-kodu    pic x(4).
                 02 mailhvz-diger.
                    03 mailhvz-mailsab-sablon-adresi pic x(100).
                    03 mailhvz-e-mail          pic x(100).
                    03 mailhvz-musteri-adi     pic x(50).
                    03 mailhvz-musteri-soyadi  pic x(50).
                    03 mailhvz-d-tarihi.
                       04 mailhvz-d-yil        pic 9(4).
                       04 mailhvz-d-ay         pic 9(2).
                       04 mailhvz-d-gun        pic 9(2).
                    03 mailhvz-e-tarihi.
                       04 mailhvz-e-yil        pic 9(4).
                       04 mailhvz-e-ay         pic 9(2).
                       04 mailhvz-e-gun        pic 9(2).
                    03 mailhvz-tip             pic x.
                    03 mailhvz-local-sablon-adresi pic x(100).
                    03 mailhvz-konu-basligi    pic x(100).
                    03 mailhvz-anket-link.
                       04 mailhvz-link-oda-no      pic x(4).
                       04 mailhvz-link-odbc-kodu   pic 9(3).
                       04 mailhvz-link-oda-durumu  pic x.|I-inhouse H-
                       04 mailhvz-link-gir-tar.
                          05 mailhvz-gir-yil       pic 9(4).
                          05 mailhvz-gir-ay        pic 9(2).
                          05 mailhvz-gir-gun       pic 9(2).
                       04 mailhvz-link-cik-tar.
                          05 mailhvz-cik-yil       pic 9(4).
                          05 mailhvz-cik-ay        pic 9(2).
                          05 mailhvz-cik-gun       pic 9(2).
                       04 mailhvz-rez-no           pic 9(8).
                    03 mailhvz-kios-kutuphane      pic x(8).
                    03 mailhvz-kios-onb-kutuphane  pic x(8).
                    03 mailhvz-gon-mail-kodu       pic x(2).
                    03 mailhvz-sms-sablon-kodu     pic x(20).
                    03 mailhvz-telefon-no          pic x(15).
                    03 mailhvz-sms-sablon-kullanilsin pic 9.
                    03 mailhvz-bos                 pic x(214).
                 02 mailhvz-donus.
                    03 mailhvz-gonderildi      pic 9.
                    03 mailhvz-gon-zaman.
                      04 mailhvz-gon-saat      pic 9(2).
                      04 mailhvz-gon-dakika    pic 9(2).
                      04 mailhvz-gon-saniye    pic 9(2).
                    03 mailhvz-sonuc           pic x(20).
                    03 mailhvz-sms-donus-id    pic 9(10).
                    03 mailhvz-donus-bos       pic x(449).
                 02 mailhvz-staf               pic x(04).

