       FD MAIL LABEL RECORD STANDARD.
       01 MAIL-REC.
          02 MAIL-ANAH.
             03 MAIL-TARIH.
                04 MAIL-YIL          PIC 9(04).
                04 MAIL-AY           PIC 9(02).
                04 MAIL-GUN          PIC 9(02).
             03 MAIL-FOL             PIC 9(08).
             03 MAIL-ISL             PIC 9(08).
**********> mail hesap
          02 MAIL-FIS-NO             PIC 9(08).
          02 MAIL-DOV-KOD            PIC X(02).
          02 MAIL-TUT                PIC 9(15)V99.
          02 MAIL-OK                 PIC X.
          02 MAIL-ADI                PIC X(20).
          02 MAIL-SOY                PIC X(20).
          02 MAIL-ANA-SOY            PIC X(20).
**********> mail kimlik
          02 MAIL-REZ-NO             PIC X(10).
          02 MAIL-KIM                PIC X.
             88 MAIL-EHLIYET         VALUE "1".
             88 MAIL-NUFUS           VALUE "2".
          02 MAIL-KIM-NO             PIC X(16).
 
**********> mail sahsi bilgi
          02 MAIL-ADR1               PIC X(20).
          02 MAIL-ADR2               PIC X(20).
          02 MAIL-ILCE               PIC X(14).
          02 MAIL-IL                 PIC X(15).
          02 MAIL-DOG-YER            PIC X(10).
**********>
          02 MAIL-ETEL               PIC X(20).
          02 MAIL-ITEL               PIC X(20).
          02 MAIL-CTEL               PIC X(20).
          02 MAIL-PKOD               PIC X(06).
          02 MAIL-KART-TUR           PIC X.
             88 MAIL-VISA            VALUE "1".
             88 MAIL-MAST            VALUE "2".
          02 MAIL-SON-KART.
             03 MAIL-SON-YIL         PIC 9(04).
             03 MAIL-SON-AY          PIC 9(02).
             03 MAIL-SON-GUN         PIC 9(02).
          02 MAIL-KART1              PIC X(20).
          02 MAIL-KART2              PIC X(20).
          02 MAIL-KART3              PIC X(20).
          02 MAIL-KART4              PIC X(20).
 
          02 MAIL-DOG-TAR.
              03 MAIL-DOG-YIL        PIC 9(04).
              03 MAIL-DOG-AY         PIC 9(02).
              03 MAIL-DOG-GUN        PIC 9(02).
