       FD MAILDATA LABEL RECORD STANDARD.
       01 MAILDATA-REC.
          02 MAILDATA-ANAH.
             03 MAILDATA-TIP             PIC X(02).
             03 MAILDATA-ADI             PIC X(20).
             03 MAILDATA-SOYADI          PIC X(20).
             03 MAILDATA-DOG-TARIH.
                04 MAILDATA-DOG-YIL      PIC 9(04).
                04 MAILDATA-DOG-AY       PIC 9(02).
                04 MAILDATA-DOG-GUN      PIC 9(02).
             03 MAILDATA-BOS             PIC X(04).
          02 MAILDATA-GIR-TARIH.
             03 MAILDATA-GIR-YIL         PIC 9(04).
             03 MAILDATA-GIR-AY          PIC 9(02).
             03 MAILDATA-GIR-GUN         PIC 9(02).
          02 MAILDATA-CIK-TARIH.
             03 MAILDATA-CIK-YIL         PIC 9(04).
             03 MAILDATA-CIK-AY          PIC 9(02).
             03 MAILDATA-CIK-GUN         PIC 9(02).


**********> MAILDATA Kisisel Bilgiler

          02 MAILDATA-TITLE              PIC X(20).
          02 MAILDATA-ULKESI             PIC X(03).
          02 MAILDATA-DILI               PIC X(03).
          02 MAILDATA-DINI               PIC X(03).
          02 MAILDATA-VIP                PIC X(01).
          02 MAILDATA-MESLEK             PIC X(20).
          02 MAILDATA-EVL-TARIH.
             03 MAILDATA-EVL-YIL         PIC 9(04).
             03 MAILDATA-EVL-AY          PIC 9(02).
             03 MAILDATA-EVL-GUN         PIC 9(02).
          02 MAILDATA-CINSIYET           PIC X(01).
          02 MAILDATA-E-MAIL             PIC X(50).
          02 MAILDATA-TEL                PIC X(20).
          02 MAILDATA-GSM                PIC X(20).
          02 MAILDATA-FAX                PIC X(20).
          02 MAILDATA-GEL-SAYI           PIC 9(03).

**********> MAILDATA Adres Bilgileri

          02 MAILDATA-ADRES.                         
             03 MAILDATA-ADRES1          PIC X(20).
             03 MAILDATA-ADRES2          PIC X(20).
             03 MAILDATA-ADRES3          PIC X(20).
          02 MAILDATA-UNVAN1             PIC X(40).
          02 MAILDATA-UNVAN2             PIC X(40).
          02 MAILDATA-VER-DAIRE          PIC X(20).
          02 MAILDATA-VER-NO             PIC X(20).
          02 MAILDATA-IL                 PIC X(20).
          02 MAILDATA-ILCE               PIC X(20).
          02 MAILDATA-POSTA-KODU         PIC X(05).

          02 MAILDATA-ADRES-FILTRE       PIC X(02).
          02 MAILDATA-MESLEK-FILTRE      PIC X(02).

          02 MAILDATA-FILLER             PIC X(46).
          02 MAILDATA-STAF               PIC X(04).
          02 MAILDATA-ACENTA             PIC X(04).

