*
      copy "genelfis.lib".
      copy "genel.lib".
      copy "kllnc.lib".
      copy "errorlog.lib".
      copy "logindex.lib".
      copy "otlortak.lib".
      copy "odalar.lib".

