       FD MAILTIPI LABEL RECORD STANDARD.
       01 MAILTIPI-REC.
          02 MAILTIPI-ANAH.
             03 MAILTIPI-KODU            PIC X(02).
             03 MAILTIPI-ULKESI          PIC X(03).
          02 MAILTIPI-ADI                PIC X(30).
          02 MAILTIPI-GON-TARIH.
             03 MAILTIPI-GON-YIL         PIC 9(04).
             03 MAILTIPI-GON-AY          PIC 9(02).
             03 MAILTIPI-GON-GUN         PIC 9(02).

          02 MAILTIPI-KIME               PIC X(02).
          02 MAILTIPI-DILI               PIC X(03).
          02 MAILTIPI-BASLIK             PIC X(100).
          02 MAILTIPI-EKLI-DOSYA         PIC X(100).
          02 mailtipi-html-no            pic x(02).
          02 MAILTIPI-BOS                PIC X(098).

**********>Mailtipi-kime   = 01 Gönderim Tarihi Doðum günü tarihine eþit.Tarih boþ geçilecek
**********>                = 02 Gönderim Tarihi Evlilik tarihine eþit.Tarih boþ geçilecek
**********>                = 03 Gönderim Tarihi Belli bayramlar için.Tarih girilecek
**********>                = 04 Gönderim Tarihi Yil hanesi 9999 ise heryýl o günde
**********>                     Yýlbaþý ve tarihi sabit bayramlar için

**********>Mailtipi-ulkesi = Müþterinin dili bilinemediði için Ulke koduna göre dosya 
**********>                  seçilecek turk için turk-bayram.jpg   gibi
                  

