         COPY "rez.lib".
         COPY "genel.lib".
         copy "maildata.lib".
         COPY "errorlog.lib".                                                    
         COPY "genelfis.lib".                                                    
         COPY "odalar.lib".                                                    
         COPY "logindex.lib".                                                    
