*
 COPY "dokumer.lib".
 COPY "genel.lib".
 COPY "genel2.lib".
 COPY "useinbox.lib".
* COPY "kodlar02.lib".
 copy "onbkodlar10.lib".
 COPY "genelfis.lib".
 COPY "odalar.lib".
 copy "konum.lib".
*
 COPY "errorlog.lib".                                                    
 COPY "logindex.lib".  
 fd fidetext label record omitted.
   01 fidetext-rec pic x(20000).    
                                                  
