**********
 FD malzeme  LABEL RECORD STANDARD.
  01 malzeme-REC.
     02 malzeme-anah.
        03 malzeme-doviz-kodu             pic 9(02).
        03 malzeme-kodu                   pic x(03).
     02 malzeme-adi                       pic x(50).
     02 malzeme-tutar                     pic 9(6)v99.
     02 malzeme-onb-dep                   pic x(03).
     02 malzeme-hes-tipi                  pic x. 
     02 malzeme-grup-tipi                 pic x.
     02 malzeme-bos                       pic x(199).
     02 malzeme-staf                      pic x(04).

