         copy "genel.lib".
         copy "genelfis.lib".
         copy "logindex.lib".

         copy "rez.lib".
         copy "cast.lib".
         copy "odalar.lib".

         copy "kllnc.lib".
         copy "acenta.lib".
         copy "firma.lib".
         copy "malzeme.lib".
         copy "doviz.lib".
         copy "depkod.lib".

