       FD FATURA LABEL RECORD STANDARD.
       01 FATURA-REC. 
          02 FATURA-ANAH.
             03 FATURA-SERI       PIC XX. 
             03 FATURA-NO         PIC 9(08). 
             03 FATURA-SIRA       PIC 9(03).
          02 fatura-data.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=FATURA_TARIHI
          03 FATURA-TARIHI.
             05 FATURA-YIL        PIC 9999. 
             05 FATURA-AY         PIC 99. 
             05 FATURA-GUN        PIC 99. 
          03 FATURA-TIPI          PIC X.
**********Fatura-Tipi =>[F]-Folio Faturasi [A] Acenta Faturasi
          03 FATURA-DURUMU        PIC X. 
**********Fatura-Durumu =>[B]-Bos Fatura [D]-Dolu Fatura [I]-Iptal Fatura
          03 FATURA-FOLIO         PIC 9(08).
          03 FATURA-ADRES.
             05 FATURA-BASLIK-1   PIC X(40).
             05 FATURA-BASLIK-2   PIC X(30).
              05 FATURA-KV-MATRAH PIC 9(8)V99. 
             05 FATURA-ADRES-1    PIC X(40).
             05 FATURA-ADRES-2    PIC X(30).
             05 FATURA-KV         PIC 9(8)V99. 
             05 FATURA-IL         PIC X(20).
             05 FATURA-ILCE       PIC X(20).
             05 FATURA-ULKE       PIC X(20).
             05 FATURA-VER-DA     PIC X(20).
             05 FATURA-VER-NO     PIC X(20).
             05 FATURA-e-cari     PIC X(15).
             05 FATURA-GERCEK-FAT  PIC 9(9).
             05 FATURA-ADRES-BOS   PIC X.
             05 fatura-telefon    pic x(15).
          03 fatura-aciklama      PIC X(80).
          03 FATURA-MATRAH-1      PIC 9(8)V99. 
          03 FATURA-KDV-1         PIC 9(8)V99. 
          03 fatura-e-mail        pic x(50).
          03 FATURA-ACENTA        PIC XXXX. 
          03 FATURA-TOPLAM        PIC 9(15)V99. 
          03 FATURA-INDIRIM       PIC x(2).
          03 fatura-gercek-kimlik-no pic x(15).
          03 FATURA-MATRAH        PIC 9(15)V99. 
          03 FATURA-KDV           PIC 9(15)V99. 
          03 FATURA-G-TOPLAM      PIC 9(15)V99.
          03 FATURA-MATRAH-18      PIC 9(8)V99. 
          03 FATURA-KDV-18         PIC 9(8)V99. 
          03 FATURA-MATRAH-8      PIC 9(8)V99. 
          03 FATURA-KDV-8         PIC 9(8)V99.
          03 fatura-E-tipi          pic x. |E-Elektronik Fat. O-Onayli Elek 
          03 FATURA-onek          PIC X(07).
          03 fatura-no-alindi    pic 9.
          03 FATURA-BOS           PIC X(01). 
          03 FATURA-STAF          PIC X(04). 
