        COPY "menutext.lib".
      $XFD FILE=PROSIF
        COPY "prosif.lib".
        COPY "genel.lib".
        COPY "kllnc.lib".
        COPY "isyeri.lib".
      $XFD FILE=AJANDA
        COPY "ajanda.lib".
        COPY "errorlog.lib".


        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".                                                    
