         COPY "genel.lib".
         COPY "genelfis.lib".
         COPY "prosif.lib".
         COPY "kllnc.lib".

         COPY "errorlog.lib".                                                    
         COPY "logindex.lib".                                                    
