FD merkod LABEL RECORD STANDARD.
01 merkod-rec.
    02 merkod-anah.
       03 merkod-tipi                       pic x(02).
       03 merkod-kodu                       pic x(15).

       03 merkod-departman-anah redefines merkod-kodu.
          04 merkod-dep-anah-kodu           pic 9(03).
          04 merkod-dep-anah-sirket         pic x(08).

       03 merkod-acenta-anah    redefines merkod-kodu.
          04 merkod-ace-anah-kodu           pic x(04).
          04 merkod-ace-anah-sirket         pic x(08).
          04 merkod-ace-anah-sira           pic x(02).

       03 merkod-sirket-anah    redefines merkod-kodu.
          04 merkod-sir-anah-sira           pic 9(02).
          04 merkod-sir-anah-kodu           pic x(08).

       03 merkod-operator-anah  redefines merkod-kodu.
          04 merkod-ope-anah-kodu           pic x(15).

       03 merkod-konum-anah     redefines merkod-kodu.
          04 merkod-kon-anah-kodu           pic x(15).

    02 merkod-diger.
       03 merkod-diger-bos                  pic x(1500).

       03 merkod-departman-diger redefines merkod-diger-bos.
          04 merkod-dep-dig-kodu            pic 9(03).
          04 merkod-dep-dig-adi             pic x(50).

       03 merkod-acenta-diger    redefines merkod-diger-bos.
          04 merkod-ace-dig-kodu            pic x(04).
          04 merkod-ace-dig-adi             pic x(50).

       03 merkod-sirket-diger    redefines merkod-diger-bos.
          04 merkod-sir-dig-adi             pic x(50).
          04 merkod-sir-dig-ip              pic x(15).
          04 merkod-sir-dig-local           pic 9(01).

       03 merkod-operator-diger  redefines merkod-diger-bos.
          04 merkod-ope-dig-kodu            pic x(04).
          04 merkod-ope-dig-adi             pic x(50).

       03 merkod-konum-diger     redefines merkod-diger-bos.
          04 merkod-kon-dig-kodu            pic 9(02).
          04 merkod-kon-dig-adi             pic x(50).


*/  Aciklamalar;
*/  merkod-tipi -> AC = Acenta Kodu
*/  merkod-tipi -> SK = Sirket Kütüphanesi
*/  merkod-tipi -> DK = Departman Kodu

