FD  MERKEZ LABEL RECORD IS STANDARD.
 01 MERKEZ-REC.
     02 MERKEZ-ANAH.
        03 MERKEZ-TIPI   PIC X(5).
        03 MERKEZ-KODU   PIC X(50).
        03 MERKEZ-BOS    PIC X(100).
     02 MERKEZ-DATA.
        03 MERKEZ-ADI  PIC X(100).
        03 MERKEZ-BOS  PIC X(2000).
        03 MERKEZ-STAF PIC X(4).

*\Aciklamalar...
*\Merkez-tipi = A ------------- Acenta 
*\Merkez-tipi = D ------------- Departman 
