       fd mgenelfis label record standard.
       01 mgenelfis-rec.
          02 mgenelfis-anahtar     pic 9.
          02 mahsup-oto           pic 9(06).
          02 mcek-oto              pic 9(10).
          02 mprint-no             pic 9(04).
          02 mekran-fis-1          pic 9(04).
          02 fihrist-oto          pic 9(10).
          02 mgenelfis-log-no      pic 9(10).
          02 mgenelfis-dekont-no   pic 9(6).
          02 mgenelfis-talimat-no  pic 9(6).
          02 mgenelfis-bos         pic x(028).
          02 mgenelfis-staf        pic x(04).

