*
fd debug label record standard.
01 debug-rec   pic x(200).
*
fd al label record standard.
01 al-rec   pic x(200).
*
fd ver label record standard.
01 ver-rec   pic x(200).
*
fd yastik label record standard.
01 yastik-rec .
    05 yastik-anah pic x(50).
    05 yastik-gerisi pic x(150).

    
    copy "errorlog.lib".                                                    
    copy "logindex.lib". 
    copy "onbkodlar10.lib".
        
                   
