       fd miracfg label record standard.
       01 mira-cfg-rec.
          02 mira-cfg-anah. 
            03 mira-cfg-ID        pic 99.
            03 mira-cfg-bos       pic x(30).
          02 mira-cfg-isim        pic x(20).
          02 mira-cfg-sirket      pic x(8).
          02 mira-cfg-prof-oku    pic 9.
          02 mira-cfg-dosya-adres pic x(50).
          02 mira-cfg-ayrac       pic x.
          02 mira-cfg-tur         pic 9.
          02 mira-uyruk-filtre     pic 9.
          02 mira-uyruk-kodu       pic x(3).
          02 mira-uyruk-kodu-not   pic 9.
          02 mira-houseuse-haric  pic 9.
          02 mira-referans-kodu   pic 9.
          02 mira-hayali-haric    pic 9.
          02 mira-cfg-alan-bos    pic x(190).

       fd miralist label record standard.
       01 mira-list-rec.
         02 mira-list-anah.
          05 mira-list-ID            pic 99.
          05 mira-list-kayit-sira    pic 99.
         02 mira-list-alan-adi       pic x(20).
