       FD MIS LABEL RECORD STANDARD.
       01 MIS-REC.
          02 MIS-ANAH.
             03 MIS-NO             PIC 9(08).
          
          02 MIS-KIMLIK.
             03 MIS-ADI               PIC X(20).
             03 MIS-SOYADI            PIC X(20).
             03 polisxml-tckimlikno      pic 9(11).
          03 polisxml-babaadi         pic x(20).
          03 polisxml-anaadi          pic x(20).
          03 polisxml-dyeri           pic x(40).
          03 polisxml-dog-tar.
             04 polisxml-dog-YIL     PIC 9999.
             04 polisxml-dog-AY      PIC 99.
             04 polisxml-dog-GUN     PIC 99.
          03 polisxml-kturu          pic x.
          03 polisxml-kseri          pic x(20).
          03 polisxml-nil            pic x(20).
          03 polisxml-nilce          pic x(20).
          03 polisxml-nmahalle       pic x(20).
          03 polisxml-ncilt          pic x(15).
          03 polisxml-naile          pic x(15).
          03 polisxml-nsira          pic x(15).
          03 polisxml-cinsiyet       pic x.
          03 polisxml-medeni         pic x.
          03 polisxml-isi            pic x(20).
          03 polisxml-adr            pic x(100).
          03 polisxml-plaka          pic x(20).
          03    

          02 REZ-STAF              PIC X(04).
