*
fd debug label record standard.
01 debug-rec   pic x(200).
*
fd al label record standard.
01 al-rec   pic x(200).
*
fd ver label record standard.
01 ver-rec   pic x(200).

    
    copy "errorlog.lib".                                                    
    copy "logindex.lib".  
        
                   
