         COPY "errorlog.lib".                                                    
         COPY "logindex.lib". 
         COPY "odalar.lib". 

          COPY "genel.lib".
          COPY "genelfis.lib".
          copy "dokumer.lib".
          copy "musteri.lib". 
