*
      copy "genel.lib".
      copy "genelfis.lib".
      copy "errorlog.lib".
      copy "logindex.lib".
      copy "mutamdok.lib".
      copy "odalar.lib".
      copy "isyeri.lib".
      copy "kllnc.lib".

*
 fd yazici label record omitted.
 01 yazici-rec          pic x.

