*
 fd mutamdok label record standard.
 01 mutamdok-rec.
    02 mutamdok-anah.
       03 mutamdok-tipi                 pic x(3).
          88 mutamdok-mutabakat value "001".
       03 mutamdok-kodu                 pic x(20).
       03 mutamdok-sira                 pic 9(4).
       03 mutamdok-kaynak               pic x(100).
    02 mutamdok-hedef                   pic x(100).
    02 filler                           pic x(200).

