*
 FD NT LABEL RECORD STANDARD.
 01 NOT-REC.
      03 filler.
          05 NOT-ANAH.
             07 NOT-DOS           PIC XXX.
             07 NOT-DOS-ANAH      PIC X(30).
             07 NOT-SIRA          pic 99. 
       03 not-gerisi.      
          05 NOT-BUYUK     .
            06 NOT1     PIC X(500) .
            06 NOT2.   
              07 NOT-Giris-BILGI.
               09 NOT-Giris-TARIH.
                 11 NOT-Giris-YIL        PIC 9999.
                 11 NOT-Giris-AY         PIC 99.
                 11 NOT-Giris-GUN        PIC 99.
               09 NOT-Giris-ZAMAN.
                 11 NOT-Giris-SAAT       PIC 99.
                 11 NOT-Giris-DAKIKA     PIC 99.
                 11 NOT-Giris-SANIYE     PIC 99.
               09 NOT-Giris-STAF         PIC X(04). 
             07 NOT-ILK-OKU-BILGI.
               09 NOT-ILK-OKU-TARIH.
                 11 NOT-ILK-OKU-YIL      PIC 9999.
                 11 NOT-ILK-OKU-AY       PIC 99.
                 11 NOT-ILK-OKU-GUN      PIC 99.
               09 NOT-ILK-OKU-ZAMAN.
                 11 NOT-ILK-OKU-SAAT     PIC 99.
                 11 NOT-ILK-OKU-DAKIKA   PIC 99.
                 11 NOT-ILK-OKU-SANIYE   PIC 99.
               09 NOT-ILK-OKU-STAF       PIC X(04). 
             07 NOT-son-OKU-BILGI.
               09 NOT-son-OKU-TARIH.
                 11 NOT-son-OKU-YIL      PIC 9999.
                 11 NOT-son-OKU-AY       PIC 99.
                 11 NOT-son-OKU-GUN      PIC 99.
               09 NOT-son-OKU-ZAMAN.
                 11 NOT-son-OKU-SAAT     PIC 99.
                 11 NOT-son-OKU-DAKIKA   PIC 99.
                 11 NOT-son-OKU-SANIYE   PIC 99.
               09 NOT-son-OKU-STAF       PIC X(04). 
          05 NOT-TIP              PIC X.  
          05 NOT-ALT-TIP          PIC 9.
          05 NOT-OKUNDU           PIC 9.
          05 NOT-GOSTERME         PIC 9.
          05 NOT-SIL              PIC 9.
          05 NOT-NEREDE.
             07 NOT-REZ           PIC 9.
             07 NOT-REGISTER      PIC 9.
             07 NOT-RACKDE        PIC 9.
             07 NOT-BLOKAJ        PIC 9.
             07 NOT-CEKR          PIC 9.
             07 NOT-CEKE          PIC 9.
             07 NOT-COUTr          PIC 9.
             07 NOT-COUTe          PIC 9.
             07 NOT-CIN           PIC 9.
             07 NOT-RFOLIO        PIC 9.
             07 NOT-EFOLIO        PIC 9.
             07 not-pos           pic 9.
             07 NOT-profil        PIC 9.
             07 NOT-devremulk     pic 9.

          05 not-takip-tar.
            10 not-takip-yil      pic 9(4).
            10 not-takip-ay       pic 9(2).
            10 not-takip-gun      pic 9(2).
          05 not-ilk-okuyan-staf  pic x(4).
          05 not-ilk-okuyan-tarih.
             10 not-ilk-okuyan-yil pic 9(4).
             10 not-ilk-okuyan-ay  pic 9(2).
             10 not-ilk-okuyan-gun pic 9(2).
          05 not-ilk-okuyan-zaman.
             10 not-ilk-okuyan-saat   pic 9(2).
             10 not-ilk-okuyan-dakika pic 9(2).
             10 not-ilk-okuyan-saniye pic 9(2).
          05 NOT-bos             PIC X(73).
          

*********>             A C I K L A M A L A R      *******************
*********>  NOT-DOSYA ONCE DOSYA ADI -REZ--REZ
*****                                     -KON--KONUK
*****                                     -RHR--ROMHRK
*****                                     -EXT--EXTHRK
*****                                     -FAN--FIYATANA
*****                                     -STF--STAF DA ILK GIRISDE
*****                                     -CTR--CEKTR ACIKLAMA
*****       NOT-TIP ---M-MESAJ
*****                  N-NOT
*****                  A-ACIKLAMA
*****                  S-Silinmis
*****       NOT-ALT-TIP--- 

