        COPY "genel.lib".
        COPY "ajanda.lib".
        COPY "takvim.lib".
        COPY "kllnc.lib".
        COPY "errorlog.lib".

        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".                                                    
