*
 fd odalate label record standard.
 01 odalate-rec.
    02 odalate-anah.  | x(90)
       03 odalate-tar.
          04 odalate-yil       pic 9999.
          04 odalate-ay        pic 99.
          04 odalate-gun       pic 99.
       03 odalate-rez          pic 9(8).
       03 odalate-oda          pic x(4).
       03 odalate-nereden      pic x.           
       03 odalate-anah-bos     pic x(50).
    02 odalate-diger.  | x(1025).
       03 odalate-zaman.
          04 odalate-saat      pic 99.
          04 odalate-dakika    pic 99.
       03 odalate-aciklama     pic x(300).
       03 odalate-bos          pic x(1000).
* Odalate-Nereden H-HouseKeeeping O-Onburo
