*
 FD ODALAR LABEL RECORD STANDARD.
 01 ODALAR-REC.
    02 ODALAR-ANAH.
       03 ODALAR-NO       PIC XXXX.
    02 ODALAR-DURUMU      PIC XX.
    02 ODALAR-KONUMU      PIC 99.
    02 ODALAR-KAPASITE    PIC 99.
    02 ODALAR-HOUSE.
       03 HOUSE-DURUMU    PIC XX.
       03 HOUSE-BUYUK     PIC 99.
       03 HOUSE-KUCUK     PIC 99.
       03 HOUSE-BEBEK     PIC 9.
       03 HOUSE-FREE      PIC 9.
       03 HOUSE-STAF      PIC X(04).
       03 HOUSE-ACIKLAMA  PIC X(20).
       03 house-ok-rezno   pic 9(8).
       03 HOUSE-BOS       PIC X(2).
    02 ODALAR-HAYALI      PIC X.
    02 ODALAR-KAT         PIC XX.
    02 ODALAR-TIPI        PIC XX.
    02 ODALAR-PAZAR       PIC XX.
    02 ODALAR-TIPI2       PIC XX.
    02 ODALAR-TIPI3       PIC XX.
    02 ODALAR-MAID        PIC X(4).
    02 ODALAR-DEF-MAID    PIC X(4).
    02 ODALAR-aciklama1    PIC X(15).
    02 odalar-aciklama2.
       03 odalar-aciklama2-1 pic x(6).
       03 odalar-odatemiz    pic x.
       03 odalar-aktif-pasif pic 9.
       03 odalar-uzun-no     pic x(6).
    02 odalar-noshow       pic 9.
    02 odalar-teknik-servis pic x.
    02 odalar-referans    pic 9.
    02 ODALAR-HAYAL2      PIC 9.
    02 ODALAR-DEVRE       pic x.
    02 odalar-dis         pic 9.
    02 odalar-kredi       pic 9.
    02 ODALAR-STAF        PIC X(04).
*
 FD odalar2 LABEL RECORD STANDARD.
 01 odalar2-REC.
    02 odalar2-ANAH.
       03 odalar2-uzun-no  pic x(6).
    02 odalar2-NO       PIC XXXX.

