         copy "genel.lib".
         copy "genelfis.lib".
         copy "odalar.lib".
         copy "kodlar02.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".
        copy "kllnc.lib".                                            
