       FD odemesil LABEL RECORD STANDARD.
        01 odemesil-rec.
          02 odemesil-anah.
             03 odemesil-tarih.
                05 odemesil-tarih-yil                  pic 9999.
                05 odemesil-tarih-ay                   pic 99.
                05 odemesil-tarih-gun                  pic 99.
             03 odemesil-islem-no                      pic 9(08).
             03 odemesil-dev-no                        pic 9(08).
          02 odemesil-data.
             03 odemesil-hareket-turu                  pic x. |GELIR
             03 odemesil-islem-turu                    pic xx.|SATIS ODEMESI 
             03 odemesil-tutar                         pic s9(12)v99.
             03 odemesil-odeme-turu                    pic xx.|nakit kk cek
             03 odemesil-cekno                         pic X(15).
             03 odemesil-cek-isl-no                    pic 9(10).
             03 odemesil-staf                          pic x(4).
             03 odemesil-doviz-tutar                   pic s9(06)v99.
             03 odemesil-doviz-kodu                    pic 99.
             03 odemesil-hrk.
                04 odemesil-hrk-yil                    pic 9999.
                04 odemesil-hrk-ay                     pic 99.
                04 odemesil-hrk-gun                    pic 99.
             03 odemesil-bos                           pic x(82).


                                                                       
         
