       FD odemetip LABEL RECORD STANDARD.
        01 odemetip-rec.
          02 odemetip-anah.
             03 odemetip-kodu                    pic x(02). 
             03 odemetip-anah-bos                pic x(20).
          02 odemetip-adi                        pic x(20).
          02 odemetip-bos                        pic x(200).
          02 odemetip-staf                       pic x(4).



                                                                       
         
