          COPY "kodlar02.lib".
          COPY "genel.lib".
          COPY "odalar.lib".

        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".  
        copy "odemetip.lib".                                          
