       FD ODEMELER LABEL RECORD STANDARD.
        01 odemeler-rec.
          02 odemeler-anah.
             03 odemeler-devremulk-no                     pic 9(08).
             03 odemeler-sira                             pic 9(3).
             03 odemeler-anah-bos                         pic x(20).
          02 odemeler-data.
             03 odemeler-tarih.
                05 odemeler-tarih-yil                     pic 9999.
                05 odemeler-tarih-ay                      pic 99.
                05 odemeler-tarih-gun                     pic 99.
             03 odemeler-hareket-turu                     pic x. |GELIR
             03 odemeler-prim-staf                        pic x(4). |GELIR
             03 odemeler-islem-turu                       pic xx.|SATIS ODEMESI 
             03 odemeler-tutar                            pic s9(12)v99.
             03 odemeler-tutar-dv                         pic s9(12)v99.
             03 odemeler-odeme-turu                       pic xx.|nakit kk cek
             03 odemeler-islem-id                         pic 9.|odemeler - peþinat
             03 odemeler-islem-durumu                     pic 9.
             03 odemeler-evrak-no                         pic 9(8).
             03 odemeler-kocan-no                         pic 9(8).
             03 odemeler-banka-kodu                       pic x(2).
             03 odemeler-tapu                             pic 9.
             03 odemeler-cekno                            pic X(15).
             03 odemeler-kuserid                          pic x(4).
             03 odemeler-cek-isl-no                       pic 9(10).
             03 odemeler-danisman-kodu                    pic 9(5).
             03 odemeler-limit                            pic 9(8)v99. 
             |||prim hrkdeki prim siniri burada      
             03 odemeler-AG-primden-dus                   pic 9.
             ||girilen avans odemesini prim odeme esnasinda dusecek
             03 odemeler-prim-isl-no                      pic 9(10).
             ||yapilan prim odemeler listesi icin anahtar
             03 odemeler-doviz-kodu                       pic 99.
             03 odemeler-doviz-tahsilati                  pic 9.
             03 odemeler-fatura-kesildi                   pic 9.
             03 odemeler-fatura-no                        pic 9(8).
             03 odemeler-donem-yili                       pic 9(04).
             03 odemeler-d-odeme-turu                     pic x(02).
             03 odemeler-bos                              pic x(046).
             03 odemeler-staf                             pic x(4).

                                                                       
         
