*

 COPY "odenmez.lib" in "..\..\cost\lib-sel".
 COPY "genel.lib".
 COPY "errorlog.lib" in "..\..\cost\lib-sel".

*
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib". 
        COPY "odalar.lib".                                                                                                                                                
