*
 copy "genel.lib".
 copy "odenmez.lib" in "..\..\cost\lib-sel".
 copy "errorlog.lib" in "..\..\cost\lib-sel".
*
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib". 
        COPY "odalar.lib".                                                                                                                                                
