***************************       
FD olayhrk LABEL RECORD STANDARD.
01 olayhrk-REC.
          02 olayhrk-ANAH.
             03 olayhrk-tarih.
                05 olayhrk-yil  pic 9(4).
                05 olayhrk-ay   pic 9(2).
                05 olayhrk-gun  pic 9(2).
             03 olayhrk-id         pic 9(9).
          02 olayhrk-data.
              05 olayhrk-adi       pic x(50).
              05 olayhrk-bos       pic x(100).


