*
 COPY "dokumer.lib".
 COPY "genel.lib".
* COPY "kodlar02.lib".
 
 COPY "genelfis.lib".
 copy "olay.lib".
 copy "odalar.lib".
 copy "olayhrk.lib".
*
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".
        copy "takvim.lib".                                            
