***************************       
FD olay LABEL RECORD STANDARD.
01 olay-REC.
          02 olay-ANAH.
             05 olay-id       PIC 9(9).
             05 olay-anah-bos   pic x(20).
          02 olay-data.
              05 olay-adi         pic x(50).
              05 olay-ILK-TARIH.
                 06 olay-ILK-YIL PIC 9999.
                 06 olay-ILK-AY  PIC 99.
                 06 olay-ILK-GUN PIC 99.
              05 olay-SON-TARIH.
                 06 olay-SON-YIL PIC 9999.
                 06 olay-SON-AY  PIC 99.
                 06 olay-SON-GUN PIC 99.
              05 olay-aciklama    pic x(300).
              05 olay-bos         pic x(500).
          02 olay-STAF          PIC X(04).


