*
         COPY "genel.lib".
         COPY "genelfis.lib".
         COPY "onavans.lib".
         copy "doviz.lib".
        
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib". 
        COPY "odalar.lib".                                                                                                                                                
