       FD ONAVANS LABEL RECORD  STANDARD.
       01 ONAVANS-REC.
          02 ONAVANS-ANAH.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=ONAVANS-TARIH
             03 ONAVANS-TARIH.
                04 ONAVANS-YIL  PIC 9999.
                04 ONAVANS-AY   PIC 99.
                04 ONAVANS-GUN  PIC 99.
             03 ONAVANS-REF     PIC X.
             03 ONAVANS-KIM     PIC X(04).
          02 ONAVANS-AVANS-TL   PIC 9(15)V99.
          02 ONAVANS-AVANS-DV   PIC 9(02).
          02 onavans-doviz-kodu-1 pic 9(2).
          02 onavans-doviz-1    pic 9(5)v99.
          02 ONAVANS-GELIR-TL   PIC 9(15)V99.
          02 ONAVANS-GELIR-DV   PIC 9(02).
          02 onavans-doviz-kodu-2 pic 9(2).
          02 onavans-doviz-2    pic 9(5)v99.
          02 ONAVANS-GIDER-TL   PIC 9(15)V99.
          02 ONAVANS-GIDER-DV   PIC 9(02).
          02 onavans-doviz-kodu-3 pic 9(2).
          02 onavans-doviz-3    pic 9(5)v99.
          02 ONAVANS-BOS        PIC X(10).
          02 ONAVANS-STAF       PIC X(04).
