          COPY "genelfis.lib".
         COPY "genel.lib".
        
         COPY "errorlog.lib".      
         COPY "logindex.lib".
         copy "odalar.lib".
         
         copy "onay.lib".

         copy "kllnc.lib".
        
