*
 FD ONAY LABEL RECORD IS STANDARD.
 01 ONAY-REC.
    02 ONAY-ID        .
          03 ONAY-TIPI     PIC X(9).
                88 REZ-TARIH-ONAY    VALUE "REZ-TARIH".
                88 CORR-ONAY         VALUE "COR-TARIH".
                88 CL-ONAY           VALUE "CL-ONAY  ".
                88 DEVRE-ONAY        VALUE "DEVRE    ".
                88 AIDSIL-ONAY       VALUE "AID-ONAY ".   
                88 TAHSIL-ONAY       VALUE "AID-ONAY ".
                88 CIN-ONAY          VALUE "CIN-ONAY ".
            03 ONAY-ANAHTAR        PIC  X(20).
            03 ONAY-VERI-eski          pic X(50).
            03 ONAY-VERI-yeni          PIC  X(50).

    02 ONAY-IST-STAF       PIC X(4).
    02 ONAY-IST-TZ.
*(( XFD DATE=YYYYMMDD, USE GROUP ))
$XFD NAME=ONAY_IST_TARIH
          03 ONAY-IST-TARIH      PIC X(08).
          03 ONAY-IST-ZAMAN      PIC x(06).
    02 ONAY-TEXT    PIC X(500).
    02 ONAY-DURUMU PIC 9.
         88 ONAY-BEKLER    VALUE 0.
         88 ONAY-VERILDI   VALUE 1.
         88 ONAY-IPTAL     VALUE 2.
         88 onay-uygulandi  value 3.
    02 ONAY-VER-STAF       PIC X(4).
    02 ONAY-ver-TZ.
*(( XFD DATE=YYYYMMDD, USE GROUP ))
$XFD NAME=ONAY_VER_TARIH
            03 ONAY-VER-TARIH      PIC x(08).
            03 ONAY-VER-ZAMAN      PIC x(06).

    02 ONAY-uyg-STAF       PIC X(4).
    02 ONAY-uyg-TZ.
    03 ONAY-uyg-TARIH      PIC x(08).
    03 ONAY-uyg-ZAMAN      PIC x(06).

  
*      

