       FD ONBKUR LABEL RECORD STANDARD.
       01 ONBKUR-REC.
          02 ONBKUR-KODU.
             03 ONBKUR-TARIH.
                04 ONBKUR-YIL    PIC 9(4).
                04 ONBKUR-AY     PIC 9(2).
                04 ONBKUR-GUN    PIC 9(2).
             03 ONBKUR-BANKA-ID     PIC 9(5).
             03 ONBKUR-DOVIZ-ID     PIC 9(5).
          02 onbDOVIZ-ALIS       PIC 9(9)V9(05).
          02 onbDOVIZ-SATIS      PIC 9(9)V9(05).
          02 onbEFEKTIF-ALIS     PIC 9(9)V9(05).
          02 onbEFEKTIF-SATIS    PIC 9(9)V9(05).
          02 onbPARITE           PIC 9(6)V9(05).
          02 onbkur-bos          pic x(300).
          02 onbDOVIZ-STAF       PIC X(04).
