*
  fd onbkodlar10 label record standard.
  01 onbkodlar10-rec.
      02 onbkodlar10-anahtar.
         03 onbkodlar10-tipi        pic xx.
            88 onbkodlar10-tipi-routegrup        value "AA".
            88 onbkodlar10-tipi-kaynak-1         value "AB".
            88 onbkodlar10-tipi-kaynak-2         value "AC".
            88 onbkodlar10-tipi-kaynak-3         value "AD".
            88 onbkodlar10-tipi-upgrade-mail     value "MM".
            88 onbkodlar10-tipi-entegrasyon      value "EE".
            88 onbkodlar10-tipi-satis-mail       value "MA".
            88 onbkodlar10-tipi-satis-otel       value "OT".
         03 onbkodlar10-tarih.
            04 onbkodlar10-yil      pic 9(4).
            04 onbkodlar10-ay       pic 9(2).
            04 onbkodlar10-gun      pic 9(2).
         03 onbkodlar10-fis         pic 9(10).
         03 onbkodlar10-sira        pic 9(10).
         03 onbkodlar10-sayisal     pic 9(10).
         03 onbkodlar10-kodu1       pic x(15).
         03 onbkodlar10-kodu2       pic x(15).
         03 onbkodlar10-kodu3       pic x(15).
         03 filler                  pic x(10).
      02 onbkodlar10-adi            pic x(50).
      02 onbkodlar10-aciklama-1     pic x(50).
      02 onbkodlar10-aciklama-2     pic x(50).
      02 onbkodlar10-filler         pic x(750).
      02 onbkodlar10-entegrasyonlar redefines onbkodlar10-filler.
         03 onbkodlar10-pms-tarih.
            04 onbkodlar10-pms-yil      pic 9(4).
            04 onbkodlar10-pms-ay       pic 9(2).
            04 onbkodlar10-pms-gun      pic 9(2).
         03 onbkodlar10-pms-zaman.
            04 onbkodlar10-pms-saat     pic 9(2).
            04 onbkodlar10-pms-dakika   pic 9(2).
            04 onbkodlar10-pms-saniye   pic 9(2).
         03 filler                      pic x(32).

         03 onbkodlar10-santral-tarih.
            04 onbkodlar10-santral-yil      pic 9(4).
            04 onbkodlar10-santral-ay       pic 9(2).
            04 onbkodlar10-santral-gun      pic 9(2).
         03 onbkodlar10-santral-zaman.
            04 onbkodlar10-santral-saat     pic 9(2).
            04 onbkodlar10-santral-dakika   pic 9(2).
            04 onbkodlar10-santral-saniye   pic 9(2).
         03 filler                      pic x(18).
         03 onbkodlar10-santral2-tarih.
            04 onbkodlar10-santral2-yil      pic 9(4).
            04 onbkodlar10-santral2-ay       pic 9(2).
            04 onbkodlar10-santral2-gun      pic 9(2).
         03 onbkodlar10-santral2-zaman.
            04 onbkodlar10-santral2-saat     pic 9(2).
            04 onbkodlar10-santral2-dakika   pic 9(2).
            04 onbkodlar10-santral2-saniye   pic 9(2).         
         03 onbkodlar10-lapis-tarih.
            04 onbkodlar10-lapis-yil      pic 9(4).
            04 onbkodlar10-lapis-ay       pic 9(2).
            04 onbkodlar10-lapis-gun      pic 9(2).
         03 onbkodlar10-lapis-zaman.
            04 onbkodlar10-lapis-saat     pic 9(2).
            04 onbkodlar10-lapis-dakika   pic 9(2).
            04 onbkodlar10-lapis-saniye   pic 9(2).
         03 onbkodlar10-upgrade-mail-gitsin pic 9.
         03 onbkodlar10-satinalma-mail-gitsin pic 9.
         03 onbkodlar10-renk-kodu             pic 999.
         03 onbkodlar10-teklif-mail-gitsin    pic 9.
         03 onbkodlar10-acenta-odeme-maili    pic 9.
         03 onbkodlar10-duzeltme-onay-mail    pic 9.
         03 filler                      pic x(25).
***********************************************************************
*********** Tipler
*********** AA- Route Grup Bilgileri
**********      onbkodlar10-kodu1 -> route grup kodu
**********      onbkodlar10-kodu2 -> route -departmaný
*********** AB- Kaynak 1
**********      onbkodlar10-kodu1 -> kaynak kodu 
*********** AC- Kaynak 2
**********      onbkodlar10-kodu1 -> kaynak kodu 
*********** AD- Kaynak 3
**********      onbkodlar10-kodu1 -> kaynak kodu 
************MM
************MA
***********************************************************

                          
