       FD ONBREZ LABEL RECORD STANDARD.
       01 ONBREZ-REC.
          02 ONBREZ-ID                        PIC 9(12).
          02 ONBREZ-ANAH.
             03 ONBREZ-NO                     PIC 9(08). 
          02 ONBREZ-GENEL-BILGILER.              
             03 ONBREZ-AYRAC                  pic x.|rEZ EXTRAFOLÝO    GRUP
             03 ONBREZ-ODA-SAYISI             PIC 9(8) .  
             03 ONBREZ-TIPI                   PIC 9.
             03 ONBREZ-DURUMU                 PIC X.
             03 ONBREZ-ACENTA-ID              PIC 9(12).
             03 ONBREZ-GIR-TAR.
                04 ONBREZ-GIR-YIL             PIC 9999.
                04 ONBREZ-GIR-AY              PIC 99.
                04 ONBREZ-GIR-GUN             PIC 99.
             03 ONBREZ-VOUCHER-GIR-TAR.
                04 ONBREZ-VOUCHER-GIR-YIL     PIC 9999.
                04 ONBREZ-VOUCHER-GIR-AY      PIC 99.
                04 ONBREZ-VOUCHER-GIR-GUN     PIC 99.    
             03 ONBREZ-CIK-TAR.
                04 ONBREZ-CIK-YIL             PIC 9999.
                04 ONBREZ-CIK-AY              PIC 99.
                04 ONBREZ-CIK-GUN             PIC 99.
             03 ONBREZ-VOUCHER-CIK-TAR.
                04 ONBREZ-VOUCHER-CIK-YIL     PIC 9999.
                04 ONBREZ-VOUCHER-CIK-AY      PIC 99.
                04 ONBREZ-VOUCHER-CIK-GUN     PIC 99.          
          03 ONBREZ-ADI                       PIC X(20).
          03 ONBREZ-SOYADI                    PIC X(20).
          03 ONBREZ-BANKA-ID                  PIC 99.
          03 ONBREZ-DOVIZ-ID                  PIC 99.
          03 ONBREZ-ANLASMA-ID                PIC XX.
          03 ONBREZ-ODEME-TIPI-ID             PIC XX.
          03 ONBREZ-PAN-ID                    PIC XX.
          03 ONBREZ-ULKE-ID                   PIC X(03).
          03 ONBREZ-VOUCHER                   PIC X(30).
          03 ONBREZ-KUR-TAR.
             04 ONBREZ-KUR-YIL                PIC 9(4).
             04 ONBREZ-KUR-AY                 PIC 9(2).
             04 ONBREZ-KUR-GUN                PIC 9(2).
          03 ONBREZ-K-G-B                     PIC X.
          03 ONBREZ-VIP-ID                    PIC 9(12).
          03 ONBREZ-KOMISYON                  PIC 99.
          03 ONBREZ-NOR-INDIRIM               PIC 999V99.
          03 ONBREZ-C-IN                      PIC X.
          03 ONBREZ-FOLIO                     PIC 9(08).
          03 ONBREZ-BAGLI-REZ                 PIC 9(08).
          03 ONBREZ-ODA-ID                    PIC 9(12).
          03 ONBREZ-ODA-KONUMU-ID             PIC 99.
          03 ONBREZ-KISI.
             04 ONBREZ-BUYUK          PIC 9(02).
             04 ONBREZ-KUCUK          PIC 9(02).
             04 ONBREZ-BEBEK          PIC 9(01).
             04 ONBREZ-FREE           PIC 9(01).
          03 ONBREZ-FIYATI            PIC s9(12)V99 . 
          03 ONBrez-tl-fiyati         pic s9(12)v99.
          03 ONBREZ-ISL-TAR.
             04 ONBREZ-ISL-YIL        PIC 9999.
             04 ONBREZ-ISL-AY         PIC 99.
             04 ONBREZ-ISL-GUN        PIC 99.
          03 ONBREZ-AL-TAR.
             04 ONBREZ-AL-YIL         PIC 9999.
             04 ONBREZ-AL-AY          PIC 99.
             04 ONBREZ-AL-GUN         PIC 99.
          03 ONREZ-OPS-TAR.
             04 ONBREZ-OPS-YIL        PIC 9999.
             04 ONBREZ-OPS-AY         PIC 99.
             04 ONBREZ-OPS-GUN        PIC 99.
          03 ONBREZ-GEL-ZAMAN.
             04 ONBREZ-GEL-SAAT       PIC 99.
             04 ONBREZ-GEL-DAK        PIC 99.
          03 ONBREZ-GIT-ZAMAN.
             04 ONBREZ-GIT-SAAT       PIC 99.
             04 ONBREZ-GIT-DAK        PIC 99.
          03 ONBREZ-GER-GEL-ZAMAN.
             04 ONBREZ-GEL-SAAT       PIC 99.
             04 ONBREZ-GEL-DAK        PIC 99.
          03 ONBREZ-GER-GIT-ZAMAN.
             04 ONBREZ-GIT-SAAT       PIC 99.
             04 ONBREZ-GIT-DAK        PIC 99.          
          03 ONBREZ-GRUP-NO-ID        PIC 9(12).                          
          03 ONBrez-AKSIYON2-EH       pic 9.
          03 ONBREZ-SPECIAL2-EH       pic 9.           
          03 ONBrez-sil-sebeb-ID      pic 9(12).
          03 ONBREZ-gel-sirket-ID     PIC 9(12).
          03 ONBREZ-git-sirket-ID     PIC 9(12).
          03 ONBrez-operator-ID       pic 9(12).
          03 ONBrez-gr-olabilir       pic 9.             
          03 ONBrez-gr-status         pic x.
          03 ONBrez-kaynak-1-ID       pic x(02).
          03 ONBrez-kaynak-2-ID       pic x(02).
          03 ONBrez-kaynak-3-ID       pic x(02).
          03 ONBREZ-RATE-ACENTA-ID     PIC 9(12).
          03 ONBrez-extra-kart2       pic x(7).
          03 ONBREZ-EXTRA-KART        PIC X(7).
          03 ONBREZ-PAZAR-ID          PIC 9(12).
          03 ONBREZ-EB                PIC 9.
          03 ONBREZ-FIYAT-FIX         PIC 9.     
          03 ONBREZ-FIYAT-KONUMU-ID   PIC 99.
          03 ONBREZ-AKSIYON-H         PIC 9.
          03 ONBREZ-BILBORD           PIC 9.
          03 ONBREZ-UG-IND            PIC 9.
          03 ONBREZ-CIN-KURU          PIC 999V99999.
          03 ONBREZ-CIN-KUR-TAR       PIC X(8).
          03 ONBREZ-ODA-TIPI-ID       PIC 9(12).
          03 ONBREZ-SPECIAL-H         PIC 9.        
          03 ONBREZ-OZEL-DURUM-ID     PIC 9(12).
          03 ONBREZ-TITLE             PIC X(09).
          03 ONBrez-gec               pic 9.
          03 ONBrez-plan              pic 9.
          03 ONBrez-rehber-ID         pic 9(12).
          03 ONBREZ-renk              PIC 9.            
          03 ONBREZ-ODA-TIPI2-ID      PIC 9(12).
          03 ONBREZ-ODA-TIPI3-ID      PIC 9(12).        
          03 ONBREZ-tam-blok          PIC 9.
          03 ONBREZ-share             PIC 9.         
          03 ONBrez-sharenum          pic 9(8).          
          03 ONBrez-sil-tar.
             04 ONBrez-sil-yil        pic 9(4).
             04 ONBrez-sil-ay         pic 9(2).
             04 ONBrez-sil-gun        pic 9(2).
          03 ONBREZ-SÝL-ZAMAN.
             04 ONBrez-sil-saat       pic 9(2).
             04 ONBrez-sil-dakika     pic 9(2).
             04 ONBrez-sil-saniye     pic 9(2).
          03 ONBREZ-CRE-STAF          pic 9(12).
          03 ONBREZ-SIL-STAF          pic 9(12).              
          03 ONBrez-extra-ind         pic 999v99.
          03 ONBREZ-NO-POST           pic 9.
          03 ONBrez-dev-uye-no        pic 9(8).
*          03 ONBREZ-RATE-ACENTA       Pic xxxx.
          03 ONBrez-room-kdv-yok      pic 9.
          03 ONBrez-extra-kdv-yok     pic 9.        
          03 ONBrez-bavel             pic x(15).
          03 ONBREZ-VIP-turu          pic x.
          03 ONBrez-blok-tip          pic 9. |0-acýk 1-kitli blokaj 2-pre cIN
          03 ONBrez-onodeme-var       pic 9. 
          03 ONBrez-cin-kur-tar.
             04 ONBrez-cin-kur-yil    pic 9(4).
             04 ONBrez-cin-kur-ay     pic 9(2).
             04 ONBrez-cin-kur-gun    pic 9(2).            
          03 ONBrez-k-karti-id        pic 9(12).  
          03 ONBrez-dig-plan.
             04 ONBrez-oda-plan       pic 9.
             04 ONBrez-kisi-plan      pic 9.
             04 ONBrez-fkonum-plan    pic 9.
             04 ONBrez-pans-plan      pic 9.
          03 ONBrez-paylas-oda        pic 9.
          03 ONBrez-FOL-KODU          PIC X.
          03 ONBrez-mini-ok           pic 9.
          03 ONBrez-CIK-CIKMA         PIC X.
          03 ONBrez-ERKEN-CIK         PIC X.
          03 ONBrez-UZATMA            PIC X.
          03 ONBrez-ODADEGIS          PIC X.
          03 ONBrez-KARTNO            PIC X(07).
          03 ONBrez-REOPEN            PIC X.      
          03 ONBrez-GELIS-SAYISI      PIC 9(2).      
          03 ONBrez-GEC-GIRIS         PIC 9.
          03 ONBrez-rehber-ID         pic 9(12).
          03 ONBrez-SAFE              PIC 9.
          03 ONBrez-ANAHTAR           PIC 9.
          03 ONBrez-LATE-ZAMAN.
            04 ONBrez-LATE-GEL-SAAT   PIC 99.
            04 ONBrez-LATE-GEL-DAK    PIC 99.        
          03 ONBrez-sehir             pic xxx.         
          03 ONBrez-acik-hesap        pic 9.
          03 ONBrez-kapat-tarih.
              04 ONBrez-kapat-yil     pic 9999.
              04 ONBrez-kapat-ay      pic 99.
              04 ONBrez-kapat-gun     pic 99.
          03 ONBrez-kapat-zaman. 
             04 ONBrez-kapat-saat     pic 99.
             04 ONBrez-kapat-dak      pic 99.
             04 ONBrez-kapat-san      pic 99.
          03 ONBrez-cout-staf         pic xxxx.
          03 ONBrez-acik-hesap-staf   pic xxxx.
          03 ONBrez-kapat-staf        pic xxxx.
          03 ONBrez-cin-staf          pic xxxx.
          03 ONBrez-gunsonu-cout      pic 9.        
          03 ONBrez-proforma          pic 9.
          03 ONBrez-gr-status         pic x.                        
          03 ONBrez-bosv9             pic x(756). 
          03 ONBREZ-STAF              PIC X(04).

******************
       FD ONBREZdigtar LABEL RECORD STANDARD.
       01 ONBREZdigtar-REC.
          02 ONBREZdigtar-ANAH.
             03 ONBREZdigtar-rezno             PIC 9(08).
          02 ONBrezdigtar-mail-tar.
             03 ONBrezdigtar-mail-YIL         PIC 9999.
             03 ONBrezdigtar-mail-AY          PIC 99.
             03 ONBrezdigtar-mail-GUN         PIC 99.
          02 ONBrezdigtar-odeme-tar.
             03 ONBrezdigtar-odeme-YIL         PIC 9999.
             03 ONBrezdigtar-odeme-AY          PIC 99.
             03 ONBrezdigtar-odeme-GUN         PIC 99.
          02 ONBrezdigtar-odemeeb-tar.
             03 ONBrezdigtar-odemeeb-YIL         PIC 9999.
             03 ONBrezdigtar-odemeeb-AY          PIC 99.
             03 ONBrezdigtar-odemeeb-GUN         PIC 99.
          02 ONBrezdigtar-odemeeb-oran      pic 999.
          02 ONBrezdigtar-4-tar.
             03 ONBrezdigtar-4-YIL         PIC 9999.
             03 ONBrezdigtar-4-AY          PIC 99.
             03 ONBrezdigtar-4-GUN         PIC 99.
         
         02 ONBrezdigtar-5-tar    pic x(8).
         02 ONBrezdigtar-6-tar    pic x(8).
         02 ONBrezdigtar-aylik    pic 9.
         02 ONBrezdigtar-bos      pic x(99).
*************
       FD ONBREZweb  LABEL RECORD STANDARD.
        01 ONBREZweb-REC.
          02 ONBREZweb-ANAH.
             03 ONBREZweb-rezno             PIC 9(08).
          02 ONBrezweb-mesaj.
                  06 ONBrezweb-bosm           pic x(9). 
                  06 ONBrezweb-eyalet         pic x(20).
                  06 ONBrezweb-pkodu          pic x(10).
                  06 ONBrezweb-adres          pic x(60). 
                  06 ONBrezweb-sehir          pic x(15).
                  06 ONBrezweb-ulkem          pic x(15). 
                  06 filler                pic x(40).
                  06 ONBrezweb-tel            pic x(20).
                  06 ONBrezweb-email          pic x(50).
                  06 ONBrezweb-yatak          pic x(2).
                  06 ONBrezweb-sigara         pic 9.
                  06 ONBrezweb-erken-giris    pic x(4).
                  06 ONBrezweb-gec-cikis      pic x(4).
                  06 ONBrezweb-kredi-karti    pic x(100).
           02 ONBrezweb-extralalar        occurs 3 times. 
                  05 ONBrezweb-extra-adi             pic x(20).
                  05 ONBrezweb-extra-aciklama         pic x(60).
                  05 ONBrezweb-extra-tl-tutar         pic 9(6)v99.
                  05 ONBrezweb-extra-dv-tutar         pic 9(6)v99.
           02 ONBrezweb-internal-voucher      pic x(30).
           02 ONBrezweb-not                  pic x(100).
           02 ONBrezweb-boslar               pic x(870).
           
           
           
       FD ONBrezodablok LABEL RECORD STANDARD.
       01 ONBrezodablok-REC.
          02 ONBrezodablok-ANAH.
             03 ONBrezodablok-rezno             PIC 9(08).
             03 ONBrezodablok-odano             pic x(4).
          02 ONBrezodablok-tamblok-tar.
             03 ONBrezodablok-tamblok-YIL         PIC 9999.
             03 ONBrezodablok-tamblok-AY          PIC 99.
             03 ONBrezodablok-tamblok-GUN         PIC 99.
          02 ONBrezodablok-tamblok-zaman.
             03 ONBrezodablok-tamblok-saat       PIC 99.
             03 ONBrezodablok-tamblok-dakika     PIC 99.
          02 ONBrezodablok-tamblok-staf   pic x(4).
          02 ONBrezodablok-tamblok-not    pic x(20).
          02 ONBrezodablok-qtar.
             03 ONBrezodablok-qtar-YIL         PIC 9999.
             03 ONBrezodablok-qtar-AY          PIC 99.
             03 ONBrezodablok-qtar-GUN         PIC 99.
           02 ONBrezodablok-qtar-zaman.
             03 ONBrezodablok-qtar-saat       PIC 99.
             03 ONBrezodablok-qtar-dakika     PIC 99.
         
          02 ONBrezodablok-readytar.
             03 ONBrezodablok-readytar-YIL         PIC 9999.
             03 ONBrezodablok-readytar-AY          PIC 99.
             03 ONBrezodablok-readytar-GUN         PIC 99.
           02 ONBrezodablok-readytar-zaman.
             03 ONBrezodablok-readytar-saat       PIC 99.
             03 ONBrezodablok-readytar-dakika     PIC 99.
           02 ONBrezodablok-cintar.
             03 ONBrezodablok-cintar-YIL         PIC 9999.
             03 ONBrezodablok-cintar-AY          PIC 99.
             03 ONBrezodablok-cintar-GUN         PIC 99.
           02 ONBrezodablok-cintar-zaman.
             03 ONBrezodablok-cintar-saat       PIC 99.
             03 ONBrezodablok-cintar-dakika     PIC 99.
           02 ONBrezodablok-boztar.
             03 ONBrezodablok-boztar-YIL         PIC 9999.
             03 ONBrezodablok-boztar-AY          PIC 99.
             03 ONBrezodablok-boztar-GUN         PIC 99.
           02 ONBrezodablok-boztar-zaman.
             03 ONBrezodablok-boztar-saat       PIC 99.
             03 ONBrezodablok-boztar-dakika     PIC 99.
           02 ONBrezodablok-boz-staf    pic x(4).
           02 ONBrezodablok-qstaf               pic xxxx.
         02 ONBrezodablok-bos      pic x(95).
         02 ONBrezodablok-staf pic x(4).
