         COPY "genel.lib".
         COPY "genelfis.lib".
         COPY "depkod.lib".
         COPY "onkasa.lib".
         COPY "dokumer.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".  
        COPY "odalar.lib".                                                                                                                                               
