       FD ONKASAR LABEL RECORD STANDARD.
       01 ONKASAR-REC.
          02 ONKASAR-ANAH.
             03 ONKASAR-REF         PIC 9.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=ONKASAR_TARIH  
             03 ONKASAR-TARIH.  
                04 ONKR-YIL         PIC 9(04).
                04 ONKR-AY          PIC 9(02).
                04 ONKR-GUN         PIC 9(02).
             03 ONKASAR-DEP         PIC 9(03).  
           02 ONKASAR-TUTAR-TL       PIC S9(15)V99  COMP-3.
           02 ONKASAR-TUTAR-DV       PIC S9(09)V99  COMP-3.
           02 ONKASAR-CORR-TUTAR-TL  PIC S9(15)V99  COMP-3.
           02 onkasaR-matrah-disi    pic s9(07)v99  comp-3.
           02 ONKASAR-CORR-TUTAR-DV  PIC 9  COMP-3.

