       FD ONKASA LABEL RECORD STANDARD.
       01 ONKASA-REC.
          02 ONKASA-ANAH.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=ONKASA_TARIH
             03 ONKASA-TARIH.  
                04 ONK-YIL         PIC 9(04).
                04 ONK-AY          PIC 9(02).
                04 ONK-GUN         PIC 9(02).
             03 ONKASA-DEP         PIC 9(03).  
          02 ONKASA-TUTAR-TL       PIC S9(15)V99  COMP-3.
          02 ONKASA-TUTAR-DV       PIC S9(09)V99  COMP-3.
          02 ONKASA-CORR-TUTAR-TL  PIC S9(15)V99  COMP-3.
          02 onkasa-matrah-disi    pic s9(07)v99  comp-3.
          02 ONKASA-CORR-TUTAR-DV  PIC 9  COMP-3.
*********> Bir gundeki herhangi bir departmanin tum hareketleri bu dosyaya
*********> islenecek........
*********> Dunden devir ve yarina devir icin birer departman atanacak...
*********>    888-Dunden Devir   999-Yarina Devir gibi.... veya bu departmanlar
*********>    genel.lib'de tanimlanacak..... 
