         copy "genel.lib".
         copy "genelfis.lib".
         copy "kllnc.lib".
         copy "onkasa.lib".
         copy "depkod.lib".
         copy "dokumer.lib".
         copy "grup.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib". 
        
        copy "kur.lib".  
        COPY "odalar.lib".                                                                                                                              
