         COPY "genel.lib".
         COPY "konuk.lib".
         COPY "romhrk.lib".
         COPY "exthrk.lib".
         COPY "onkasa.lib".
         COPY "takvim.lib".
         COPY "kur.lib".
         COPY "depkod.lib".
         COPY "odalar.lib".
        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".                                                    
