        FD onodeme LABEL RECORD STANDARD.
        01 onodeme-rec.
           02 onodeme-anah.
              03 onodeme-rez-no        pic 9(8).
              03 onodeme-dep-kod       pic 9(3).
           02 onodeme-tarih.              
              03 onodeme-tarih-yil  pic 9(4).
              03 onodeme-tarih-ay   pic 9(2).
              03 onodeme-tarih-gun  pic 9(2).
           02 onodeme-doviz-kodu       pic x(2).
           02 onodeme-bas-tut          pic 9(8)V99.
           02 onodeme-bas-tut-tl       pic 9(8)V99.
           02 onodeme-basilan-tutar    pic 9(8)V99.
           02 onodeme-basilan-folio    pic 9(8).
           02 onodeme-folio-islendi    pic 9.
           02 onodeme-bos              pic x(500).    
