FD onrezhrk LABEL RECORD STANDARD.
01 onrezhrk-rec.
   02 onrezhrk-anahtar.
      03 onrezhrk-no                           pic 9(5).
      03 onrezhrk-islem-no                     pic 9(5).
      03 onrezhrk-bos-anah                     pic x(50).
   02 onrezhrk-diger.                          
      03 onrezhrk-adi                          pic x(30).
      03 onrezhrk-soyadi                       pic x(30).
      03 onrezhrk-telefon-i                    pic x(20).
      03 onrezhrk-telefon-ii                   pic x(20).
      03 onrezhrk-telefon-iii                  pic x(20).
      03 onrezhrk-email-i                      pic x(50).
      03 onrezhrk-email-ii                     pic x(50).
      03 onrezhrk-email-iii                    pic x(50).
      03 onrezhrk-kayit-tarih.
         04 onrezhrk-kayit-yil                pic 9(4).
         04 onrezhrk-kayit-ay                 pic 9(2).
         04 onrezhrk-kayit-gun                pic 9(2).
      03 onrezhrk-giris-tarih.
         04 onrezhrk-giris-yil                pic 9(4).
         04 onrezhrk-giris-ay                 pic 9(2).
         04 onrezhrk-giris-gun                pic 9(2).
      03 onrezhrk-cikis-tarih.
         04 onrezhrk-cikis-yil                pic 9(4).
         04 onrezhrk-cikis-ay                 pic 9(2).
         04 onrezhrk-cikis-gun                pic 9(2).
      03 onrezhrk-fiyat                        pic 9(5)v99.
      03 onrezhrk-doviz                        pic x(2).
      03 onrezhrk-gecerlilik-suresi            pic 9(5).
      03 onrezhrk-aciklama-i                   pic x(300).
      03 onrezhrk-aciklama-ii                  pic x(300).
      03 onrezhrk-aciklama-iii                 pic x(300).
      03 onrezhrk-misafir-not                  pic x(300).
      03 onrezhrk-staff-not                    pic x(300).
      03 onrezhrk-teklif-form-adres            pic x(500).
      03 onrezhrk-dosya-yolu OCCURS 10 TIMES.
         04 onrezhrk-dosya-ek-adi              pic x(50).
      03 onrezhrk-oda-konum                    pic 99.
      03 onrezhrk-alternatif-konum             pic 99.
      03 onrezhrk-pasif                        pic 9.
      03 onrezhrk-satis-durumu                 pic x.
         88 onrezhrk-satis-durumu-sat     value "S".
         88 onrezhrk-satis-durumu-iptal   value "I".
         88 onrezhrk-satis-durumu-devam   value "D".
      03 onrezhrk-kisi.
         04 onrezhrk-buyuk                   pic 99.            
         04 onrezhrk-kucuk                   pic 99.
         04 onrezhrk-free                    pic 99.
         04 onrezhrk-bebek                   pic 99.
      03 onrezhrk-staff                        pic x(4).
      03 onrezhrk-fiyat-ii                     pic 9(5)v99.
      03 onrezhrk-doviz-ii                     pic x(2).
      03 onrezhrk-mail-aciklama                pic x(500).
      03 onrezhrk-bos-diger                    pic x(973).

