       fd otlortak label record standard.
       01 otlortak-rec.
           02 otlortak-anahtar.
              03 otlortak-tipi        pic xxxx.
                 88 otlortak-tipi-mail         value "A".
                 88 otlortak-tipi-mail-imza    value "B".
              03 otlortak-tarih.
                 04 otlortak-yil      pic 9(4).
                 04 otlortak-ay       pic 9(2).
                 04 otlortak-gun      pic 9(2).
              03 otlortak-fis         pic 9(10).
              03 otlortak-sira        pic 9(10).
              03 otlortak-sayisal     pic 9(10).
              03 otlortak-kodu1       pic x(15).
              03 otlortak-kodu2       pic x(15).
           02 otlortak-adi            pic x(50).
           02 otlortak-aciklama-1     pic x(50).
           02 otlortak-aciklama-2     pic x(50).
           02 otlortak-filler         pic x(750).
           02 otlortak-mail redefines otlortak-filler.
              03 otlortak-mail-occ occurs 3 times.
                 04 otlortak-mail-server                 pic x(50).
                 04 otlortak-mail-username               pic x(30).
                 04 otlortak-mail-password               pic x(30).
                 04 otlortak-mail-email                  pic x(35).
                 04 otlortak-mail-name                   pic x(30).
                 04 otlortak-mail-send-port              pic 9(05).
                 04 otlortak-mail-ssl                    pic x.
                 04 otlortak-mail-spa                    pic x.
                 04 otlortak-mail-kendim                 pic x.
************************* kendine bir kopya gönderir
                 04 otlortak-email-uzun                  pic x(49).
           02 otlortak-mail-imza redefines otlortak-filler.
              03 otlortak-mail-imza-occ occurs 3 times.
                 04 otlortak-mail-imza-aciklama          pic x(250).
           02 otlortak-staf           pic x(04).
***********************************************************************
*********** Tipler
*********** A - mail ayarlari 
*********** B-  mail imza
***********************************************************

