FD odatemiz LABEL RECORD IS STANDARD.
 01 odatemiz-rec.
     02 odatemiz-anah.
        03 odatemiz-tarih.
           04 odatemiz-yil             pic 9(04).
           04 odatemiz-ay              pic 9(02).
           04 odatemiz-gun             pic 9(02).
        03 odatemiz-zaman.
           04 odatemiz-saat            pic 9(02).
           04 odatemiz-dakika          pic 9(02).
           04 odatemiz-saniye          pic 9(02).
        03 odatemiz-oda                pic x(04).
        03 odatemiz-tip                pic x(01).
        03 odatemiz-bos-anah           pic x(200).
     02 odatemiz-diger.
        03 odatemiz-tem-tar.
           04 odatemiz-tem-yil         pic 9(04).
           04 odatemiz-tem-ay          pic 9(02).
           04 odatemiz-tem-gun         pic 9(02).
        03 odatemiz-tem-zaman.
           04 odatemiz-tem-saat        pic 9(02).
           04 odatemiz-tem-dakika      pic 9(02).
           04 odatemiz-tem-saniye      pic 9(02).
        03 odatemiz-ger-tem-tar.
           04 odatemiz-ger-tem-yil     pic 9(04).
           04 odatemiz-ger-tem-ay      pic 9(02).
           04 odatemiz-ger-tem-gun     pic 9(02).
        03 odatemiz-ger-tem-zaman.
           04 odatemiz-ger-tem-saat    pic 9(02).
           04 odatemiz-ger-tem-dakika  pic 9(02).
           04 odatemiz-ger-tem-saniye  pic 9(02).
        03 odatemiz-bos                pic x(1000).

