*
 FD outof LABEL RECORD STANDARD.
 01 outof-REC.
  02 outof-ANAH.
    03 outof-odano       PIC XXXX.
    03 outof-bas-tarih.
      04 outof-bas-yil    pic 9(04).
      04 outof-bas-ay     pic 9(02).
      04 outof-bas-gun    pic 9(02).
    03 outof-bit-tarih.
      04 outof-bit-yil    pic 9(04).
      04 outof-bit-ay     pic 9(02).
      04 outof-bit-gun    pic 9(02).
  02 outof-isl-tarih.
    03 outof-isl-yil    pic 9(04).
    03 outof-isl-ay     pic 9(02).
    03 outof-isl-gun    pic 9(02).
  02 outof-aciklama     pic x(50).
  02 outof-staf         pic x(04).
  02 outof-toplam-oda-etkile pic 9.
  02 outof-bos          pic x(099).

 FD soutof LABEL RECORD STANDARD.
 01 soutof-REC.
  02 soutof-ANAH.
    03 soutof-odano       PIC XXXX.
    03 soutof-bas-tarih.
      04 soutof-bas-yil    pic 9(04).
      04 soutof-bas-ay     pic 9(02).
      04 soutof-bas-gun    pic 9(02).
    03 soutof-bit-tarih.
      04 soutof-bit-yil    pic 9(04).
      04 soutof-bit-ay     pic 9(02).
      04 soutof-bit-gun    pic 9(02).
  02 soutof-isl-tarih.
    03 soutof-isl-yil    pic 9(04).
    03 soutof-isl-ay     pic 9(02).
    03 soutof-isl-gun    pic 9(02).
  02 soutof-aciklama     pic x(50).
  02 soutof-staf         pic x(04).
  02 soutof-toplam-oda-etkile pic 9.
  02 soutof-sil-tar.
     03 soutof-sil-yil   pic 9(4).
     03 soutof-sil-ay    pic 9(2).
     03 soutof-sil-gun   pic 9(2).
  02 soutof-sil-zaman.
     03 soutof-sil-saat    pic 9(2).
     03 soutof-sil-dakika  pic 9(2).
     03 soutof-sil-saniye  pic 9(2).
  02 soutof-sil-staff      pic x(4).
  02 soutof-bos          pic x(081).

