*
         COPY "genel.lib". 
         COPY "genelfis.lib". 
         COPY "kllnc.lib". 
         COPY "takvim.lib". 
         COPY "takvim2.lib". 
         COPY "kodlar02.lib". 
         COPY "konum.lib". 
         COPY "odalar.lib". 
         COPY "errorlog.lib".                                                    
         COPY "logindex.lib". 
         COPY "outof.lib". 
         copy "dokumer.lib".
         copy "cast.lib".
         copy "rez.lib".
         copy "konuk.lib".

