       FD OZLUK LABEL RECORD STANDARD.
       01 OZLUK-REC.
          02 OZLUK-ANAH.
             03 OZLUK-FOLIO       PIC 9(08).
          02 OZLUK-DURUMU         PIC X.
*********> Ozluk-Durumu   => Folionun iceridemi yoksa histroyde mi oldugunu
*********> belirtir...   I-> Iceride H->Historyde Gibi............
          02 OZLUK-ADI             PIC X(20).
          02 OZLUK-SOYADI          PIC X(20).
          02 OZLUK-REZ-NO          PIC 9(08).
          02 OZLUK-MESLEK          PIC X(13).
          02 ozluk-master-reklam   pic 9(5)v99.
          02 OZLUK-BABA-ADI        PIC X(4).
          02 ozluk-ilk-har         pic 9(8).
          02 ozluk-son-har-tar         pic 9(8).
          02 OZLUK-YANI.
             03 OZLUK-YANI-ADI1    PIC X(20).
             03 OZLUK-YANI-SOY1    PIC X(20).
             03 OZLUK-YANI-ADI2    PIC X(20).
             03 OZLUK-YANI-SOY2    PIC X(20).
          02 OZLUK-ADRES.
             03 OZLUK-ADRES1       PIC X(20).
             03 OZLUK-ADRES2       PIC X(20).
          02 OZLUK-KIMLIK.
             03 OZLUK-KIM-TURU     PIC x.
             03 OZLUK-KIM-NO       PIC X(11).
             03 OZLUK-KIM-VERYER   PIC X(09).
             03 OZLUK-KIM-TAR.
                04 OZLUK-KIM-YIL   PIC 9999.
                04 OZLUK-KIM-AY    PIC 99.
                04 OZLUK-KIM-GUN   PIC 99.
          02 OZLUK-DOGUM.
             03 OZLUK-DOGUM-TAR.
                04 OZLUK-DOGUM-YIL PIC 9999.
                04 OZLUK-DOGUM-AY  PIC 99.
                04 OZLUK-DOGUM-GUN PIC 99.
             03 OZLUK-DOGUM-YERI   PIC X(10).
          02 OZLUK-PLAKA           PIC X(15).
          02 OZLUK-E-MAIL          PIC X(33).
          02 ozluk-master-katalog  pic 9(5)v99.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=OZLUK-EVLILIK-TAR
          02 OZLUK-EVLILIK-TAR.
             03 OZLUK-EVLILIK-YIL  PIC 9999.
             03 OZLUK-EVLILIK-AY   PIC 99.
             03 OZLUK-EVLILIK-GUN  PIC 99.
          02 OZLUK-TELNO           PIC X(20).
          

          02 OZLUK-FAX             PIC X(15).
          02 OZLUK-GSM             PIC X(15).
          02 OZLUK-ILCE            PIC X(10).
          02 OZLUK-IL              PIC X(10).
          
          02 OZLUK-ULKE            PIC X(10).
          02 OZLUK-POSTA-KODU      PIC X(05). 
          02 OZLUK-adres-FILTRE    PIC 9(02).  
          02 OZLUK-MESLEK-FILTRE   PIC 9(02). 
          02 OZLUK-MASTER-ORDER    PIC X(10).
          02 OZLUK-MASTER-tut      PIC 9(5)v99.
          02 OZLUK-MASTER-ind      PIC 9(5)v99.
          02 OZLUK-master-eb       PIC 9(5)v99.
          02 OZLUK-STAF            PIC X(04).
********> Ozluk-Durumu..... Degiskeni    folionun iceridemi yoksa History de mi
********> Oldugunu gosterir.. Anahtar sahalar icin gerekli................
********> I-> Iceride H-> Historyde...........
