*
 FD OZLUK2 LABEL RECORD STANDARD.
 01 OZLUK2-REC.
          02 OZLUK2-ANAH.
             03 OZLUK2-FOLIO              PIC 9(08).
          02 OZLUK2-FAT-UNVAN-1           PIC X(40).
          02 OZLUK2-FAT-UNVAN-2           PIC X(40).
          02 OZLUK2-FAT-ADRES-1           PIC X(40).
          02 OZLUK2-FAT-ADRES-2           PIC X(40).
          02 OZLUK2-FAT-IL-ILCE           PIC X(20).
          02 OZLUK2-FAT-ULKE              PIC X(20).
          02 OZLUK2-FAT-VERGI-DAIRE       PIC X(20).
          02 OZLUK2-FAT-VERGI-NO          PIC X(20).
          02 ozluk2-cari                  pic x(15).
          02 ozluk2-birlesme              pic x .
          02 ozluk2-birles-folio          pic 9(8).
          02 OZLUK2-BOS                   PIC X(176).
