*
 FD PACEVAP LABEL RECORD STANDARD.
 01 PACEVAP-REC.
      02 PACEVAP-ANAH.
         03 PACEVAP-KODU         PIC 9(03).
         03 PACEVAP-ALT-KODU     PIC 9(04).
         03 PACEVAP-ANAH-BOS     PIC X(50).
      02 PACEVAP-ADI             PIC X(50).
      02 PACEVAP-ALT-ADI         PIC X(50).
      02 PACEVAP-ALT-CEVAP       PIC 9.
      02 PACEVAP-BOS             PIC X(300).
      02 PACEVAP-STAF            PIC X(04).


