          COPY "doviz.lib".
          COPY "genel.lib".
         copy "odalar.lib".
        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib". 
        copy "pasoru.lib".
        copy "pacevap.lib".                                             
