*
 FD PACHRK LABEL RECORD STANDARD.
 01 PACHRK-REC. 
    02 PACHRK-ANA-ANAH.
      03 PACHRK-ANAH.
         04 PACHRK-PROFIL-KUTUPHANE PIC X(08).
         04 PACHRK-PROFIL-NO        PIC 9(08).
         04 PACHRK-ANKET-NO         PIC 99.
      03 PACHRK-CEVAP.
         04 PACHRK-SORU-KODU        PIC 9(03).
         04 PACHRK-CEVAP-KODU       PIC 9(03).
         04 PACHRK-CEVAP-ALT-KODU   PIC 9(04).
    02 PACHRK-CEVAP-NOT           PIC X(200).
    02 PACHRK-BOS                 PIC X(300).  
    02 PACHRK-STAF                PIC X(04).


