*
 FD PAHRK LABEL RECORD STANDARD.
 01 PAHRK-REC.
      02 PAHRK-ANAH.
         03 PAHRK-PROFIL-KUTUPHANE PIC X(08).
         03 PAHRK-PROFIL-NO        PIC 9(08).
         03 PAHRK-ANKET-NO         PIC 99.
      02 PAHRK-KAYIT-TARIH.
         03 PAHRK-KAYIT-YIL      PIC 9(04).
         03 PAHRK-KAYIT-AY       PIC 9(02).
         03 PAHRK-KAYIT-GUN      PIC 9(02).
      02 PAHRK-AD                PIC X(20).
      02 PAHRK-SOYAD             PIC X(20).
      02 PAHRK-FOLIO-NO          PIC 9(8).
      02 PAHRK-UYRUK             PIC X(03).
      02 PAHRK-CINSIYET          PIC X.
      02 PAHRK-MEDENI-DURUM      PIC X.
      02 PAHRK-ODA-NO            PIC X(04).
      02 PAHRK-DOGUM-TARIH.
         03 PAHRK-DOGUM-YIL      PIC 9(04).
         03 PAHRK-DOGUM-AY       PIC 9(02).
         03 PAHRK-DOGUM-GUN      PIC 9(02).
      02 PAHRK-EY-TARIH.
         03 PAHRK-EY-YIL         PIC 9(04).
         03 PAHRK-EY-AY          PIC 9(02).
         03 PAHRK-EY-GUN         PIC 9(02).
      02 PAHRK-aciklama          pic x(300).
      02 pahrk-seri-no           pic 9(6).
      02 PAHRK-BOS               PIC X(294). 
      02 PAHRK-STAF              PIC X(04).


