*
         COPY "genel.lib".
         COPY "genelfis.lib".
         COPY "dokumer.lib".
         COPY "errorlog.lib".                                                    
         COPY "logindex.lib". 

         COPY "rez.lib".
         COPY "konuk.lib".
         copy "odalar.lib".
         copy "pasoru.lib".
                                       
