      *
       FD PASORU LABEL RECORD STANDARD.
       01 PASORU-REC.
        02 PASORU-ANAH.
         03 PASORU-KODU       PIC 9(03).
      $XFD HIDDEN
         03 PASORU-BOS        PIC X(50).
       02 PASORU-ADI           PIC X(200).
       02 PASORU-CEVAP-KODU    PIC 9(03).
       02 PASORU-ZORUNLU-CEVAP PIC 9.
       02 PASORU-B-FAZLA-CEVAP PIC 9.
       02 PASORU-ANKET-SIRA    PIC 999.
       02 PASORU-BOS           PIC X(300).
       02 PASORU-STAF          PIC X(04).
