*
 COPY "konuk.lib".
 copy "odalar.lib".
 COPY "rez.lib".
 copy "kodlar02.lib".
*
        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".  
       COPY "genel.lib".                                                                                                      
