 FD  perfor LABEL RECORD IS STANDARD.
 01 perfor-REC.
     02 perfor-ANAH.
         03 perfor-id    pic 9(12).
     02 perfor-data-anah                
         03 perfor-TIPI   PIC X(6).
            88 perfor-satinalma   value "satina". 
            88 perfor-personel    value "person".
            88 perfor-onburo      value "onburo".
         03 perfor-alt-TIPI   PIC X(5).      | bos su anda
         03 perfor-ana-KODU   PIC X(50).          |  cari kodu      personel kodu
         03 perfor-alt-kod    PIC X(100).         |  stok kodu      ay
         03 perfor-belge-no   pic 9(15).
     

**************************
 FD  perhrk LABEL RECORD IS STANDARD.
 01 perhrk-REC.
     02 perhrk-ANAH.
         03 perhrk-id    pic 9(12).
     02 perhrk-data-anah.                
         03 perhrk-perfor-id   PIC 9(12).
         03 perhrk-persoru-id  pic 9(12).
     02 perhrk-data.
        03 perhrk-cevap    pic 99.
        03 perhrk-staf     pic x(4).
        03 perhrk-doldurma-an.
           05 perhrk-doldurma-tarih.
                10 perhrk-doldurma-yil   pic 9999.
                10 perhrk-doldurma-ay    pic 99.
                10 perhrk-doldurma-gun   pic 99.
           05 perhrk-doldurma-zaman.
                10 perhrk-doldurma-saat      pic 99.
                10 perhrk-doldurma-dakika    pic 99.
                10 perhrk-doldurma-saniye   pic 99.


       03 perhrk-olay-an.
           05 perhrk-olay-tarih.
                10 perhrk-olay-yil   pic 9999.
                10 perhrk-olay-ay    pic 99.
                10 perhrk-olay-gun   pic 99.
          05 perhrk-olay-zaman.
                10 perhrk-olay-saat      pic 99.
                10 perhrk-olay-dakika    pic 99.
                10 perhrk-olay-saniye   pic 99.

********************
**************************
 FD  persoru LABEL RECORD IS STANDARD.
 01 persoru-REC.
     02 persoru-ANAH.
         03 persoru-id    pic 9(12).
     02 persoru-data-anah. 
         03 persoru-TIPI   PIC X(6).
            88 persoru-satinalma   value "satina". 
            88 persoru-personel    value "person".
            88 persoru-onburo      value "onburo".          
         03 persoru-sira-no   PIC 9(12).
         03 persoru-grup-no   pic 9(12).
     02 persoru-data.
        03 persoru-text   pic x(100).
        03 persoru-cevaplar .
          05 filler occurs 10 times.
           10 persoru-cevap-text pic x(50).
           10 persoru-cevap-puan pic 999.
       03 persoru-kim            pic x(6).
           88 persoru-satinalma   value "satina". 
           88 persoru-personel    value "person".
           88 persoru-onburo      value "onburo".     
     02 persoru-bos       pic x(100).
