*
 FD PLAKA LABEL RECORD IS STANDARD.
 01 PLAKA-REC.
    02 PLAKA-ID        .
      03 PLAKA-FOLIO          PIC  9(8).
      03 plaka-sira       pic 9.
    02 PLAKA-TEXT         PIC  X(20).
    02 PLAKA-STAF           PIC  X(04).
*      
*******>PLAKA-tipi.. PLAKAeye alinmis kisinin tipini belirtir..
*******>M->Musteri P->Personel A->Acenta vs..gibi
