*-> Onburo copyler
    COPY "genel.lib".
    copy "onbkodlar10.lib".
    copy "genelfis.lib".
    copy "errorlog.lib".
    copy "logindex.lib".
    copy "konuk.lib".
    copy "konuk.lib" replacing leading "konuk" by "konu2".
    copy "exthrk.lib".
    copy "romhrk.lib".
    copy "isyeri.lib".
    copy "kllnc.lib".
    copy "odalar.lib".
    copy "kodlar02.lib".
    copy "kur.lib".
    copy "rez.lib".
    copy "depkod.lib".
    copy "onkasa.lib".

 fd emir label record standard.
 01 emir-rec.
    02 emir-anah              pic x(3).
    02 emir-paket             pic x(150).
    02 emir-beklenen-boy      pic 9(3).
    02 emir-tip               pic x.
       88 emir-tip-tay  value "T".
    02 emir-tay-icerik        pic x(200).
    02 emir-tay-dosya         pic x(100).

 fd pms-log label record standard.
 01 pms-log-rec.
    02 pms-log-date           pic x(08).
    02 filler                 pic x.
    02 pms-log-time           pic x(08).
    02 filler                 pic x.
    02 pms-log-from           pic x(10).
    02 filler                 pic x.
    02 pms-log-paket          pic x(60).
    02 filler                 pic x.
    02 pms-log-aciklama       pic x(30).
