       FD polisxml LABEL RECORD STANDARD.
       01 polisxml-REC.
          02 polisxml-ANAH.
             03 polisxml-rezno       PIC 9(08).
             03 polisxml-sirano      pic 9.
          02 polisxml-DURUMU         PIC X.
*********> polisxml-Durumu   => Folionun iceridemi yoksa histroyde mi oldugunu
*********> belirtir...I-> Iceride H->Historyde Gibi............
        
          02 polisxml-gerisi.
          03 polisxml-ADI            PIC X(20).
          03 polisxml-SOYADI         PIC X(20).
          03 polisxml-ODANO          PIC X(04).
          03 polisxml-uyruk          PIC X(04).
          03 polisxml-GEL-TAR.
             04 polisxml-GEL-YIL     PIC 9999.
             04 polisxml-GEL-AY      PIC 99.
             04 polisxml-GEL-GUN     PIC 99.
          03 polisxml-GIT-TAR.
             04 polisxml-GIT-YIL     PIC 9999.
             04 polisxml-GIT-AY      PIC 99.
             04 polisxml-GIT-GUN     PIC 99.
          03 polisxml-GEL-ZAMAN.
             04 polisxml-GEL-SAAT     PIC 99.
             04 polisxml-GEL-DAKIKA   PIC 99.
             04 polisxml-GEL-SANIYE   PIC 99.
          03 polisxml-GIT-ZAMAN.
             04 polisxml-GIT-SAAT     PIC 99.
             04 polisxml-GIT-DAKIKA   PIC 99.
             04 polisxml-GIT-SANIYE   PIC 99.
          03 polisxml-tckimlikno      pic 9(11).
          03 polisxml-babaadi         pic x(20).
          03 polisxml-anaadi          pic x(20).
          03 polisxml-dyeri           pic x(40).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=POLISXML_DOG_TARIH
          03 polisxml-dog-tar.
             04 polisxml-dog-YIL     PIC 9999.
             04 polisxml-dog-AY      PIC 99.
             04 polisxml-dog-GUN     PIC 99.
          03 polisxml-kturu          pic x.
          03 polisxml-kseri          pic x(20).
          03 polisxml-nil            pic x(20).
          03 polisxml-nilce          pic x(20).
          03 polisxml-nmahalle       pic x(20).
          03 polisxml-ncilt          pic x(15).
          03 polisxml-naile          pic x(15).
          03 polisxml-nsira          pic x(15).
          03 polisxml-cinsiyet       pic x.
          03 polisxml-medeni         pic x.
          03 polisxml-isi            pic x(20).
          03 polisxml-adr            pic x(100).
          03 polisxml-plaka          pic x(20).
          03 polisxml-prb            pic x.
          03 polisxml-prb-ack        pic x(57).
          03 polisxml-folio-no       pic 9(08).
          03 polisxml-kbs-gonderildi pic 9. 
          03 polisxml-BOS            PIC X(81).
          03 polisxml-STAF           PIC X(04).
          |polisxml-kbs-gonderildi;
          |" " ve 0 = yeni kayit gonderilecek.
          |     " " = hic gonderilmedi
          |       0 = gonderim denendi basarisiz.
          |       1 = e-devlet te c-in olmus.
          |       2 = e-devlet ten c-out olmus.

