          COPY "postkod.lib".
          COPY "genel.lib".

        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib". 
        COPY "odalar.lib".                                                                                                                                                
