*
         copy "genel.lib".
         copy "genelfis.lib".
         copy "postkod.lib".
         COPY "postkod.lib"   replacing  leading "postkod" by "post13".
         copy "extpost.lib".
         COPY "extpost.lib"   replacing  leading "extpost" by "ext13".
         copy "depkod.lib".
         copy "odalar.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
