         copy "genel.lib".
         copy "genelfis.lib".
         copy "kllnc.lib".
         copy "postkod.lib".
         copy "depkod.lib".
         copy "dokumer.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".    
        COPY "odalar.lib".                                                                                                                                             
