       FD primhrk LABEL RECORD STANDARD.
        01 primhrk-rec.
          02 primhrk-anah.
             03 primhrk-kodu                             pic 9(03). 
             03 primhrk-gorev-kodu                       pic 9(05).
             03 primhrk-anah-bos                         pic x(20).
          02 primhrk-primi                               pic 9(9)v99.
          02 primhrk-prim-sinir                          pic 9(9)v99.
          02 primhrk-turu                                pic 9.
          02 primhrk-yetki-sira                          pic 999.
          02 primhrk-staf                                pic x(4).
          02 primhrk-bos                                 pic x(093).



                                                                       
         
