       FD PRIM LABEL RECORD STANDARD.
        01 prim-rec.
          02 prim-anah.
             03 prim-kodu                             pic 9(03). 
             03 prim-anah-bos                         pic x(20).
          02 prim-adi                                 pic x(30).
          02 prim-aktif                               pic 9.
          02 prim-ozel                                pic 9.
          02 prim-sabit                               pic 9. 
          02 prim-staf                                pic x(4).
          02 prim-default                             pic 9.
          02 prim-bos                                 pic x(95).



                                                                       
         
