          COPY "kodlar02.lib".
          COPY "genel.lib".

        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib". 
        copy "donem2.lib".
        copy "gorev.lib".  
        copy "odalar.lib".  
        copy "prim.lib".                         
