*
 FD prohrk LABEL RECORD STANDARD.
 01 prohrk-REC.
   02 prohrk-anah.
      03 prohrk-profil-anah.
        05 prohrk-profil-sirket      pic x(8).
        05 prohrk-profil-no          pic 9(8).
      03 prohrk-rez-anah.
        05 prohrk-rez-sirket         pic x(8).
        05 prohrk-rez-no             pic 9(8).
        05 prohrk-rez-sira           pic 99.
   02 prohrk-pro-adi                 pic x(20).
   02 prohrk-pro-soyadi              pic x(20).         
   02 prohrk-acenta                  pic x(4).
*(( XFD DATE=YYYYMMDD, USE GROUP ))
$XFD NAME=PROHRK-GEL-TAR
   02 prohrk-gel-tar.
      03 prohrk-gel-yil              pic 9(4).
      03 prohrk-gel-ay               pic 9(2).
      03 prohrk-gel-gun              pic 9(2).
*(( XFD DATE=YYYYMMDD, USE GROUP ))
$XFD NAME=PROHRK-GIT-TAR
   02 prohrk-git-tar.
      03 prohrk-git-yil              pic 9(4).
      03 prohrk-git-ay               pic 9(2).
      03 prohrk-git-gun              pic 9(2). 
   02 prohrk-banka                   pic x(02).
   02 prohrk-doviz                   pic x(02).
   02 prohrk-pans                    pic x(02).
   02 prohrk-pazar                   pic x(02).
   02 prohrk-ulke                    pic x(03).
   02 prohrk-voucher                 pic x(10).
   02 prohrk-t-oda-fiyati            pic 9(7)v99.
   02 prohrk-t-ext-fiyati            pic 9(7)v99.
   02 prohrk-odano                   pic x(04).
   02 prohrk-r-folio                 pic 9(08).
   02 prohrk-e-folio                 pic 9(08).
   02 prohrk-anlasma                 pic x(02).
   02 prohrk-kur-deg                 PIC 9(9)V9(05) COMP-3.
*(( XFD DATE=YYYYMMDD, USE GROUP ))
$XFD NAME=PROHRK-DUZ-TAR
   02 prohrk-duz-tarih.
     03 prohrk-duz-yil               pic 9(4).
     03 prohrk-duz-ay                pic 9(2).
     03 prohrk-duz-gun               pic 9(2).
   02 filler                         pic x.
   02 prohrk-rez-durumu              pic x.
   02 prohrk-puan                    pic 9(9).
   02 prohrk-geceleme                pic 9(3).
   02 prohrk-bos                     pic x(37).



