*
 COPY "genel.lib".
 COPY "errorlog.lib".
 COPY "genelfis.lib".                                                    
 COPY "logindex.lib".    
 copy "musteri.lib".   
 copy "acenta.lib".
 copy "ulke.lib".       
 copy "kodlar02.lib".    
 copy "prohrk.lib".    
 copy "odalar.lib".    
 copy "uyruk.lib".   
 copy "polisxml.lib".                 
 copy "depart.lib". 
 copy "prolog.lib".              
