       FD prolog LABEL RECORD STANDARD.
       01 prolog-REC.
        02 prolog-anah.
         03 prolog-sube          pic xx.
         03 prolog-tarih.
          04 prolog-yil          pic 9(4).
          04 prolog-ay           pic 9(2).
          04 prolog-gun          pic 9(2).
        02 prolog-data occurs 3 times.    | 1-tmusteri 2-tgprohrk 3- tsprohrk 
         03 prolog-olusturma-tarih.      |mami
          04 prolog-olusturma-yil           pic 9(4).
          04 prolog-olusturma-ay            pic 9(2).
          04 prolog-olusturma-gun           pic 9(2).
         03 prolog-olusturma-zamani.            
          04 prolog-olusturma-saat          pic 9(2).
          04 prolog-olusturma-dakika        pic 9(2).
          04 prolog-olusturma-saniye        pic 9(2).
         03 prolog-merkeze-gonderme-tarih.      |ramco
          04 prolog-merkeze-gonderme-yil    pic 9(4).
          04 prolog-merkeze-gonderme-ay     pic 9(2).
          04 prolog-merkeze-gonderme-gun    pic 9(2).
         03 prolog-merkeze-gonderme-zamani.            
          04 prolog-merkeze-gonderme-saat   pic 9(2).
          04 prolog-merkeze-gonderme-dakika pic 9(2).
          04 prolog-merkeze-gonderme-saniye pic 9(2).
         03 prolog-merkezden-alma-data occurs 10 times.
           04 prolog-alma-tarihi.  |ramco
            05 prolog-alma-yil              pic 9(4).
            05 prolog-alma-ay               pic 9(2).
            05 prolog-alma-gun              pic 9(2).           
           04 prolog-alma-zamani.  |ramco
            05 prolog-alma-saat             pic 9(2).
            05 prolog-alma-dakika           pic 9(2).
            05 prolog-alma-saniye           pic 9(2).
          04 prolog-dagitma-tarihi.  |mami
            05 prolog-dagitma-yil           pic 9(4).
            05 prolog-dagitma-ay            pic 9(2).
            05 prolog-dagitma-gun           pic 9(2).  
           04 prolog-dagitma-zamani.  |mami
            05 prolog-dagitma-saat          pic 9(2).
            05 prolog-dagitma-dakika        pic 9(2).
            05 prolog-dagitma-saniye        pic 9(2).
            



