       FD PROSIF LABEL RECORD STANDARD.
       01 PROSIF-REC.
          02 PROSIF-ANAH.
             03 PROSIF-KIM         PIC X(04).
             03 PROSIF-COB         PIC X(50).
             03 PROSIF-TIPI        PIC X.
          02 prosif-filler.
             03 PROSIF-KODU           PIC X(50).
             03 PROSIF-ADI            PIC X(43).
             03 prosif-row-height     PIC X(2).
             03 prosif-gecici-sifre   pic x(5).
             03 PROSIF-SIFRE          PIC X(20).
             03 PROSIF-YETKI.
                04 PROSIF-GIRIS       PIC X.
                04 PROSIF-RAPOR       PIC X.
                04 PROSIF-WRITE       PIC X.
                04 PROSIF-REWRITE     PIC X.
                04 PROSIF-DELETE      PIC X.
                04 PROSIF-DIGER-1     PIC X.
                04 PROSIF-DIGER-2     PIC X.
                04 PROSIF-DIGER-3     PIC X.
                04 PROSIF-DIGER-4     PIC X.
                04 PROSIF-DIGER-5     PIC X.
                04 PROSIF-DIGER-6     PIC X.
                04 PROSIF-DIGER-7     PIC X.
                04 PROSIF-DIGER-8     PIC X.
                04 PROSIF-DIGER-9     PIC X.
                04 PROSIF-DIGER-10    PIC X.
             03 PROSIF-DETAYLAR       PIC X(50).
***********> 10101010101 Olan detaylar 1 olamayanlar 0
             03 PROSIF-GENEL-AYARLAR.
                04 PROSIF-KULLANICI-ADI  PIC X.
                04 PROSIF-TERMINAL-ADI   PIC X.
                04 PROSIF-SISTEM-TARIHI  PIC X.
                04 PROSIF-TOPLAM-SAYFA   PIC X.
                04 PROSIF-SAYFA-NUMARASI PIC X.
                04 PROSIF-SISTEM-SAATI   PIC X.
             03 PROSIF-KUL-SIFRE         PIC X.
             03 PROSIF-SAYFA             PIC X.
             03 PROSIF-SIZE              PIC 99.
             03 PROSIF-gecici-tar            PIC X(8).
             03 prosif-gecici-gun       pic 99.

          02 prosif-iso redefines  prosif-filler.
             03 prosif-iso-rapor-adi         pic x(50).
             03 prosif-iso-rev.
                04 prosif-iso-rev-no         pic x(5).
                04 prosif-iso-rev-tarih.
                   05 prosif-iso-rev-yil     pic 9(4).
                   05 prosif-iso-rev-ay      pic 9(2).
                   05 prosif-iso-rev-gun     pic 9(2).

          02 PROSIF-STAF           PIC X(4).
****************************************************
***********PROSIF-TIPI                **************
***********S-SIRKET GIRIS IZNI        **************
***********  PROSIF-KIM KULLANICI KODU**************
***********  PROSIF-COB SIRKET-KODU   **************
***********  PROSIF-GIRIS = "E" ise sirkete girebilir 
***********P-PROGRAM SIFRESI          **************
***********  PROSIF-KIM SPACES        **************
***********  PROSIF-COB PROGRAM ISMI  **************
***********Y-Yetkiler                 **************
***********D-Detaylar                 **************
***********  PROSIF-KIM = Kullanici   **************
***********    eger program kullanici **************
***********    bazinda detay          **************
***********    kullanmayacaksa bosluk **************
***********  PROSIF-COB = program ismi**************
***********  PROSIF-DETAY = Eger detay kullanilacaksa 1            
***********  diger hallerde 0
****************************************************
