*
        COPY "prtler.lib" of "..\..\otel\lib-sel".
        COPY "genel.lib".
        COPY "genelfis.lib".
        COPY "errorlog.lib".

        COPY "logindex.lib".  
        COPY "odalar.lib".                                                                                                                                               
