       FD PRTLER LABEL RECORD STANDARD.
       01 PRTLER-REC.
          02 PRTLER-ANAH.
             03 PRTLER-ANAH1     PIC 9(3).   
          02 PRTLER-ADI          PIC X(30).
          02 PRTLER-TIP          PIC X.
             88 PRTLER-VARSAYILAN       VALUE "T".
      *|Windowstaki def yaziciyi alir ve 
      *|Adresin sonuna ekler 
      *|Or: -Q Hp Laser Jet IV;Thin clientlar icin
      *|Dusunuldu
             88 PRTLER-WIN-PRINTERLAR   VALUE "W".
      *|Windowsun gordugu yazicilari getir
             88 PRTLER-SERI             VALUE "S".
             88 PRTLER-DIRECT           VALUE "D".
      *|Standart Windows Yazicisi
             88 PRTLER-TCP-IP           VALUE "I".

          02 PRTLER-ADRES        PIC X(100).

          02 PRTLER-DIRECT-ON    PIC X.
      *|E ise 'Direct=On' eklenir
          02 PRTLER-FONT         PIC X(30).
      *|<> '' ise FONT=PRLET-FONT; olarak eklenir
          02 PRTLER-PITCH        PIC 9(2).
      *|<> 00 ise PITCH=PRTLER-PITCH; olarak eklenir
          02 PRTLER-ORIENTATION  PIC X.
      *|P ->Portrait
      *|L ->Landscape
      *|''->Portrait olarak algilanir
      *|Orientation=Portrait or Landscape; olarek eklenir
          02 PRTLER-COPY         PIC 9(2).
      *|00 ise COPY=PRTLER-COPY; olarak eklenir;

          02 PRTLER-TRANS-BAS    PIC X(6).
          02 PRTLER-TRANS-BIT    PIC X(6).
          02 PRTLER-BUYUK-KUCUK  PIC X(6).
          02 PRTLER-SAYFA-BASI   PIC X.
          02 PRTLER-PRINTER-FILTRELER.
             03 PRTLER-PRINTER-FILTRE01 PIC X.
             03 PRTLER-PRINTER-FILTRE02 PIC X.
             03 PRTLER-PRINTER-FILTRE03 PIC X.
             03 PRTLER-PRINTER-FILTRE04 PIC X.
             03 PRTLER-PRINTER-FILTRE05 PIC X.
             03 PRTLER-PRINTER-FILTRE06 PIC X.
             03 PRTLER-PRINTER-FILTRE07 PIC X.
             03 PRTLER-PRINTER-FILTRE08 PIC X.
             03 PRTLER-PRINTER-FILTRE09 PIC X.
             03 PRTLER-PRINTER-FILTRE10 PIC X.
      *|Tanimli printerin hangi sirketlerde gozukup
      *|gozukmeyecegini belirler
      *|GENEL-PRINTER-FILTRE ile eslesir 
      *|Filtreler tamamen bosluk ise 
      *|tum sirketlerde gozukecek
          02 PRTLER-MODULLER.
             03 PRTLER-MODUL-OTEL      PIC X.
             03 PRTLER-MODUL-MUHA      PIC X.
             03 PRTLER-MODUL-STOK      PIC X.
             03 PRTLER-MODUL-COST      PIC X.
             03 PRTLER-MODUL-PERS      PIC X.
             03 PRTLER-MODUL-POSA      PIC X.
             03 PRTLER-MODUL-XXX1      PIC X.
             03 PRTLER-MODUL-XXX2      PIC X.
             03 PRTLER-MODUL-XXX3      PIC X.
             03 PRTLER-MODUL-XXX4      PIC X.
      *|Eger Moduller 'H' ise tanimli printer 
      *| o moduldede cikmayacak
          02 PRTLER-DEFAULT      PIC X.
          02 PRTLER-SATIR-SAYI   PIC 9(3).
          02 PRTLER-YATAY-YAZDIR PIC X.
          02 PRTLER-DEFAULT1      PIC X.
          02 PRTLER-EPSON-TM295  PIC X. 
          02 PRTLER-BASLIK-YOK   PIC 9.
          02 PRTLER-SAYFA-SATIR  PIC 9(03).
          02 PRTLER-BOS          PIC X(90).

       FD TCP-IP LABEL RECORD STANDARD.
       01 TCP-IP-REC.
          02 FILLER              PIC X(11).
          02 TCP-IP-TTY          PIC X(06).
          02 FILLER              PIC X(20).
          02 TCP-IP-IP           PIC X(15).
