*
 COPY "dokumer.lib".
 COPY "genel.lib".
 COPY "odalar.lib".
 
 COPY "genelfis.lib".
 copy "konum.lib".
 copy "musteri.lib".
 
*
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
