*
         copy "genel.lib".
         copy "konuk.lib".
         copy "ozluk.lib".
         copy "rez.lib".
                     
        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib". 
        copy "odalar.lib".                                           
