*
         copy "genel.lib".
          copy "odalar.lib".
         copy "ozluk.lib".
         copy "konuk.lib".
         copy "silhrk.lib".
         copy "genelfis.lib".
                  COPY "not.lib".


        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
