*        
         COPY "SEHIR.lib".
         COPY "ulke.lib".
         COPY "genel.lib".
         COPY "genelfis.lib".
         COPY "dokumer.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
