
FD RESTREZ LABEL RECORD STANDARD.
01 RESTREZ-REC.
    02 RESTREZ-ANAH.
       03 RESTREZ-TARIH.
          04 REZTREZ-YIL     PIC 9(04).
          04 REZTREZ-AY      PIC 9(02).
          04 REZTREZ-GUN     PIC 9(02).
       03 RESTREZ-KODU       PIC X(02).
       03 RESTREZ-BAS-SAAT   PIC 9(04).
       03 RESTREZ-BIT-SAAT   PIC 9(04).
       03 RESTREZ-FOLIO-NO   PIC 9(08).
    02 RESTREZ-ADI           PIC X(25).
    02 RESTREZ-SOYADI        PIC X(25).
    02 RESTREZ-FIYATI        PIC 9(05)V99.
    02 RESTREZ-KISI.
       03 RESTREZ-BUYUK      PIC 99.
       03 RESTREZ-KUCUK      PIC 99.
       03 RESTREZ-BEBEK      PIC 9.
       03 RESTREZ-FREE       PIC 9.
    02 restrez-zaman         pic 9.
       88 restrez-sabah value 1.
       88 restrez-ogle  value 2.
       88 restrez-aksam value 3.
       88 restrez-zamansiz value 0,4 thru 9.
    02 filler pic xx.
    02 RESTREZ-ODA-NO        PIC X(4).

    02 RESTREZ-BOS           PIC X(142).
    02 RESTREZ-GEL-ZAMAN.
       03 RESTREZ-GEL-SAAT   PIC XX.
       03 RESTREZ-GEL-DAKIKA PIC XX.
    02 RESTREZ-KAYIT-ZAMAN.
       03 RESTREZ-KAYIT-SAAT PIC XX.
       03 RESTREZ-KAYIT-DAK  PIC XX.
       03 RESTREZ-KAYIT-SAN  PIC XX.
    02 RESTREZ-STAF          PIC X(04).
    02 RESTREZ-NOT           PIC X(100).

