       FD rez LABEL RECORD STANDARD.
       01 rez-rec.
          02 rez-anah.
             03 rez-no             PIC 9(08).
          02 rez-tipi              PIC 9.
**********>1->Alotment 2->It 3->Grup 4->Munferit...gibi
          02 rez-durumu            PIC X.
**********>REZ-Durumu => REZervasyonun durumunu belirtir....
**********>I->Iceridekir REZ.  S->Silinmis,Iplat REZ.
**********>Onemli butun anahtar sahalarda olacak...............
          02 rez-acen-anah.
             03 rez-acenta         PIC X(4).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=REZ_GIR_TAR
             03 rez-gir-tar.
                04 rez-gir-yil     PIC 9999.
                04 rez-gir-ay      PIC 99.
                04 rez-gir-gun     PIC 99.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=REZ_CIK_TAR
             03 rez-cik-tar.
                04 rez-cik-yil     PIC 9999.
                04 rez-cik-ay      PIC 99.
                04 rez-cik-gun     PIC 99.
          02 rez-adi               PIC X(20).
          02 rez-soyadi            PIC X(20).
          02 rez-banka             PIC 99.
          02 rez-doviz             PIC 99.
          02 rez-anlasma           PIC XX.
          02 rez-odeme-tipi        PIC XX.
          02 rez-pan-tipi          PIC XX.
          02 rez-ulke              PIC X(03).
          02 rez-voucher           PIC X(30).
          02 rez-kur-aygun         PIC X.
**********>A->Ay basi kuru   G->Gunluk Kur....
          02 rez-k-g-b             PIC X.
**********>K->Confirme G->Gecici B->Beklemede I-Infox
          02 rez-vip               PIC X.
**********>V->V.I.P    T->Top V.I.P
          02 rez-komisyon          PIC 99.
**********>REZ-Komisyon   -> Acenta Komisyonunu Belirlemek Icin Kullanilir
          02 rez-nor-indirim       PIC 99V99.
**********>REZ-Nor-Indirim-> Girilen oran kadar fiyattan indirilecek......
**********>Indirim ile cocuk indirimi birlestirildi..
          02 rez-c-in              PIC X.
          02 rez-folio             PIC 9(08).
**********>REZ-C-In       -> REZervasyonun C/In Yapilip yapilmadigini belirtir.
**********>REZ-Folio      -> REZervasyon  C/In Yapildiginda Folio nosu islenir
          02 rez-odano             PIC X(04).
**********>REZ-Odano      -> REZervasyon esnasinda blokaj yapmaya yarar........
          02 rez-s-d-t-g           PIC 9.
          02 rez-oda-konumu        PIC 99.
          02 rez-kisi.
             03 rez-buyuk          PIC 9(02).
             03 rez-kucuk          PIC 9(02).
             03 rez-bebek          PIC 9(01).
             03 rez-free           PIC 9(01).
          02 rez-fiyati            PIC 9(12)V99 COMP-3.
**********>
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=REZ_ISL_TAR
          02 rez-isl-tar.
             03 rez-isl-yil        PIC 9999.
             03 rez-isl-ay         PIC 99.
             03 rez-isl-gun        PIC 99.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=REZ_AL_TAR
          02 rez-al-tar.
             03 rez-al-yil         PIC 9999.
             03 rez-al-ay          PIC 99.
             03 rez-al-gun         PIC 99.
          02 rez-ops-tar.    
             03 rez-ops-yil        PIC 9999.
             03 rez-ops-ay         PIC 99.
             03 rez-ops-gun        PIC 99.
          02 rez-gel-zaman.  
             03 rez-gel-saat       PIC 99.
             03 rez-gel-dak        PIC 99.
          02 rez-git-zaman.  
             03 rez-git-saat       PIC 99.
             03 rez-git-dak        PIC 99.
          02 rez-genel-bilgi.
             03 rez-grup-anah.
                04 rez-grup-no     PIC 9(06).
                04 rez-grup-adi    PIC X(13).
             03 rez-adres1         PIC X(20).
             03 rez-adres2         PIC X(14).
             03 rez-aksiyon2-eh    pic 9.
             03 rez-special2-eh     pic 9.
             03 rez-statu          pic x.
             03 rez-iptal          pic 9.
             03 rez-sil-sebeb      pic x(2).
             03 rez-not1           PIC X(100).
             03 rez-not2           PIC X(100).
             03 rez-eski-alan.  
               05 rez-bavel-eski  PIC X(15).
               05 filler      pic x.
             03 rez-gel-sirket     PIC X(02).
             03 rez-git-sirket     PIC X(02).
             03 rez-operator       pic x(02).
             03 rez-e-mail         PIC X(01).
             03 rez-gr-olabilir    pic 9.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=REZ_VOUCHER_GIR_TAR
             03 rez-voucher-gir-tar.
                04 rez-voucher-gir-yil     PIC 9999.
                04 rez-voucher-gir-ay      PIC 99.
                04 rez-voucher-gir-gun     PIC 99.
             03 rez-gr-status      pic x.
             03 rez-kaynak-1       pic x(02).
             03 rez-kaynak-2       pic x(02).
             03 rez-kaynak-3       pic x(02).
             03 rez-firma          pic x(05).
             03 rez-extra-kart2    pic x(7).
          02 rez-extra-kart        PIC X(7).
          02 rez-late-zaman.
             03 rez-late-gel-saat  PIC 99.
             03 rez-late-gel-dak   PIC 99.
          02 rez-on-odeme          PIC 9(12)V99 COMP-3.
          02 rez-on-doviz          PIC 9(02).
          02 rez-pazar             PIC X(02).
          02 rez-eb                PIC X.
          02 rez-fiyat-fix         PIC X.
**********>REZ-FIYAT-FIX  ->="E" Peryot degisiminde fiyatti degismesin     
          02 rez-fiyat-konumu      PIC 99.
          02 rez-aksiyon-eh        PIC X.
          02 rez-bilbord-eh        PIC X.
          02 rez-ug-ind            PIC 9.
          02 rez-cin-kuru          PIC 999V99999.
          02 rez-oda-tipi          PIC XX.
          02 rez-special-eh        PIC 9.
          02 rez-ozel-durum-car    PIC 999V9999999.
          02 rez-ozel-durum        PIC 99.
          02 rez-title             PIC X(09).
          02 rez-gec               pic 9.
          02 rez-plan              pic 9.
          02 rez-rehber            pic x(2).
          02 rez-fiyat-flag.    
             05 rez-aksiyon-flag   PIC 9.
             05 rez-renk           PIC 9.
             05 rez-special-flag   PIC 9.
          02 rez-oda-tipi2         PIC XX.
          02 rez-oda-tipi3         PIC XX.
          02 rez-tikler.        
             05 rez-ozel-tip       PIC 9.
             05 rez-tam-blok       PIC 9.
             05 rez-share          PIC 9.
          02 rez-staf-bos       pic x(04).
          02 rez-sharenum       pic 9(8).
          02 rez-sil-tar         pic x(8).
          02 rez-rate-kodu       pic x(8).
          02 rez-extra-ind       pic 999v99.
          02 rez-no-post          pic 9.
          02 rez-dev-uye-no      pic 9(8).
          02 rez-rate-acenta     Pic xxxx.
          02 rez-room-kdv-yok    pic x.
          02 rez-extra-kdv-yok   pic x.
          02 rez-telefon-no      pic x(15).
          02 rez-bavel           pic x(15).
          02 rez-vip-turu        pic x.
          02 rez-blok-tip        pic 9. |0-acýk 1-kitli blokaj 2-pre cIN
          02 rez-onodeme-var     pic 9. 
          02 rez-cin-kur-tar.   
             03 rez-cin-kur-yil  pic 9(4).
             03 rez-cin-kur-ay   pic 9(2).
             03 rez-cin-kur-gun  pic 9(2).
          02 rez-kredi-kart.    
             03 rez-kart-tipi     pic x.
             03 rez-kart-no1      pic x(04).
             03 rez-kart-no2      pic x(04).
             03 rez-kart-no3      pic x(04).
             03 rez-kart-no4      pic x(04).
             03 rez-cvv-kodu      pic x(03).
             03 rez-onay-kodu     pic x(15).
             03 rez-onay-tutar    pic 9(7)v99.
             03 rez-onay-doviz    pic x(02).
             03 rez-kart-sahibi   pic x(50).
             03 rez-kart-son-ay   pic 9(2).
             03 rez-kart-son-yil  pic 9(2).
             03 rez-provizyon-notu pic x(20).
          02 rez-dig-plan.
            03 rez-oda-plan          pic 9.
            03 rez-kisi-plan         pic 9.
            03 rez-fkonum-plan       pic 9.
            03 rez-pans-plan        pic 9.
            03 rez-paylas-oda        pic 9.
          02 rez-sil-neden         pic x(50).
          02 rez-sehir             pic x(3).
          02 rez-alan-staff        pic x(4).
          02 rez-conf-staff        pic x(4).
          02 rez-degis-zaman.
             03 rez-degis-saat     pic 99.
             03 rez-degis-dakika     pic 99.
             03 rez-degis-saniye     pic 99.
          02 rez-mail-adr   pic x(30).
          02 rez-ara-bos    pic x(470).
          02 rez-cocuklar.
             05 rez-cocuk-yas    pic 99 occurs 10 times.
          02 rez-vip-oto-degis     pic 9.
          02 rez-fix-anl           pic 9.
          02 rez-acenta-odeme-alindi pic 9.
          02 rez-call-center       pic x(9).
          02 rez-sejour-entegre   pic 9.
          02 rez-sil-uyarildi     pic 9.
           02 rez-isl-zaman.
             03 rez-isl-saat    pic 99.
             03 rez-isl-dakika  pic 99.
             03 rez-sil-saniye  pic 99.
          02 rez-odano-uzun        pic x(05) .
          02 rez-pre-cin           pic 9(01).
          02 rez-online-cin        pic 9(01).
      *(( XFD DATE=YYYYMMDDHHNNSS, USE GROUP ))
      $XFD NAME=REZ_GUNCELLEME_TARIHI
          02 rez-edit.
             03 rez-edit-tarih.
                04 rez-edit-yil    pic 9(04).
                04 rez-edit-ay     pic 9(02).
                04 rez-edit-gun    pic 9(02).
             03 rez-edit-zaman.
                04 rez-edit-saat   pic 9(02).
                04 rez-edit-dakika pic 9(02).
                04 rez-edit-saniye pic 9(02).
          02 rez-kv-tipi           pic 9. || 1-içinden duþ 2- Acenta öder. Ek Fiyat bas 3- Musteri öder Extraya ekfiyat
          02 rez-bosv9             pic x(47). 
        
          02 rez-sejour-kod        pic x(120).
          02 rez-sejour-logid      pic 9(10).
          02 REZ-STAF              PIC X(04).
          
**************          
       FD REZek LABEL RECORD STANDARD.
       01 REZek-REC.
          02 REZek-ANAH.
             03 REZek-NO             PIC 9(08).
          02 REZek-datalar           .
              05 rezek-source1    pic x(2).
              05 rezek-source2    pic x(2).
              05 rezek-source3    pic x(2).
              05 rezek-gr-status  pic x.
              05 rezek-bos    pic x(100).
              05 rezek-rezidance redefines rezek-bos.
                07 rezek-fiyat-tip   pic 9. | 0-gunluk 1- aylik
                07 rezek-aylik-fiyat  pic 9(8)v99.
                07 rezek-odeme-gunu   pic 99.
                07 rezek-odeme-tip   pic 9. | 0-ay bitiminde 1- on odemeli
                07 rezek-aidat-odeme-tip   pic 9.| 0-ay bitiminde 1- on odmemeli
                07 rezek-aidat-fiyat  pic 9(8)v99.
                07 rezek-aidat-odeme-gunu   pic 99.
                
              05 REZek-STAF              PIC X(04).

******************
       FD REZdigtar LABEL RECORD STANDARD.
       01 REZdigtar-REC.
          02 REZdigtar-ANAH.
             03 REZdigtar-rezno             PIC 9(08).
          02 rezdigtar-mail-tar.
             03 rezdigtar-mail-YIL         PIC 9999.
             03 rezdigtar-mail-AY          PIC 99.
             03 rezdigtar-mail-GUN         PIC 99.
          02 rezdigtar-odeme-tar.
             03 rezdigtar-odeme-YIL         PIC 9999.
             03 rezdigtar-odeme-AY          PIC 99.
             03 rezdigtar-odeme-GUN         PIC 99.
          02 rezdigtar-odemeeb-tar.
             03 rezdigtar-odemeeb-YIL         PIC 9999.
             03 rezdigtar-odemeeb-AY          PIC 99.
             03 rezdigtar-odemeeb-GUN         PIC 99.
          02 rezdigtar-odemeeb-oran      pic 999.
          02 rezdigtar-4-tar.
             03 rezdigtar-4-YIL         PIC 9999.
             03 rezdigtar-4-AY          PIC 99.
             03 rezdigtar-4-GUN         PIC 99.
         
         02 rezdigtar-5-tar    pic x(8).
         02 rezdigtar-6-tar    pic x(8).
         02 rezdigtar-aylik    pic 9.
         02 rezdigtar-bos      pic x(99).
*************
       FD REZweb  LABEL RECORD STANDARD.
        01 REZweb-REC.
          02 REZweb-ANAH.
             03 REZweb-rezno             PIC 9(08).
          02 rezweb-mesaj.
                  06 rezweb-bosm           pic x(9). 
                  06 rezweb-eyalet         pic x(20).
                  06 rezweb-pkodu          pic x(10).
                  06 rezweb-adres          pic x(60). 
                  06 rezweb-sehir          pic x(15).
                  06 rezweb-ulkem          pic x(15). 
                  06 filler                pic x(40).
                  06 rezweb-tel            pic x(20).
                  06 rezweb-email          pic x(50).
                  06 rezweb-yatak          pic x(2).
                  06 rezweb-sigara         pic 9.
                  06 rezweb-erken-giris    pic x(4).
                  06 rezweb-gec-cikis      pic x(4).
                  06 rezweb-kredi-karti    pic x(100).
           02 rezweb-extralalar        occurs 3 times. 
                  05 rezweb-extra-adi             pic x(20).
                  05 rezweb-extra-aciklama         pic x(60).
                  05 rezweb-extra-tl-tutar         pic 9(6)v99.
                  05 rezweb-extra-dv-tutar         pic 9(6)v99.
           02 rezweb-internal-voucher      pic x(30).
           02 rezweb-not                  pic x(100).
           02 rezweb-boslar               pic x(870).
       FD rezodablok LABEL RECORD STANDARD.
       01 rezodablok-REC.
          02 rezodablok-ANAH.
             03 rezodablok-rezno             PIC 9(08).
             03 rezodablok-odano             pic x(4).
          02 rezodablok-tamblok-tar.
             03 rezodablok-tamblok-YIL         PIC 9999.
             03 rezodablok-tamblok-AY          PIC 99.
             03 rezodablok-tamblok-GUN         PIC 99.
          02 rezodablok-tamblok-zaman.
             03 rezodablok-tamblok-saat       PIC 99.
             03 rezodablok-tamblok-dakika     PIC 99.
          02 rezodablok-tamblok-staf   pic x(4).
          02 rezodablok-tamblok-not    pic x(20).
          02 rezodablok-qtar.
             03 rezodablok-qtar-yil         PIC 9999.
             03 rezodablok-qtar-ay          PIC 99.
             03 rezodablok-qtar-gun         PIC 99.
           02 rezodablok-qtar-zaman.
             03 rezodablok-qtar-saat       PIC 99.
             03 rezodablok-qtar-dakika     PIC 99.
         
          02 rezodablok-readytar.
             03 rezodablok-readytar-YIL         PIC 9999.
             03 rezodablok-readytar-AY          PIC 99.
             03 rezodablok-readytar-GUN         PIC 99.
           02 rezodablok-readytar-zaman.
             03 rezodablok-readytar-saat       PIC 99.
             03 rezodablok-readytar-dakika     PIC 99.
           02 rezodablok-cintar.
             03 rezodablok-cintar-YIL         PIC 9999.
             03 rezodablok-cintar-AY          PIC 99.
             03 rezodablok-cintar-GUN         PIC 99.
           02 rezodablok-cintar-zaman.
             03 rezodablok-cintar-saat       PIC 99.
             03 rezodablok-cintar-dakika     PIC 99.
           02 rezodablok-boztar.
             03 rezodablok-boztar-YIL         PIC 9999.
             03 rezodablok-boztar-AY          PIC 99.
             03 rezodablok-boztar-GUN         PIC 99.
           02 rezodablok-boztar-zaman.
             03 rezodablok-boztar-saat       PIC 99.
             03 rezodablok-boztar-dakika     PIC 99.
           02 rezodablok-boz-staf    pic x(4).
           02 rezodablok-qstaf               pic xxxx.
         02 rezodablok-bos      pic x(95).
         02 rezodablok-staf pic x(4).
