       FD rezgrup LABEL RECORD STANDARD.
       01 rezgrup-REC.
          02 rezgrup-ANAHTAR.
             03 rezgrup-kodu      PIC 9(6).
          02 rezgrup-diger.
             03 rezgrup-adi           Pic x(20).
             03 rezgrup-sirket        pic x(5).
             03 rezgrup-acenta        pic x(04).
             03 rezgrup-gel-tar       pic 9(08).
             03 rezgrup-gel-tar-fark  pic 9.
             03 rezgrup-git-tar       pic 9(08).
             03 rezgrup-git-tar-fark  pic 9.
             03 rezgrup-not1          pic x(20).
             03 rezgrup-not1-fark      pic 9.
             03 rezgrup-not2          pic x(18).
             03 rezgrup-not2-fark      pic 9.
             
             03 rezgrup-konumlar occurs 40 times.
               05 rezgrup-sng-top-fiyat  pic 99999999v99.
               05 rezgrup-dbl-top-fiyat  pic 99999999v99.
               05 rezgrup-trp-top-fiyat  pic 99999999v99.
               05 rezgrup-sng-say       pic 999.
               05 rezgrup-sng-fiy       pic 9999v99.
               05 rezgrup-dbl-say       pic 999.
               05 rezgrup-dbl-fiy       pic 9999v99.
               05 rezgrup-trp-say       pic 999.
               05 rezgrup-trp-fiy       pic 9999v99.
               05 rezgrup-sng-say-fark  pic 9.
               05 rezgrup-sng-fiy-fark  pic 9.
               05 rezgrup-dbl-say-fark  pic 9.
               05 rezgrup-dbl-fiy-fark  pic 9.
               05 rezgrup-trp-say-fark  pic 9.
               05 rezgrup-trp-fiy-fark  pic 9.
               05 rezgrup-sng-rez-no  pic 9(8) occurs 400 times comp-3.
               05 rezgrup-dbl-rez-no  pic 9(8) occurs 400 times comp-3.
               05 rezgrup-trp-rez-no  pic 9(8) occurs 400 times comp-3.
               
