*
 copy "genel.lib".
 copy "odalar.lib".
 copy "genelfis.lib".
 copy "rout.lib".
 copy "depkod.lib".
 copy "errorlog.lib".
 copy "logindex.lib".
 copy "kodlar02.lib".
 copy "konuk.lib".
 copy "rez.lib".
 copy "onbkodlar10.lib".
