*-> Onburo copyler
    COPY "genel.lib".
    copy "genelfis.lib".
    copy "errorlog.lib".
    copy "logindex.lib".
    copy "konuk.lib".
    copy "exthrk.lib".
    copy "romhrk.lib".
    copy "isyeri.lib".
    copy "kllnc.lib".
    copy "odalar.lib".
    copy "kodlar02.lib".
    copy "kur.lib".
    copy "depkod.lib".
    copy "onkasa.lib".

