       FD sathrk LABEL RECORD STANDARD.
       01 sathrk-rec.
          02 sathrk-anah.
             03 sathrk-alt-anah.
               04 sathrk-fis-no           pic 9(8).
               04 sathrk-tesis-kodu       pic xx.
             03 sathrk-acenta-kodu      pic x(04).
          02 sathrk-diger.
             03 sathrk-anlasma-tar.
                04 sathrk-anlasma-yil pic 9(4).
                04 sathrk-anlasma-ay  pic 9(2).
                04 sathrk-anlasma-gun pic 9(2).
             03 sathrk-sat-bas-tar.
                04 sathrk-sat-bas-yil pic 9(4).
                04 sathrk-sat-bas-ay  pic 9(2).
                04 sathrk-sat-bas-gun pic 9(2).
             03 sathrk-sat-bit-tar.
                04 sathrk-sat-bit-yil pic 9(4).
                04 sathrk-sat-bit-ay  pic 9(2).
                04 sathrk-sat-bit-gun pic 9(2).
             03 sathrk-kon-bas-tar.
                04 sathrk-kon-bas-yil pic 9(4).
                04 sathrk-kon-bas-ay  pic 9(2).
                04 sathrk-kon-bas-gun pic 9(2).
             03 sathrk-kon-bit-tar.
                04 sathrk-kon-bit-yil pic 9(4).
                04 sathrk-kon-bit-ay  pic 9(2).
                04 sathrk-kon-bit-gun pic 9(2).
             03 sathrk-ind-yuzde      pic 9(3)v99.
             03 sathrk-ind-tip        pic x.
             03 sathrk-durumu         pic x.  | S-Iptal
             03 sathrk-grup-kodu      pic xx.
             03 sathrk-mail-konu      pic x(200).
             03 sathrk-mevcut-sat-bas-tar.
                04 sathrk-mevcut-sat-bas-yil pic 9(4).
                04 sathrk-mevcut-sat-bas-ay  pic 9(2).
                04 sathrk-mevcut-sat-bas-gun pic 9(2).
             03 sathrk-mevcut-sat-bit-tar.
                04 sathrk-mevcut-sat-bit-yil pic 9(4).
                04 sathrk-mevcut-sat-bit-ay  pic 9(2).
                04 sathrk-mevcut-sat-bit-gun pic 9(2).
             03 sathrk-mevcut-kon-bas-tar.
                04 sathrk-mevcut-kon-bas-yil pic 9(4).
                04 sathrk-mevcut-kon-bas-ay  pic 9(2).
                04 sathrk-mevcut-kon-bas-gun pic 9(2).
             03 sathrk-mevcut-kon-bit-tar.
                04 sathrk-mevcut-kon-bit-yil pic 9(4).
                04 sathrk-mevcut-kon-bit-ay  pic 9(2).
                04 sathrk-mevcut-kon-bit-gun pic 9(2).
             03 sathrk-mevcut-ind-yuzde      pic 9(3)v99.
             03 sathrk-kayit-edildi          pic 9.
             03 sathrk-kayit-staf            pic x(4).
             03 sathrk-kayit-tarih.
               04 sathrk-kayit-yil      pic 9999.
               04 sathrk-kayit-ay       pic 99.
               04 sathrk-kayit-gun      pic 99.
             03 sathrk-mail-staf           pic x(4).
             03 sathrk-mail-gon-tarih.
                04 sathrk-mail-gon-yil   pic 9999.
                04 sathrk-mail-gon-ay    pic 99.
                04 sathrk-mail-gon-gun   pic 99.
             03 sathrk-iptal-staf   pic x(4).
             03 sathrk-iptal-tarih. 
                04 sathrk-iptal-yil   pic 9999. 
                04 sathrk-iptal-ay    pic 99. 
                04 sathrk-iptal-gun   pic 99.
             03 sathrk-dosya-yolu     pic x(256).
             03 sathrk-mail-aciklama  pic x(500) occurs 10 times.
             03 sathrk-bos            pic x(0796).
          