*
 COPY "dokumer.lib".
 COPY "genel.lib".
* COPY "kodlar02.lib".
 copy "onbkodlar10.lib".
 COPY "genelfis.lib".
 copy "konum.lib".
 copy "odalar.lib".
 copy "acenta.lib".
*
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
