       FD SAYAC LABEL RECORD STANDARD.
       01 SAYAC-REC.
          02 SAYAC-ANAH.
             03 SAYAC-KODU       PIC 9(02).
          02 SAYAC-ADI           PIC X(30).
          02 SAYAC-DEGER         PIC 9(09)V99999.
          02 SAYAC-BOS           PIC X(500).
          02 SAYAC-STAF          PIC X(04).
