
         COPY "genelfis.lib".
         COPY "genel.lib".
         COPY "dokumer.lib" OF "..\..\OTEL\LIB-SEL".
         COPY "doviz.lib" OF "..\..\OTEL\LIB-SEL".
       COPY "errorlog.lib".
        COPY "logindex.lib".  
        copy "sayac.lib".
        copy "sayachrk.lib".
        copy "konuk.lib".  
        COPY "romhrk.lib".
        COPY "onkasa.lib".   
        copy "depkod.lib".
         copy "odalar.lib".
               copy "not.lib".
