       FD SAYACHRK LABEL RECORD STANDARD.
       01 SAYACHRK-REC.
          02 SAYACHRK-ANAH.
             03 SAYACHRK-ODA              PIC X(04).
             03 SAYACHRK-ISLEM-TAR.
                05 SAYACHRK-ISLEM-YIL     PIC 9(04).
                05 SAYACHRK-ISLEM-AY      PIC 9(02).
                05 SAYACHRK-ISLEM-GUN     PIC 9(02).
             03 SAYACHRK-SAYAC-KODU       PIC 9(02).
             03 SAYACHRK-KAYNAK-FOLIO     PIC 9(08).
             03 SAYACHRK-ZAMAN.
                05 SAYACHRK-SAAT          PIC 99.
                05 SAYACHRK-DAKIKA        PIC 99.
                05 SAYACHRK-SANIYE        PIC 99.
          02 SAYACHRK-ILK-ENDEKS          PIC 9(09).
          02 SAYACHRK-SON-ENDEKS         PIC 9(09).
          02 SAYACHRK-ILK-OKU-TAR.
                03 SAYACHRK-ILK-OKU-YIL   PIC 9(04).
                03 SAYACHRK-ILK-OKU-AY    PIC 9(02).
                03 SAYACHRK-ILK-OKU-GUN   PIC 9(02).
          02 SAYACHRK-SON-OKU-TAR.
                03 SAYACHRK-SON-OKU-YIL   PIC 9(04).
                03 SAYACHRK-SON-OKU-AY    PIC 9(02).
                03 SAYACHRK-SON-OKU-GUN   PIC 9(02).
          02 SAYACHRK-ISKONTO-TUTAR       PIC 9(09)V99.
          02 SAYACHRK-KAPALI              PIC 9.
          02 SAYACHRK-AD-SOYAD            PIC X(100).
          02 SAYACHRK-FOLIO-ISLENDI       PIC 9.
          02 SAYACHRK-BOS                 PIC X(499).
          02 SAYACHRK-STAF                PIC X(04).
