FD  SEHIR  LABEL RECORD IS STANDARD.
 01 SEHIR-REC.
     02 SEHIR-ANAH.
         03 SEHIR-ANAH1       PIC  XXX.
     02 SEHIR-ADI         PIC  X(20).
     02 SEHIR-TUR-KODU    PIC  99.
     02 SEHIR-ulke        PIC  X(05).
     02 SEHIR-BOS         PIC  X(05).
     02 SEHIR-STAF        PIC  X(04).
