       FD sejkkod LABEL RECORD STANDARD.
       01 sejkkod-REC.
           02 sejkkod-anah.
              03 sejkkod-kodu           pic x(50).
           02 sejkkod-diger.
              03 sejkkod-sifre          pic x(50).
              03 sejkkod-paximum-id     pic x(50).
              03 sejkkod-hotel-id       pic x(200).
              03 sejkkod-ref            pic 9.
              03 sejkkod-bos            pic x(299).
          
