       FD sejkar LABEL RECORD STANDARD.
       01 sejkar-REC.
           02 sejkar-anah. ||250 byte dan buyuk olamaz derlemede hata veriyor
              03 sejkar-acenta        pic x(120).
              03 sejkar-tip           pic x.|A-Acenta,D-Doviz,P-Pansiyon
              03 sejkar-kodu          pic x(119).
              03 sejkar-ref           pic x.
           02 sejkar-diger.
              03 sejkar-adi           pic x(200).
              03 sejkar-asya-kodu     pic x(5).
              03 sejkar-bos           pic x(500).

          
