fd skart label record standard.
01 skart-rec.
  02 skart-anah.
      03 skart-no               pic x(07).
      03 skart-tarih            pic 9(8).
      03 skart-saat             pic 9(6).
   02 skart-data.
   03 skart-kim.
      04 skart-tipi          pic x.
         88 skart-musteri value "M".
         88 skart-odenmez value "O".
         88 skart-ikram   value "I".

         88 skart-tip-gecerli values are "M","O","I".
      04 skart-folio         pic 9(08).
   03 skart-durumu           pic x.
   03 skart-cin.
      04 skart-cin-yil       pic 9(04).
      04 skart-cin-ay        pic 9(02).
      04 skart-cin-gun       pic 9(02).
   03 skart-cot.
      04 skart-cot-yil       pic 9(04).
      04 skart-cot-ay        pic 9(02).
      04 skart-cot-gun       pic 9(02).
   03 skart-ind              pic 9(02).
   03 skart-tutar            pic s9(12)v99 comp-3.
   03 skart-limit            pic s9(12)v99 comp-3.
   03 skart-limit-uyari      pic x.
   03 skart-happy            pic x.
   03 skart-happy-ind        pic x.
      88 skart-happyde-happy-indirim     value "H".
      88 skart-happyde-kart-indirim      value "K".
      88 skart-happyde-tum-indirim       value "T".
   03 skart-aciklama         pic x(050).
   03 skart-kisi.
      04 skart-buyuk         pic 9(2).
      04 skart-kucuk         pic 9(2).
      04 skart-free          pic 9(2).
   03 skart-sira             pic x(002).
   03 skart-staf             pic x(4).
   03 skart-silen-staf       pic x(4).
   03 skart-nereden-silindi  pic x.
   03 skart-bos              pic x(035).

*/kart-tipi       => [O]->Odenmez [I]->Ikram [M]->Musteri
*/kart-durumu     => [I]->Iceride [S]->Silinmis veya C/Out
