          FD SMSLISTE LABEL RECORD STANDARD.
          01 smsliste-rec.
            02 smsliste-genel-anah.
             03 smsliste-tip              pic x. 
             03 smsliste-nereden          pic x.
             03 smsliste-anah             pic x(20).
             03 smsliste-zaman. 
                05 smsliste-saat          pic 99.
                05 smsliste-dakika        pic 99.
                05 smsliste-saniye        pic 99.
            02 smsliste-gon-tar.
             03 smsliste-gon-yil          pic 9999.
             03 smsliste-gon-ay           pic 99.
             03 smsliste-gon-gun          pic 99.
           02 smsliste-gon-zaman.
             03 smsliste-gon-saat         pic 99.
             03 smsliste-gon-dak          pic 99.
            02 smsliste-gon-numara        pic x(15).
            02 smsliste-gon-kisi          pic x(20).
            02 smsliste-gon-profil.
             03 smsliste-gon-profil-sirket pic x(8).
             03 smsliste-gon-profil-no     pic 9(8).
            02 smsliste-gon-mesaj          pic x(200).
            02 smsliste-tutar              pic 9(9)v99.
            02 smsliste-dov-tutar          pic 9(9)v99.
            02 smsliste-sms-tar.
             03 smsliste-sms-yil      pic 9999.
             03 smsliste-sms-ay       pic 99.
             03 smsliste-sms-gun      pic 99.
            02 smsliste-donus-kodu         pic x(15).
            02 smsliste-gonderildi-mi      pic 9.
            02 smsliste-gidecek-tar.
             03 smsliste-gidecek-yil       pic 9999.
             03 smsliste-gidecek-ay        pic 99.
             03 smsliste-gidecek-gun       pic 99.
            02 smsliste-gidecek-zaman.
             03 smsliste-gidecek-saat      pic 9999.
             03 smsliste-gidecek-dakika    pic 99.
            02 smsliste-sadece-devre-hisse pic 9.
            02 smsliste-bos                pic x(300).
            02 smsliste-staf               pic x(4).

      *    smsliste-tip        "M" or "S" sms yada mail
      *    smsliste-nereden    "R" or "D" rezervasyon - deremulk
      *    smsliste-anah       devremulk veya rezervasyon no
