       FD SMSTAN LABEL RECORD STANDARD.
        01 smstan-rec.
          02 smstan-anah.
             03 smstan-tip           pic x. 
             03 smstan-kodu          pic 9(4).
          02 smstan-baslik           pic x(30).
          02 smstan-gon-ileti        pic x(160).
          02 smstan-nereden          pic 99.
          02 smstan-staf             pic x(4).
          02 smstan-bos              pic x(200).
