         COPY "genelfis.lib".
         COPY "genel.lib".
         COPY "soru.lib".
         COPY "kllnc.lib".
         COPY "dokumer.lib".
         COPY "odalar.lib".
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
