       FD SORU LABEL RECORD STANDARD.
       01 SORU-REC.
          02 SORU-KODU          PIC 9(02).
          02 SORU1              PIC X(13).
          02 soru1-kat          pic 99.
          02 SORU2              PIC X(13).
          02 soru2-kat          pic 99.
          02 SORU3              PIC X(13).
          02 soru3-kat          pic 99.
          02 SORU4              PIC X(13).
          02 soru4-kat          pic 99.
          02 SORU5              PIC X(13).
          02 soru5-kat          pic 99.
          02 soru-basari        pic x.
          02 SORU-STAF          PIC X(03).
