          FD sozhrk LABEL RECORD STANDARD.
          01 sozhrk-REC.
            02 sozhrk-ANAH.
                 03 sozhrk-devremulk-no pic 9(8).
                 03 sozhrk-oda          pic x(04).
                 03 sozhrk-yil          PIC 9(04).
                 03 sozhrk-anlasma-tarih.
                    04 sozhrk-anlasma-yil  pic 9(04).
                    04 sozhrk-anlasma-ay   pic 9(02).
                    04 sozhrk-anlasma-gun  pic 9(02).
            02 sozhrk-diger.
               03 sozhrk-adi               pic x(40). 
               03 sozhrk-soyadi            pic x(40).
               03 sozhrk-profil-anah.
                   04 sozhrk-profil-sirket pic x(08).
                   04 sozhrk-profil-no     pic 9(08).
               03 sozhrk-kira-tutar        pic 9(08)v99.
               03 sozhrk-kira-doviz-kodu   pic 9(02).
               03 sozhrk-aidat-durum       pic 9.
               03 sozhrk-aidat-aciklama    pic x(100).
               03 sozhrk-sayac-durum       pic 9.
               03 sozhrk-sayac-aciklama    pic x(100).
               03 sozhrk-aciklama          pic x(500).
               03 sozhrk-cikti-adres       pic x(100).
               03 sozhrk-BOS               PIC X(500).
               03 sozhrk-STAF              PIC X(4).

      
