          FD soztar LABEL RECORD STANDARD.
          01 soztar-REC.
            02 soztar-ANAH.
                 03 soztar-devremulk-no pic 9(8).
                 03 soztar-oda          pic x(04).
                 03 soztar-yil          PIC 9(04).
                 03 soztar-anlasma-tarih.
                    04 soztar-anlasma-yil  pic 9(04).
                    04 soztar-anlasma-ay   pic 9(02).
                    04 soztar-anlasma-gun  pic 9(02). 
                 03 soztar-sira         pic 9(02).
            02 soztar-bas-tarih.
                 03 soztar-bas-yil      pic 9(04).
                 03 soztar-bas-ay       pic 9(02).
                 03 soztar-bas-gun      pic 9(02).
            02 soztar-bit-tarih.
                 03 soztar-bit-yil      pic 9(04).
                 03 soztar-bit-ay       pic 9(02).
                 03 soztar-bit-gun      pic 9(02).
            02 soztar-BOS               PIC X(500).
            02 soztar-STAF              PIC X(4).

      
