*
 FD sprohrk LABEL RECORD STANDARD.
 01 sprohrk-REC.
   02 sprohrk-anah.
      03 sprohrk-profil-anah.
        05 sprohrk-profil-sirket      pic x(8).
        05 sprohrk-profil-no          pic 9(8).
      03 sprohrk-rez-anah.
        05 sprohrk-rez-sirket         pic x(8).
        05 sprohrk-rez-no             pic 9(8).
        05 sprohrk-rez-sira           pic 99.
   02 sprohrk-pro-adi                 pic x(20).
   02 sprohrk-pro-soyadi              pic x(20).         
   02 sprohrk-acenta                  pic x(4).
   02 sprohrk-gel-tar.
      03 sprohrk-gel-yil              pic 9(4).
      03 sprohrk-gel-ay               pic 9(2).
      03 sprohrk-gel-gun              pic 9(2).
   02 sprohrk-git-tar.
      03 sprohrk-git-yil              pic 9(4).
      03 sprohrk-git-ay               pic 9(2).
      03 sprohrk-git-gun              pic 9(2). 
   02 sprohrk-banka                   pic x(02).
   02 sprohrk-doviz                   pic x(02).
   02 sprohrk-pans                    pic x(02).
   02 sprohrk-pazar                   pic x(02).
   02 sprohrk-ulke                    pic x(03).
   02 sprohrk-voucher                 pic x(10).
   02 sprohrk-t-oda-fiyati            pic 9(7)v99.
   02 sprohrk-t-ext-fiyati            pic 9(7)v99.
   02 sprohrk-odano                   pic x(04).
   02 sprohrk-r-folio                 pic 9(08).
   02 sprohrk-e-folio                 pic 9(08).
   02 sprohrk-anlasma                 pic x(02).
   02 sprohrk-kur-deg                 PIC 9(9)V9(05) COMP-3.
   02 sprohrk-duz-tarih.
     03 sprohrk-duz-yil               pic 9(4).
     03 sprohrk-duz-ay                pic 9(2).
     03 sprohrk-duz-gun               pic 9(2).
   02 sprohrk-durum                   pic x.
   02 sprohrk-bos                     pic x(50).

 
