       FD takas-blok LABEL RECORD STANDARD.
       01 takas-blok-REC.
          02 takas-blok-ANAHTAR.
             03 takas-blok-kodu      PIC 9(6).
             03 takas-blok-tarih.
                04 takas-blok-yil    pic 9(4).
                04 takas-blok-ay     pic 9(2).
                04 takas-blok-gun    pic 9(2).
             03 takas-blok-konum     pic x(2).
             03 filler         pic x(15).
          02 takas-blok-bilgiler.
             03 takas-blok-ayrilan.
                04 takas-blok-ayrilan-oda   pic s9(4).
                04 takas-blok-ayrilan-pax   pic s9(4).
                04 takas-blok-ayrilan-child pic 9(4).
                04 takas-blok-ayrilan-free  pic 9(4).
                04 takas-blok-ayrilan-tutar pic 9(12)v9(2).
             03 takas-blok-satilan.
                04 takas-blok-satilan-oda   pic s9(4).
                04 takas-blok-satilan-pax   pic s9(4).
                04 takas-blok-satilan-child pic 9(4).
                04 takas-blok-satilan-free  pic 9(4).
                04 takas-blok-satilan-tutar pic 9(12)v9(2).
             03 takas-blok-kalan.
                04 takas-blok-kalan-oda     pic s9(4).
                04 takas-blok-kalan-pax     pic s9(4).
                04 takas-blok-kalan-child   pic 9(4).
                04 takas-blok-kalan-free    pic 9(4).
                04 takas-blok-kalan-tutar   pic 9(12)v9(2).
                04 takas-blok-gir-oda       pic s9(4).
                04 takas-blok-cik-oda       pic s9(4).
                04 takas-blok-gir-pax       pic 9(4).
                04 takas-blok-cik-pax       pic 9(4).
          02 filler                   pic x(34) .
************************************
          copy "break.lib" .         
