*
 COPY "dokumer.lib".
 COPY "genel.lib".
 COPY "grup.lib".
 COPY "genelfis.lib".
*
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
