       FD facenta LABEL RECORD STANDARD.
       01 facenta-rec.
          02 facenta-anah.
             03 facenta-karsi-kodu        pic x(20).
          02 facenta-asya-kodu            pic x(4).

