*******************
 fd takcari label record standard.
  01 takcari-rec.
       02 takcari-anah.
          05 takcari-kodu              pic x(20).
       02 takcari-vergino               pic x(15).
 
