*
 COPY "dokumer.lib".
 COPY "genel.lib".
 COPY "grup.lib".
 COPY "genelfis.lib".
 COPY "kodlar02.lib".
 COPY "odalar.lib".
*
 COPY "errorlog.lib".                                                    
 COPY "logindex.lib".                                                    
