       COPY "takvim.lib".
       COPY "genel.lib".
       COPY "genelfis.lib".
       COPY "takip.lib"   REPLACING =='takip'== BY ==takip==.
       COPY "grup.lib".
       COPY "odalar.lib".
       COPY "errorlog.lib".
       COPY "logindex.lib".
       COPY "dokumer.lib".
       COPY "kllnc.lib".
       fd takas label record standard.
       01 takas-rec.
          02 takas-anah          pic x(4).
          02 takas-adet          pic 9(15).
