       COPY "takvim.lib".
       COPY "genel.lib".
       COPY "genelfis.lib".
       COPY "takip.lib"   REPLACING =='takip'== BY ==takip==.
       COPY "grup.lib".
       COPY "odalar.lib".
       COPY "errorlog.lib".
       COPY "logindex.lib".
       COPY "dokumer.lib".
       COPY "kllnc.lib".
       copy "konum.lib".
       copy "konuk.lib".

