       FD TAKSIT LABEL RECORD STANDARD.
        01 taksit-rec.
          02 taksit-anah.
             03 taksit-devremulk-no                     pic 9(08). 
             03 taksit-sira                             pic 999.
             03 taksit-anah-bos                         pic x(20).
          02 taksit-data.
             03 taksit-tarih.
                05 taksit-tarih-yil                     pic 9999.
                05 taksit-tarih-ay                      pic 99.
                05 taksit-tarih-gun                     pic 99.
             03 taksit-hareket-turu                     pic x. |GELIR
             03 taksit-islem-turu                       pic xx.|SATIS ODEMESI 
             03 taksit-tutar                            pic s9(12)v99.
             03 taksit-tutar-dv                         pic s9(12)v99.
             03 taksit-odeme-turu                       pic xx.|nakit kk cek
             03 taksit-sekli                            pic x.|taksit - peþinat
             03 taksit-odenen                           pic s9(12)v99.
             03 taksit-kalan                            pic s9(12)v99.
             03 taksit-satan-danisman                   pic 9(5).
             03 taksit-odeme-tar.
                05 taksit-odeme-yil                     pic 9999.
                05 taksit-odeme-ay                      pic 99.
                05 taksit-odeme-gun                     pic 99.
             03 taksit-iptal                            pic 9.
             03 taksit-kesin-odenen                     pic s9(8)v99.
             03 taksit-kesin-kalan                      pic s9(8)v99.             
             03 taksit-bos                              pic x(080).
             03 taksit-staf                             pic x(4).

                                                                       
         
