       FD takvim2 LABEL RECORD STANDARD.
       01 takvim2-REC.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=takvim2_ANAH
          02 takvim2-ANAH.
             03 takvim2-YIL       PIC 9999.
             03 takvim2-AY        PIC 99.
             03 takvim2-GUN       PIC 99.
          02 takvim2-KACINCI      PIC 999.
          02 takvim2-GUN-ADI      PIC 9.
          02 takvim2-MESAI-TATIL  PIC X.
          02 takvim2-TOP-ODA      PIC 9999 COMP-3.
          02 takvim2-HAZIR-ODA    PIC 9999 COMP-3.
          02 takvim2-SATILAN OCCURS 40 TIMES. 
************             03 filler occurs 4 times .
                07 takvim2-SAT-ODA      PIC 9999 COMP-3.
                07 takvim2-SAT-KISI.
                   09 takvim2-SAT-BUYUK PIC 9999 COMP-3.
                   09 takvim2-SAT-KUCUK PIC 9999 COMP-3.
                   09 takvim2-SAT-FREE  PIC 9999 COMP-3.
          
         02 takvim2-konumlar occurs 40 times.
            05 takvim2-konum-oda    pic s9999.
            05 takvim2-konum-oda2   pic s9999.
          02 takvim2-HAZIR-ODA2 PIC s9999.
          02 takvim2-HAZIR-YATAK2   PIC s9999.
          02 takvim2-SIRKET         PIC X(8).
          02 filler occurs 9 times.
             05 takvim2-ref-hazir-oda   pic 9999.  
             05 takvim2-ref-hazir-yatak pic 9999.   
          02 filler pic x(445).
          02 takvim2-HAZIR-YATAK   PIC s9999.
          02 takvim2-posting      pic 9. 
          02 takvim2-BOS          PIC X(14).
*******> takvim2-TOP-ODA    => O tarihteki toplam oda sayisi
*******> takvim2-HAZIR-ODA  => O tarihteki toplam satisa hazir oda sayisi
*******> takvim2-SAT-ODA    => O tarihteki toplam satilan oda sayisi
*******> takvim2-SAT-KISI   => O tarihteki toplam satilan pax(Buyuk,Kucuk,Free)

