         COPY "takvim.lib".
       COPY "errorlog.lib".
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".  
       COPY "genel.lib".   
       COPY "odalar.lib".                                                                                                                                                       
