       FD TAKVIM LABEL RECORD STANDARD.
       01 TAKVIM-REC.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=TAKVIM_ANAH
          02 TAKVIM-ANAH.
             03 TAKVIM-YIL       PIC 9999.
             03 TAKVIM-AY        PIC 99.
             03 TAKVIM-GUN       PIC 99.
          02 TAKVIM-KACINCI      PIC 999.
          02 TAKVIM-GUN-ADI      PIC 9.
          02 TAKVIM-MESAI-TATIL  PIC X.
          02 TAKVIM-TOP-ODA      PIC 9999 COMP-3.
          02 TAKVIM-HAZIR-ODA    PIC 9999 COMP-3.         
          02 TAKVIM-SATILAN OCCURS 40 TIMES.      
                07 TAKVIM-SAT-ODA      PIC 9999 COMP-3.
                07 TAKVIM-SAT-KISI.     
                   09 TAKVIM-SAT-BUYUK PIC 9999 COMP-3.      
                   09 TAKVIM-SAT-KUCUK PIC 9999 COMP-3.     
                   09 TAKVIM-SAT-FREE  PIC 9999 COMP-3.          
         02 takvim-konumlar occurs 40 times.
            05 takvim-konum-oda    pic s9999.
            05 takvim-konum-oda2   pic s9999.
          02 TAKVIM-HAZIR-ODA2 PIC s9999.
          02 TAKVIM-HAZIR-YATAK2   PIC s9999.
          02 TAKVIM-SIRKET         PIC X(8).
          02 filler2 occurs 9 times.
             05 takvim-ref-hazir-oda   pic 9999.  
             05 takvim-ref-hazir-yatak pic 9999. 
          02 takvim-onbmah1     pic 9.
          02 takvim-onbmah2     pic 9.
          02 takvim-kasamah     pic 9.
          02 filler2 occurs 9 times.
              05 takvim-ref-hazir-oda2   pic 9999.  
              05 takvim-ref-hazir-yatak2 pic 9999. 
          02 filler pic x(370).
          02 TAKVIM-HAZIR-YATAK   PIC s9999.
          02 takvim-posting       pic x. 
          02 TAKVIM-BOS           PIC X(14).
*******> TAKVIM-TOP-ODA    => O tarihteki toplam oda sayisi
*******> TAKVIM-HAZIR-ODA  => O tarihteki toplam satisa hazir oda sayisi
*******> TAKVIM-SAT-ODA    => O tarihteki toplam satilan oda sayisi
*******> TAKVIM-SAT-KISI   => O tarihteki toplam satilan pax(Buyuk,Kucuk,Free)

