         
         COPY "genel.lib".

        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".
        copy "odalar.lib". 
      $XFD FILE =takvim 
        COPY "takvim.lib".                                  
