fd telayar LABEL RECORD STANDARD.
01 telayar-rec.
    05 telayar-anah.
       10 telayar-odano     pic x(04).
       10 telayar-folio     pic 9(08).
       10 telayar-tarih     pic x(08).
       10 telayar-saat      pic 9(08).
       10 telayar-islem     pic xx.
       10 telayar-param     pic x(30).
    05 telayar-adi      pic x(20).
    05 telayar-soy       pic x(20).

    05 telayar-bos       pic x(60).
  