fd telayaru LABEL RECORD STANDARD.
01 telayaru-rec.
    05 telayaru-anah.
       10 telayaru-odano     pic x(04).
       10 telayaru-folio     pic 9(08).
       10 telayaru-tarih      pic x(08).
       10 telayaru-saat      pic x(08).
       10 telayaru-islem     pic xx.
       10 telayaru-param     pic x(30).
    05 telayaru-adi       pic x(20).
    05 telayaru-soy       pic x(20).
    05 telayaru-bos       pic x(60).
   