FD TELKOD LABEL RECORD STANDARD.
01 TELKOD-REC.
   02 TELKOD-ANAH.
      03 TEL-ODA      PIC X(04).
   02 TEL-TIPI        PIC X.
      88 MUSTERI      VALUE "M","m".
      88 PERSONEL     VALUE "P","p".
      88 ODENMEZ      VALUE "O","o".
      88 DIGER        VALUE "D","d".
      88 H-K-KAYDI    VALUE "H","h".
   02 TEL-ONB-ODA     PIC X(04).
   02 TEL-ADI         PIC X(20).
   02 TEL-SOY         PIC X(20).
   02 TEL-INDIRIM     PIC 99V99.
   02 TEL-NO-POST     PIC 9.
   02 TEL-BOS         PIC X(45).
   02 TEL-STAF        PIC X(04).
