       FD telkont LABEL RECORD STANDARD.
       01 telkont-REC.
          02 telkont-ANAH.
             
             03 telkont-no     PIC X(20).
                   
          02 telkont-islem    pic xx.
          02 telkont-islem-no     PIC X(25).
        
*******> T-Temizlik baslama saati- maidin odaya giris zamani


          02 telkont-tarih        pic x(8).
          02 telkont-BOS          PIC X(15).
          02 telkont-STAF         PIC X(04).
