*
         COPY "genelfis.lib".
         COPY "genel.lib".
         COPY "telkod.lib".
         COPY "dokumer.lib".
         copy "odalar.lib".
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
