         COPY "genelfis.lib".
         COPY "genel.lib".
         COPY "telkod.lib".
         COPY "kllnc.lib".
         COPY "dokumer.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".   
       COPY "odalar.lib".                                                                                                     
