         COPY "genelfis.lib".
         COPY "genel.lib".
         COPY "dokumer.lib".
         fd tel-err label record standard.
         01 tel-err-rec   pic x(150).

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".   
       COPY "odalar.lib".                                                                                                     
