*
 FD tezkod02 LABEL RECORD STANDARD.
 01 tezkod02-REC.
    02 tezkod02-ANAH.
       03 tezkod02-TIPI                 PIC X.
       03 tezkod02-KODU                 PIC X(02).
       03 tezkod02-karsi-anah           pic x(200).
    02 tezkod02-entegre-adi             PIC X(100).
    02 tezkod02-asya-kodu               PIC X(04).
    02 tezkod02-k-adi                   pic x(20).
    02 tezkod02-k-sifre                 pic x(20).
    02 tezkod02-asya-acenta-kodu        pic x(04).
    02 tezkod02-asya-pan-kodu           pic xx.
    02 tezkod02-musaitlik-devrede       pic 9.
    02 tezkod02-bos                     pic x(202).

