*
 COPY "dokumer.lib".
 COPY "genel.lib".
 COPY "tezkod02.lib".
 copy "kodlar02.lib".
 COPY "genelfis.lib".
 copy "konum.lib".
  copy "odalar.lib".
*
        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
