         COPY "takvim.lib".
         COPY "genelfis.lib".
         COPY "genel.lib".
         COPY "rez.lib".
         COPY "banka.lib".
         COPY "doviz.lib".
         COPY "acenta.lib".
         COPY "cast.lib".
         COPY "dokumer.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
