       FD tkonuk LABEL RECORD STANDARD.
       01 tkonuk-REC.
          02 tkonuk-ANAH.
             03 tkonuk-FOLIO         PIC 9(08).
          02 tkonuk-DURUMU           PIC X.
*********> tkonuk-Durumu   => Folionun iceridemi yoksa histroyde mi oldugunu
*********> belirtir...I-> Iceride H->Historyde Gibi............
          02 tkonuk-FOL-KODU         PIC X.
*********> tkonuk-Fol-Kodu => R-> Oda E-> Extra T-> Telefon G-> Grup B-> Bos
          02 tkonuk-ADI              PIC X(20).
          02 tkonuk-SOYADI           PIC X(20).
          02 tkonuk-S-D-T-G          PIC 9.
          02 tkonuk-ODA-KONUMU       PIC 99.
          02 tkonuk-ODEME-TIPI       PIC XX.
          02 tkonuk-ODANO            PIC X(04).
          02 tkonuk-REZ-NO           PIC 9(08).
          02 tkonuk-ULKE             PIC XXX.
          02 tkonuk-KISI.
             03 tkonuk-BUYUK         PIC 9(02).
             03 tkonuk-KUCUK         PIC 9(02).
             03 tkonuk-BEBEK         PIC 9(01).
             03 tkonuk-FREE          PIC 9(01).
          02 tkonuk-ACENTA           PIC X(04).
          02 tkonuk-mini-ok          pic 9.
          02 tkonuk-plan             pic 9.
          02 tkonuk-duzeltme         pic 9.
          02 tkonuk-bos3             PIC X(01).
          02 tkonuk-VOUCHER          PIC X(30).
          02 tkonuk-NOR-INDIRIM      PIC 99V99.
          02 tkonuk-PAN-TIPI         PIC XX.
          02 tkonuk-REZ-TIPI         PIC 9.
          02 tkonuk-BANKA            PIC 99.
          02 tkonuk-DOVIZ            PIC 99.
          02 tkonuk-ANLASMA          PIC XX.
          02 tkonuk-KUR-AYGUN        PIC X.
*********> tkonuk-Kur-Aygun = A-> Aybasi Kuru G-> Gunluk kur
          02 tkonuk-FATURA           PIC X.
          02 tkonuk-CIK-CIKMA        PIC X.
          02 tkonuk-ERKEN-CIK        PIC X.
          02 tkonuk-UZATMA           PIC X.
          02 tkonuk-POSTING          PIC X.
          02 tkonuk-VIP              PIC X.
          02 tkonuk-ODADEGIS         PIC X.
*********> tkonuk-Erken-Cik = Early C/Out E/H
*********> tkonuk-Uzatma    = Uzatma      E/H
*********> tkonuk-Posting   = Posting     E/H
*********> tkonuk-Vip       = V-> V.I.P T-> Top V.I.P
*********> tkonuk-Fatura    = E-> Faturasi Kesilmis.. H-> Faturasi Kesilmemis
*********> tkonuk-Cik-Cikma = E-> Musteri Listesi Cik H-> Musteri Listesi Cikma
*********> tkonuk-Odadegis  = E-> Bu Oda Room change yapilmistir.....
          02 tkonuk-ACIK-KAPALI      PIC X.
*********> tkonuk-Acik-kapali = O-> Open C-> Close
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=tkonuk_GEL_TAR
          02 tkonuk-GEL-TAR.
             03 tkonuk-GEL-YIL       PIC 9999.
             03 tkonuk-GEL-AY        PIC 99.
             03 tkonuk-GEL-GUN       PIC 99.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=tkonuk_GIT_TAR
          02 tkonuk-GIT-TAR.
             03 tkonuk-GIT-YIL       PIC 9999.
             03 tkonuk-GIT-AY        PIC 99.
             03 tkonuk-GIT-GUN       PIC 99.
          02 tkonuk-GEL-ZAMAN.
             03 tkonuk-GEL-SAAT      PIC 99.
             03 tkonuk-GEL-DAKIKA    PIC 99.
             03 tkonuk-GEL-SANIYE    PIC 99.
          02 tkonuk-GIT-ZAMAN.
             03 tkonuk-GIT-SAAT      PIC 99.
             03 tkonuk-GIT-DAKIKA    PIC 99.
             03 tkonuk-GIT-SANIYE    PIC 99.

          02 tkonuk-ODA-TUTAR        PIC s9(12)V99   COMP-3.
          02 tkonuk-EXTBED-TUTAR     PIC 9(12)V99   COMP-3.
          02 tkonuk-KAHVALTI-TUTAR   PIC 9(12)V99   COMP-3.
          02 tkonuk-OGLE-TUTAR       PIC 9(12)V99   COMP-3.
          02 tkonuk-AKSAM-TUTAR      PIC 9(12)V99   COMP-3.
          02 tkonuk-ICECEK-TUTAR     PIC 9(12)V99   COMP-3.
          02 tkonuk-EXTRA-TUTAR      PIC 9(12)V99   COMP-3.

          02 tkonuk-TOP-BORC         PIC S9(12)V99  COMP-3.
          02 tkonuk-TOP-ALAC         PIC S9(12)V99  COMP-3.
          02 tkonuk-KUR-DEGERI       PIC 9(9)V9(05) COMP-3.
          02 tkonuk-DV-DEGERI        PIC 9(12)V99   COMP-3.

          02 tkonuk-ACIK.
             03 tkonuk-ACIK-1        PIC X(100).
             03 tkonuk-ACIK-2        PIC X(100).
          02 tkonuk-KARTNO           PIC X(07).
          02 tkonuk-REOPEN           PIC X.
          02 tkonuk-OPERATOR         PIC X(02).
          02 tkonuk-GRUP-NO          PIC 9(06).
          02 tkonuk-al-tar.
             05 tkonuk-al-yil        pic 99.
             05 tkonuk-al-ay         pic 99.
             05 tkonuk-al-gun        pic 99.
**********          02 tkonuk-TOM.
**********              03 tkonuk-TOM-VAR-YOK   PIC X.
**********              03 tkonuk-TOM-ALKOL     PIC 9.
**********              03 tkonuk-TOM-SERINO    PIC X(12).
          02 tkonuk-PAZAR            PIC X(02).
          02 tkonuk-EB               PIC X.
          02 tkonuk-FIYAT-FIX        PIC X.
          02 tkonuk-GELIS-SAYISI     PIC 9(2).
          02 tkonuk-FIYAT-KONUMU     PIC 99.
          02 tkonuk-GEC-GIRIS        PIC 9.
          02 tkonuk-FAT-NO           PIC 9(06).
          02 tkonuk-UG-INDIRIMI      PIC 9.
          02 tkonuk-BILBORD-EH       PIC X.
          02 tkonuk-EXTRA-REZ-NO     PIC 9(08).
          02 tkonuk-TITLE            PIC X(3).
          02 tkonuk-profil-no        pic 9(8).
          02 tkonuk-rehber           pic x(2).
          02 tkonuk-SAFE             PIC 9.
          02 tkonuk-ANAHTAR          PIC 9.
          02 tkonuk-LATE-ZAMAN.
            03 tkonuk-LATE-GEL-SAAT  PIC 99.
            03 tkonuk-LATE-GEL-DAK   PIC 99.
          02 tkonuk-AKSIYON-EH       PIC X.
          02 tkonuk-share            pic 9.
          02 tkonuk-SPECIAL-EH         pic 9.
          02 tkonuk-sehir            pic xxx.
          02 tkonuk-firma            PIC X(05).
          02 tkonuk-stafbos          pic x(4).
          02 tkonuk-sharenum         pic 9(8).
          02 tkonuk-acik-hesap       pic 9.
          02 tkonuk-kapat-tarih.
              05 tkonuk-kapat-yil    pic 9999.
              05 tkonuk-kapat-ay     pic 99.
              05 tkonuk-kapat-gun    pic 99.
          02 tkonuk-kapat-zaman. 
             05 tkonuk-kapat-saat    pic 99.
             05 tkonuk-kapat-dak    pic 99.
             05 tkonuk-kapat-san    pic 99.
          02 tkonuk-cout-staf         pic xxxx.
          02 tkonuk-acik-hesap-staf   pic xxxx.
          02 tkonuk-kapat-staf        pic xxxx.
          02 tkonuk-cin-staf          pic xxxx.
          02 tkonuk-gunsonu-cout      pic 9.
          02 tkonuk-kredi-kart.
             03 tkonuk-kart-tipi     pic x.
             03 tkonuk-kart-no1      pic x(04).
             03 tkonuk-kart-no2      pic x(04).
             03 tkonuk-kart-no3      pic x(04).
             03 tkonuk-kart-no4      pic x(04).
             03 tkonuk-cvv-kodu      pic x(03).
             03 tkonuk-onay-kodu     pic x(15).
             03 tkonuk-onay-tutar    pic 9(7)v99.
             03 tkonuk-onay-doviz    pic x(02).
             03 tkonuk-kart-sahibi   pic x(50).
             03 tkonuk-kart-son-ay   pic 9(2).
             03 tkonuk-kart-son-yil  pic 9(2).
      *    02 tkonuk-bos9             pic x(968).
          02 tkonuk-bos9             pic x(868).
          02 tkonuk-STAF             PIC X(04).
********> tkonuk-Durumu.....Degiskeni  folionun iceridemi yoksa History de mi
********> Oldugunu gosterir.. Anahtar sahalar icin gerekli................
********> I-> Iceride H-> Historyde...........
********> Konum-tom-var-yok => "E" Ise bu folioya ait tom var demektir....
********> Konum-tom-alkol   => Musterinin alkol seviyesini belirler........
********>                 0 => Alkolsuz............
********>                 1 => Az Alkollu..........
********>                 2 => Orta Alkollu........
********>                 3 => Cok Alkollu.........

