       FD TKSREZ1 LABEL RECORD STANDARD.
       01 TKSREZ1-REC.
          02 TKSREZ1-ANAH.
             03 TKSREZ1-NO             PIC 9(08).
          02 TKSREZ1-TIPI              PIC 9.
**********>1->Alotment 2->It 3->Grup 4->Munferit...gibi
          02 TKSREZ1-DURUMU            PIC X.
**********>TKSREZ1-Durumu => TKSREZ1ervasyonun durumunu belirtir....
**********>I->Iceridekir TKSREZ1.  S->Silinmis,Iplat TKSREZ1.
**********>Onemli butun anahtar sahalarda olacak...............
          02 TKSREZ1-ACEN-ANAH.
             03 TKSREZ1-ACENTA         PIC X(4).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=TKSREZ1_GIR_TAR
             03 TKSREZ1-GIR-TAR.
                04 TKSREZ1-GIR-YIL     PIC 9999.
                04 TKSREZ1-GIR-AY      PIC 99.
                04 TKSREZ1-GIR-GUN     PIC 99.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=TKSREZ1_CIK_TAR
             03 TKSREZ1-CIK-TAR.
                04 TKSREZ1-CIK-YIL     PIC 9999.
                04 TKSREZ1-CIK-AY      PIC 99.
                04 TKSREZ1-CIK-GUN     PIC 99.
          02 TKSREZ1-ADI               PIC X(20).
          02 TKSREZ1-SOYADI            PIC X(20).
          02 TKSREZ1-BANKA             PIC 99.
          02 TKSREZ1-DOVIZ             PIC 99.
          02 TKSREZ1-ANLASMA           PIC XX.
          02 TKSREZ1-ODEME-TIPI        PIC XX.
          02 TKSREZ1-PAN-TIPI          PIC XX.
          02 TKSREZ1-ULKE              PIC X(03).
          02 TKSREZ1-VOUCHER           PIC X(30).
          02 TKSREZ1-KUR-AYGUN         PIC X.
**********>A->Ay basi kuru   G->Gunluk Kur....
          02 TKSREZ1-K-G-B             PIC X.
**********>K->Confirme G->Gecici B->Beklemede I-Infox
          02 TKSREZ1-VIP               PIC X.
**********>V->V.I.P    T->Top V.I.P
          02 TKSREZ1-KOMISYON          PIC 99.
**********>TKSREZ1-Komisyon   -> Acenta Komisyonunu Belirlemek Icin Kullanilir
          02 TKSREZ1-NOR-INDIRIM       PIC 99V99.
**********>TKSREZ1-Nor-Indirim-> Girilen oran kadar fiyattan indirilecek......
**********>Indirim ile cocuk indirimi birlestirildi..
          02 TKSREZ1-C-IN              PIC X.
          02 TKSREZ1-FOLIO             PIC 9(08).
**********>TKSREZ1-C-In       -> TKSREZ1ervasyonun C/In Yapilip yapilmadigini belirtir.
**********>TKSREZ1-Folio      -> TKSREZ1ervasyon  C/In Yapildiginda Folio nosu islenir
          02 TKSREZ1-ODANO             PIC X(04).
**********>TKSREZ1-Odano      -> TKSREZ1ervasyon esnasinda blokaj yapmaya yarar........
          02 TKSREZ1-S-D-T-G           PIC 9.
          02 TKSREZ1-ODA-KONUMU        PIC 99.
          02 TKSREZ1-KISI.
             03 TKSREZ1-BUYUK          PIC 9(02).
             03 TKSREZ1-KUCUK          PIC 9(02).
             03 TKSREZ1-BEBEK          PIC 9(01).
             03 TKSREZ1-FREE           PIC 9(01).
          02 TKSREZ1-FIYATI            PIC 9(12)V99 COMP-3.
**********>
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=TKSREZ1_ISL_TAR
          02 TKSREZ1-ISL-TAR.
             03 TKSREZ1-ISL-YIL        PIC 9999.
             03 TKSREZ1-ISL-AY         PIC 99.
             03 TKSREZ1-ISL-GUN        PIC 99.
          02 TKSREZ1-AL-TAR.
             03 TKSREZ1-AL-YIL         PIC 9999.
             03 TKSREZ1-AL-AY          PIC 99.
             03 TKSREZ1-AL-GUN         PIC 99.
          02 TKSREZ1-OPS-TAR.
             03 TKSREZ1-OPS-YIL        PIC 9999.
             03 TKSREZ1-OPS-AY         PIC 99.
             03 TKSREZ1-OPS-GUN        PIC 99.
          02 TKSREZ1-GEL-ZAMAN.
             03 TKSREZ1-GEL-SAAT       PIC 99.
             03 TKSREZ1-GEL-DAK        PIC 99.
          02 TKSREZ1-GIT-ZAMAN.
             03 TKSREZ1-GIT-SAAT       PIC 99.
             03 TKSREZ1-GIT-DAK        PIC 99.
          02 TKSREZ1-GENEL-BILGI.
             03 TKSREZ1-GRUP-ANAH.
                04 TKSREZ1-GRUP-NO     PIC 9(06).
                04 TKSREZ1-GRUP-ADI    PIC X(13).
             03 TKSREZ1-ADRES1         PIC X(20).
             03 TKSREZ1-ADRES2         PIC X(14).
             03 TKSREZ1-AKSIYON2-EH    pic 9.
             03 TKSREZ1-SPECIAL2-EH     pic 9.
             03 TKSREZ1-statu          pic x.
             03 TKSREZ1-iptal          pic 9.
             03 TKSREZ1-sil-sebeb      pic x(2).
             03 TKSREZ1-NOT1           PIC X(100).
             03 TKSREZ1-NOT2           PIC X(100).
             03 TKSREZ1-eski-alan.
               05 TKSREZ1-bavel-eski  PIC X(15).
               05 filler      pic x.
             03 TKSREZ1-gel-sirket     PIC X(02).
             03 TKSREZ1-git-sirket     PIC X(02).
             03 TKSREZ1-operator       pic x(02).
             03 TKSREZ1-E-MAIL         PIC X(01).
             03 TKSREZ1-gr-olabilir    pic 9.
             03 TKSREZ1-voucher-gir-tar.
                04 TKSREZ1-voucher-GIR-YIL     PIC 9999.
                04 TKSREZ1-voucher-GIR-AY      PIC 99.
                04 TKSREZ1-voucher-GIR-GUN     PIC 99.
             03 TKSREZ1-gr-status      pic x.
             03 TKSREZ1-kaynak-1       pic x(02).
             03 TKSREZ1-kaynak-2       pic x(02).
             03 TKSREZ1-kaynak-3       pic x(02).
             03 TKSREZ1-firma          pic x(05).
             03 TKSREZ1-extra-kart2    pic x(7).
          02 TKSREZ1-EXTRA-KART        PIC X(7).
          02 TKSREZ1-LATE-ZAMAN.
             03 TKSREZ1-LATE-GEL-SAAT  PIC 99.
             03 TKSREZ1-LATE-GEL-DAK   PIC 99.
          02 TKSREZ1-ON-ODEME          PIC 9(12)V99 COMP-3.
          02 TKSREZ1-ON-DOVIZ          PIC 9(02).
          02 TKSREZ1-PAZAR             PIC X(02).
          02 TKSREZ1-EB                PIC X.
          02 TKSREZ1-FIYAT-FIX         PIC X.
**********>TKSREZ1-FIYAT-FIX  ->="E" Peryot degisiminde fiyatti degismesin     
          02 TKSREZ1-FIYAT-KONUMU      PIC 99.
          02 TKSREZ1-AKSIYON-EH        PIC X.
          02 TKSREZ1-BILBORD-EH        PIC X.
          02 TKSREZ1-UG-IND            PIC 9.
          02 TKSREZ1-CIN-KURU          PIC 999V99999.
          02 TKSREZ1-ODA-TIPI          PIC XX.
          02 TKSREZ1-SPECIAL-EH        PIC 9.
          02 TKSREZ1-OZEL-DURUM-CAR    PIC 999V9999999.
          02 TKSREZ1-OZEL-DURUM        PIC 99.
          02 TKSREZ1-TITLE             PIC X(09).
          02 TKSREZ1-gec               pic 9.
          02 TKSREZ1-plan              pic 9.
          02 TKSREZ1-rehber            pic x(2).
          02 TKSREZ1-FIYAT-FLAG.
             05 TKSREZ1-AKSIYON-FLAG   PIC 9.
             05 TKSREZ1-renk           PIC 9.
             05 TKSREZ1-SPECIAL-FLAG   PIC 9.
          02 TKSREZ1-ODA-TIPI2         PIC XX.
          02 TKSREZ1-ODA-TIPI3         PIC XX.
          02 TKSREZ1-TIKLER.
             05 TKSREZ1-ozel-tip       PIC x.
             05 TKSREZ1-tam-blok       PIC 9.
             05 TKSREZ1-share          PIC 9.
          02 TKSREZ1-staf-bos       pic x(04).
          02 TKSREZ1-sharenum       pic 9(8).
          02 TKSREZ1-sil-tar         pic x(8).
          02 TKSREZ1-rate-kodu       pic x(8).
          02 TKSREZ1-extra-ind       pic 999v99.
          02 TKSREZ1-NO-POST          pic 9.
          02 TKSREZ1-dev-uye-no      pic 9(8).
          02 TKSREZ1-RATE-ACENTA     Pic xxxx.
          02 TKSREZ1-room-kdv-yok    pic x.
          02 TKSREZ1-extra-kdv-yok   pic x.
          02 TKSREZ1-telefon-no      pic x(15).
          02 TKSREZ1-bavel           pic x(15).
          02 TKSREZ1-VIP-turu        pic x.
          02 TKSREZ1-blok-tip        pic 9. |0-acýk 1-kitli blokaj 2-pre cIN
          02 TKSREZ1-onodeme-var     pic 9. 
          02 TKSREZ1-cin-kur-tar.
             03 TKSREZ1-cin-kur-yil  pic 9(4).
             03 TKSREZ1-cin-kur-ay   pic 9(2).
             03 TKSREZ1-cin-kur-gun  pic 9(2).
          02 TKSREZ1-kredi-kart.
             03 TKSREZ1-kart-tipi     pic x.
             03 TKSREZ1-kart-no1      pic x(04).
             03 TKSREZ1-kart-no2      pic x(04).
             03 TKSREZ1-kart-no3      pic x(04).
             03 TKSREZ1-kart-no4      pic x(04).
             03 TKSREZ1-cvv-kodu      pic x(03).
             03 TKSREZ1-onay-kodu     pic x(15).
             03 TKSREZ1-onay-tutar    pic 9(7)v99.
             03 TKSREZ1-onay-doviz    pic x(02).
             03 TKSREZ1-kart-sahibi   pic x(50).
             03 TKSREZ1-kart-son-ay   pic 9(2).
             03 TKSREZ1-kart-son-yil  pic 9(2).
             03 TKSREZ1-provizyon-notu pic x(20).

          02 TKSREZ1-bosv9           pic x(811). 
          02 TKSREZ1-STAF              PIC X(04).
