       FD TRACE LABEL RECORD STANDARD.
       01 TRACE-REC.
          02 TRACE-ANAH.
             03 TRACE-NO           PIC 9(10).
             03 TRACE-BOS          PIC X(50).
          02 TRACE-KAYIT-TARIHI.
             03 TRACE-KAYIT-YIL    PIC 9(4).
             03 TRACE-KAYIT-AY     PIC 9(2).
             03 TRACE-KAYIT-GUN    PIC 9(2).
          02 TRACE-KAYIT-ZAMANI.
             03 TRACE-KAYIT-SAAT   PIC 9(2).
             03 TRACE-KAYIT-DAKIKA PIC 9(2).
             03 TRACE-KAYIT-SANIYE PIC 9(2).
          02 TRACE-KIMDEN-STAF     PIC X(4).
          02 TRACE-GONDERIM-TURU   PIC X. |T-TUMU,G-GRUP,O-OZEL KISI
          02 TRACE-OLAY-TARIHI.
             03 TRACE-OLAY-YIL     PIC 9(4).
             03 TRACE-OLAY-AY      PIC 9(2).
             03 TRACE-OLAY-GUN     PIC 9(2).
          02 TRACE-OLAY-ZAMANI.
             03 TRACE-OLAY-SAAT    PIC 9(2).
             03 TRACE-OLAY-DAKIKA  PIC 9(2).
          02 TRACE-BASLIK          PIC X(500).
          02 TRACE-NOT             PIC X(2000).
          02 TRACE-BOS             PIC X(1000).

