       FD TRACEHRK LABEL RECORD STANDARD.
       01 TRACEHRK-REC.
          02 TRACEHRK-ANAH.
             03 TRACEHRK-NO              PIC 9(10).
             03 TRACEHRK-STAF            PIC X(04).
             03 TRACEHRK-BOS             PIC X(50).
          02 TRACEHRK-OKUNMA             PIC 9.
          02 TRACEHRK-OKUNMA-TARIHI.
             03 TRACEHRK-OKUNMA-YIL      PIC 9(4).
             03 TRACEHRK-OKUNMA-AY       PIC 9(2).
             03 TRACEHRK-OKUNMA-GUN      PIC 9(2).
          02 TRACEHRK-OKUNMA-ZAMANI.
             03 TRACEHRK-OKUNMA-SAAT     PIC 9(2).
             03 TRACEHRK-OKUNMA-DAKIKA   PIC 9(2).
             03 TRACEHRK-OKUNMA-SANIYE   PIC 9(2).
          02 TRACEHRK-TAMAMLANMA             PIC 9.
          02 TRACEHRK-TAMAMLANMA-TARIHI.
             03 TRACEHRK-TAMAMLANMA-YIL      PIC 9(4).
             03 TRACEHRK-TAMAMLANMA-AY       PIC 9(2).
             03 TRACEHRK-TAMAMLANMA-GUN      PIC 9(2).
          02 TRACEHRK-TAMAMLANMA-ZAMANI.
             03 TRACEHRK-TAMAMLANMA-SAAT     PIC 9(2).
             03 TRACEHRK-TAMAMLANMA-DAKIKA   PIC 9(2).
             03 TRACEHRK-TAMAMLANMA-SANIYE   PIC 9(2). 
          02 TRACEHRK-popup-verildi            PIC 9.
          02 TRACEHRK-popup-TARIHI.
             03 TRACEHRK-popup-YIL      PIC 9(4).
             03 TRACEHRK-popup-AY       PIC 9(2).
             03 TRACEHRK-popup-GUN      PIC 9(2).
          02 TRACEHRK-popup-ZAMANI.
             03 TRACEHRK-popup-SAAT     PIC 9(2).
             03 TRACEHRK-popup-DAKIKA   PIC 9(2).
             03 TRACEHRK-popup-SANIYE   PIC 9(2). 
          02 TRACEhrk-OLAY-TARIHI.
             03 TRACEhrk-OLAY-YIL     PIC 9(4).
             03 TRACEhrk-OLAY-AY      PIC 9(2).
             03 TRACEhrk-OLAY-GUN     PIC 9(2).
          02 TRACEhrk-OLAY-ZAMANI.
             03 TRACEhrk-OLAY-SAAT    PIC 9(2).
             03 TRACEhrk-OLAY-DAKIKA  PIC 9(2).
          
          02 TRACEHRK-BOS                PIC X(1000).

