       FD TURIZM LABEL RECORD STANDARD.
       01 TURIZM-REC.   
          02 TURIZM-ANAH. 
             03 TURIZM-ULKE   PIC XXX.
             03 turizm-sehir  pic xxx.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=TURIZM_TARIH
             03 TURIZM-TARIH.     
                04 TURIZM-YIL PIC 9999. 
                04 TURIZM-AY  PIC 99. 
                04 TURIZM-GUN PIC 99. 
          02 KALAN-ODA            PIC 9(4) COMP-3. 
          02 KALAN-KISI.
             03 KALAN-BUYUK       PIC 9(4) COMP-3. 
             03 KALAN-KUCUK       PIC 9(4) COMP-3. 
             03 KALAN-FREE        PIC 9(4) COMP-3. 
             03 KALAN-BEBEK       PIC 9(4) COMP-3. 
          02 GELEN-ODA            PIC 9(4) COMP-3. 
          02 GELEN-KISI.  
             03 GELEN-BUYUK       PIC 9(4) COMP-3. 
             03 GELEN-KUCUK       PIC 9(4) COMP-3. 
             03 GELEN-FREE        PIC 9(4) COMP-3. 
             03 GELEN-BEBEK       PIC 9(4) COMP-3. 
          02 TURIZM-TOPLAM-TUTAR  PIC 9(09)V99 COMP-3.
          02 TURIZM-CORR-TUTAR    PIC 9(09)V99 COMP-3.
          02 TURIZM-BOS           PIC X(40). 
