FD  ulke  LABEL RECORD IS STANDARD.
 01 ulke-rec.
     02 ulke-anah.
         03 ulke-anah1     PIC  XXX.
     02 ulke-adi         PIC  X(20).
     02 ulke-tur-kodu    PIC  99.
     02 ulke-akbs        PIC  X(05).
     02 ulke-web-acenta  pic  x(4).
     02 ulke-dil-kodu    PIC  X(01).   |1-türkçe 2-ingilizce 3-almanca 4-rusca
     02 ulke-staf        PIC  X(04).
