fd  ulkeek  label record is standard.
 01 ulkeek-rec.
     02 ulkeek-anah.
         03 ulkeek-anah1     pic  x(03).
     02 ulkeek-dft-pazar     pic  x(02).
     02 ulkeek-bos           pic  x(200).

