*
 fd useinbox label record standard.
 01 useinbox-rec.
    02 useinbox-anah.      
       03 useinbox-kodu      pic 99. 
       03 useinbox-anah-bos  pic x(100). 
    02 useinbox-diger.  
       03 useinbox-adi       pic x(150).
       03 useinbox-ekodu     pic x(50).
       03 useinbox-diger-bos pic x(1000).
