         COPY "dokumer.lib".
         COPY "genel.lib".
         COPY "uyruk.lib".
         COPY "genelfis.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".  
        
        copy "ulke.lib".
        copy "acenta.lib".  
       COPY "odalar.lib".                                                                            
