FD uyruk LABEL RECORD STANDARD.
01 uyruk-REC.
    02 uyruk-anah.
       03 uyruk-kodu       PIC X(05).
    02 uyruk-adi.
       03 uyruk-adi1          pic x(32).
       03 uyruk-web-kodu      pic x(07).
       03 uyruk-ulke          pic x(03).

FD uyrukweb LABEL RECORD STANDARD.
01 uyrukweb-REC.
    02 uyrukweb-ANAH.
       03 uyrukweb-KODU       PIC X(05).
    02 uyrukweb-ADI.
       03 uyrukweb-adi1          pic x(32).
       03 uyrukweb-web-kodu      pic x(07).
       03 uyrukweb-ulke          pic x(03).

FD uyrukkbs LABEL RECORD STANDARD.
01 uyrukkbs-REC.
    02 uyrukkbs-ANAH.
       03 uyrukkbs-KODU       PIC X(05).
    02 uyrukkbs-ADI.
       03 uyrukkbs-adi1           pic x(32).
       03 uyrukkbs-web-kodu       pic x(07).
       03 uyrukkbs-ulke           pic x(03).
    02 uyrukkbs-kbs-kodu          pic 999.
    02 uyrukkbs-jandarma-kbs-kodu pic x(4).
    02 uyrukkbs-inbox-kodu        pic 99.
    02 uyrukkbs-bos               pic x(494).

