       FD UZATMA LABEL  RECORD IS STANDARD.
       01 UZATMA-REC.      
          02 UZATMA-ANAH.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=UZATMA_TARIH
             03 UZATMA-TARIH.
                04 UZATMA-YIL  PIC 9999.
                04 UZATMA-AY   PIC 99.
                04 UZATMA-GUN  PIC 99.
             03 UZATMA-FOLIO   PIC 9(08).
             03 UZATMA-ZAMAN.
                04 UZATMA-SAAT   PIC 99.
                04 UZATMA-DAKIKA PIC 99.
                04 UZATMA-SANIYE PIC 99.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=UZATMA_ESKI_COUT
          02 UZATMA-ESKI-COUT.
             03 UZATMA-ESKI-YIL  PIC 9999.  
             03 UZATMA-ESKI-AY   PIC 99.    
             03 UZATMA-ESKI-GUN  PIC 99.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=UZATMA_YENI_COUT
          02 UZATMA-YENI-COUT.
             03 UZATMA-YENI-YIL  PIC 9999.  
             03 UZATMA-YENI-AY   PIC 99.    
             03 UZATMA-YENI-GUN  PIC 99.    

          02 UZATMA-ACIKLAMA     PIC X(25).
          02 UZATMA-BOS          PIC X(10).
          02 UZATMA-STAF         PIC X(04).  
