*
 FD viphrk LABEL RECORD STANDARD.
 01 viphrk-REC.
   02 viphrk-ANAH.
    03 viphrk-vip-kodu              pic x(02).
    03 viphrk-vip-malz-kodu         pic x(02).
   02 viphrk-adet                   pic 99.
   02 viphrk-durum                  pic 9.
   02 viphrk-bos                    pic x(49).
 FD rviphrk LABEL RECORD STANDARD.
 01 rviphrk-REC.
   02 rviphrk-ANAH.
    03 rviphrk-rez-no            pic 9(08).
    03 rviphrk-malz-kodu         pic x(02).
   02 rviphrk-adet                   pic 99.
   02 rviphrk-durum                  pic 9.
   02 rviphrk-bos                    pic x(49).
*/ viphrk-durum 1 her gun
*/ viphrk-durum 0 girisde

