       FD vipistek LABEL RECORD STANDARD.
       01 vipistek-REC.
           02 vipistek-anah.
             03 vipistek-rez-no     pic 9(8).
             03 vipistek-sira-no    pic 9(2).             
           02 vipistek-diger.
              03 vipistek-malzeme-adi  pic x(100).
              03 vipistek-malzeme-adet pic 99.
              03 vipistek-bos          pic x(500).
              03 vipistek-staf         pic x(4).
