          COPY "kodlar02.lib".
          COPY "genel.lib".
         copy "odalar.lib".
        COPY "errorlog.lib".                                                    
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".                                                    
