
        COPY "genel.lib".
        COPY "errorlog.lib".
        COPY "genelfis.lib".
        COPY "dokumer.lib".
        copy "wakeup.lib".
        COPY "logindex.lib".
        copy "konuk.lib".                                            
        copy "gruplar.lib".  
        copy "acenta.lib". 
        copy "telayaru.lib".
        copy "telayar.lib".
        copy "rez.lib". 
        copy "odalar.lib". 
        copy "telkod.lib".        
