FD  wakeup LABEL RECORD IS STANDARD.
 01 wakeup-REC.
    02 wakeup-anah.
       03 wakeup-tarih.
          04 wakeup-yil        pic 9(4).
          04 wakeup-ay         pic 9(2).
          04 wakeup-gun        pic 9(2).
       03 wakeup-rez-no        pic 9(8).
       03 wakeup-odano         pic x(04).
    02 wakeup-diger.
       03 wakeup-zaman1.
         04 wakeup-saat1      pic 9(2).
         04 wakeup-dak1       pic 9(2).
         04 wakeup-san1       pic 9(2).
       03 wakeup-zaman2.
         04 wakeup-saat2      pic 9(2).
         04 wakeup-dak2       pic 9(2).
         04 wakeup-san2       pic 9(2).
       03 wakeup-gonderildi   pic x.|1-Uyandirma Gonderildi 0-uyandirma Gonderilmedi
       03 wakeup-grup-kodu     pic 9(6).
       03 wakeup-islem-tarihi.
          04 wakeup-islem-yil  pic 9(4).
          04 wakeup-islem-ay   pic 9(2).
          04 wakeup-islem-gun  pic 9(2).
       03 wakeup-islem-zaman.
          04 wakeup-islem-saat pic 9(2).
          04 wakeup-islem-dak  pic 9(2).
          04 wakeup-islem-sani pic 9(2).
       03 wakeup-bos           pic x(249).
       03 wakeup-islem-durumu  pic x. |1-Uyandi 0-Cevap yok
       03 wakeup-staf          pic x(04).

 
