*
 FD webbanka LABEL RECORD STANDARD.
 01 webbanka-rec.
           02 webbanka-anah.
              03 webbanka-banka-kodu       pic x(5).
              03 webbanka-doviz-kodu       pic xx.
              03 webbanka-taksit-sayisi    pic xx.
              03 webbanka-bos-anah         pic x(150).
           02 webbanka-diger.
              03 webbanka-hesap-kodu       pic x(25).
              03 webbanka-bos-diger        pic x(1300).

