    *  
       FD WEBFIYAT LABEL RECORD STANDARD.
       01 WEBFIYAT-REC.
           02 WEBFIYAT-ANAH.
              03 WEBFIYAT-ACENTA         PIC X(04).
              03 WEBFIYAT-TARIH.
                  04 WEBFIYAT-TARIH-YIL  PIC 9(4).
                  04 WEBFIYAT-TARIH-AY   PIC 9(2).
                  04 WEBFIYAT-TARIH-GUN  PIC 9(2).
              03 WEBFIYAT-KONUM          PIC 9(02).
              03 WEBFIYAT-BOS            PIC X(30).
           02 WEBFIYAT-DIGER.
              03 WEBFIYAT-FIYAT                PIC 9(6)V99.
              03 webfiyat-ham-fiyat            pic 9(6)v99.
              03 WEBFIYAT-DIGER-BOS            PIC X(192).
              03 WEBFIYAT-ISL-TARIH.
                  04 WEBFIYAT-ISL-TARIH-YIL    PIC 9(4).
                  04 WEBFIYAT-ISL-TARIH-AY     PIC 9(2).
                  04 WEBFIYAT-ISL-TARIH-GUN    PIC 9(2).
              03 WEBFIYAT-ISL-ZAMAN.
                  04 WEBFIYAT-ISL-ZAMAN-SAAT   PIC 9(2).
                  04 WEBFIYAT-ISL-ZAMAN-DAKIKA PIC 9(2).
                  04 WEBFIYAT-ISL-ZAMAN-SANIYE PIC 9(2).
              03 WEBFIYAT-ISL-STAF             PIC X(04).
              


