      *  
       FD WEBFLOG LABEL RECORD STANDARD.
       01 WEBFLOG-REC.
           02 WEBFLOG-ANAH.
             03 WEBFLOG-LOG-TARIH.
                  04 WEBFLOG-LOG-TARIH-YIL     PIC 9(4).
                  04 WEBFLOG-LOG-TARIH-AY      PIC 9(2).
                  04 WEBFLOG-LOG-TARIH-GUN     PIC 9(2).
              03 WEBFLOG-LOG-ZAMAN.
                  04 WEBFLOG-LOG-ZAMAN-SAAT    PIC 9(2).
                  04 WEBFLOG-LOG-ZAMAN-DAKIKA  PIC 9(2).
                  04 WEBFLOG-LOG-ZAMAN-SANIYE  PIC 9(2).
              03 WEBFLOG-ACENTA                PIC X(04).
              03 WEBFLOG-TARIH.
                  04 WEBFLOG-TARIH-YIL         PIC 9(4).
                  04 WEBFLOG-TARIH-AY          PIC 9(2).
                  04 WEBFLOG-TARIH-GUN         PIC 9(2).
              03 WEBFLOG-KONUM                 PIC 9(02).
              03 WEBFLOG-BOS                   PIC X(30).
           02 WEBFLOG-DIGER.
              03 WEBFLOG-FIYAT                 PIC 9(6)V99.
              03 WEBFLOG-DIGER-BOS             PIC X(200).
              03 WEBFLOG-LOG-STAF              PIC X(04).
       
              


