      *  
       FD WEBKONT LABEL RECORD STANDARD.
       01 WEBKONT-REC.
           02 WEBKONT-ANAH.
              03 WEBKONT-ACENTA         PIC X(04).
              03 WEBKONT-TARIH.
                  04 WEBKONT-TARIH-YIL  PIC 9(4).
                  04 WEBKONT-TARIH-AY   PIC 9(2).
                  04 WEBKONT-TARIH-GUN  PIC 9(2).
              03 WEBKONT-KONUM          PIC 9(02).
              03 WEBKONT-BOS            PIC X(30).
           02 WEBKONT-DIGER.
              03 WEBKONT-KONTENJAN            PIC s9(4).
              03 WEBKONT-DIGER-BOS            PIC X(200).
              03 WEBKONT-ISL-TARIH.
                  04 WEBKONT-ISL-TARIH-YIL    PIC 9(4).
                  04 WEBKONT-ISL-TARIH-AY     PIC 9(2).
                  04 WEBKONT-ISL-TARIH-GUN    PIC 9(2).
              03 WEBKONT-ISL-ZAMAN.
                  04 WEBKONT-ISL-ZAMAN-SAAT   PIC 9(2).
                  04 WEBKONT-ISL-ZAMAN-DAKIKA PIC 9(2).
                  04 WEBKONT-ISL-ZAMAN-SANIYE PIC 9(2).
              03 WEBKONT-ISL-STAF             PIC X(04).
              


