      *  
       FD WEBKLOG LABEL RECORD STANDARD.
       01 WEBKLOG-REC.
           02 WEBKLOG-ANAH.
             03 WEBKLOG-LOG-TARIH.
                  04 WEBKLOG-LOG-TARIH-YIL     PIC 9(4).
                  04 WEBKLOG-LOG-TARIH-AY      PIC 9(2).
                  04 WEBKLOG-LOG-TARIH-GUN     PIC 9(2).
              03 WEBKLOG-LOG-ZAMAN.
                  04 WEBKLOG-LOG-ZAMAN-SAAT    PIC 9(2).
                  04 WEBKLOG-LOG-ZAMAN-DAKIKA  PIC 9(2).
                  04 WEBKLOG-LOG-ZAMAN-SANIYE  PIC 9(2).
              03 WEBKLOG-ACENTA                PIC X(04).
              03 WEBKLOG-TARIH.
                  04 WEBKLOG-TARIH-YIL         PIC 9(4).
                  04 WEBKLOG-TARIH-AY          PIC 9(2).
                  04 WEBKLOG-TARIH-GUN         PIC 9(2).
              03 WEBKLOG-KONUM                 PIC 9(02).
              03 WEBKLOG-BOS                   PIC X(30).
           02 WEBKLOG-DIGER.
              03 WEBKLOG-FIYAT                 PIC 9(6)V99.
              03 WEBKLOG-DIGER-BOS             PIC X(200).
              03 WEBKLOG-LOG-STAF              PIC X(04).
       
              


