* 
 FD weblog LABEL RECORD STANDARD.
   01 weblog-rec.
          02 WEBLOG-ANAH.
             05 weblog-ip-ANAH    PIC X(30).
             05 weblog-tarih-zaman.
                07 WEBLOG-TArih      pic 9(8).
                07 weblog-zaman      pic 9(08).
          02 WEBLOG-DATA .
          03 weblog-tipxx       pic 9. 
          03 weblog-debug     pic 9.
          03 weblog-rec2.
                04 weblog-gelen.
                 05 weblog-gelen-otel      pic x(50).
                 05 weblog-gelen-bastar    pic x(10).
                 05 weblog-gelen-bittar    pic x(10).
                 05 weblog-gelen-pax      pic 99.
                 05 weblog-gelen-cocuk-yas  pic 99 occurs 5 times.
                 05 weblog-gelen-chi      pic 99.
                 05 weblog-gelen-free     pic 99.
                 05 weblog-ip              pic x(30).
                 05 weblog-ulke            pic x(10).
                 05 weblog-voucher-code    pic x(30).
                 05 weblog-mis-adi         pic x(20).
                 05 weblog-mis-soyadi      pic x(20).
                 05 weblog-internal-voucher   pic x(30). 
                 05 weblog-acenta          pic x(4).
               04 weblog-giden.
                
                 05 weblog-doviz             pic xxxxx.
                 05 weblog-anlasma           pic 99.
                 05 weblog-anlasma-adi       pic x(30).
                 05 weblog-odalar occurs 10 times.
                     06 weblog-konum-kodu       pic 99. 
                     06 weblog-konum-adi        pic x(20).
                     06 filler occurs 5 times.
                             07 weblog-rate-kodu        pic 99.
                             07 weblog-rate-adi         piC x(30).
                             07 weblog-rate-carpan      pic 9v9(6).
                     06 weblog-musait-oda-sayisi  pic  9(3).
                     06 weblog-oda-fiyati-ham-toplam  pic 9(7)v99.
                     06 weblog-oda-fiyati-indler occurs 5 times.
                          10    weblog-oda-fiyati-ind-adi  pic x(15).
                          10    weblog-oda-fiyati-ind-tut  pic 9(7)v99.
                     06 weblog-oda-fiyati-toplam pic 9(7)v99.
                     06 weblog-gunlukler occurs 50 times.
                          07 weblog-oda-fiyati-gunluk-ham   pic 9(5)v99. 
                          07 weblog-oda-fiyati-gunluk-indler occurs 5 times.
                              10    weblog-oda-fiyati-gunluk-ind-tut  pic 9(5)v99.
                         07 weblog-oda-fiyati-gunluk       pic 9(5)v99.
         
                   05 weblog-extra-indirim-orani     pic 999v99.  
           03 weblog-hata-oldu       pic 9.
           03 weblog-hata-aciklama   pic x(50).         
       
