       01 xrez-REC.
          02 xrez-ANAH.
             03 xrez-NO             PIC 9(08).
          02 xrez-TIPI              PIC 9.
**********>1->Alotment 2->It 3->Grup 4->Munferit...gibi
          02 xrez-DURUMU            PIC X.
**********>xrez-Durumu => xrezervasyonun durumunu belirtir....
**********>I->Iceridekir xrez.  S->Silinmis,Iplat xrez.
**********>Onemli butun anahtar sahalarda olacak...............
          02 xrez-ACEN-ANAH.
             03 xrez-ACENTA         PIC X(4). 
             03 xrez-tarlar.
             05 xrez-GIR-TAR.
                07 xrez-GIR-YIL     PIC 9999.
                07 xrez-GIR-AY      PIC 99.
                07 xrez-GIR-GUN     PIC 99.       
             05 xrez-CIK-TAR.
                07 xrez-CIK-YIL     PIC 9999.
                07 xrez-CIK-AY      PIC 99.
                07 xrez-CIK-GUN     PIC 99.
          02 xrez-ADI               PIC X(20).
          02 xrez-SOYADI            PIC X(20).
          02 xrez-BANKA             PIC 99.
          02 xrez-DOVIZ             PIC 99.
          02 xrez-ANLASMA           PIC XX.
          02 xrez-ODEME-TIPI        PIC XX.
          02 xrez-PAN-TIPI          PIC XX.
          02 xrez-ULKE              PIC X(03).
          02 xrez-VOUCHER           PIC X(30).
          02 xrez-KUR-AYGUN         PIC X.
**********>A->Ay basi kuru   G->Gunluk Kur....
          02 xrez-K-G-B             PIC X.
**********>K->Confirme G->Gecici B->Beklemede I-Infox
          02 xrez-VIP               PIC X.
**********>V->V.I.P    T->Top V.I.P
          02 xrez-KOMISYON          PIC 99.
**********>xrez-Komisyon   -> Acenta Komisyonunu Belirlemek Icin Kullanilir
          02 xrez-NOR-INDIRIM       PIC 99V99.
**********>xrez-Nor-Indirim-> Girilen oran kadar fiyattan indirilecek......
**********>Indirim ile cocuk indirimi birlestirildi..
          02 xrez-C-IN              PIC X.
          02 xrez-FOLIO             PIC 9(08).
**********>xrez-C-In       -> xrezervasyonun C/In Yapilip yapilmadigini belirtir.
**********>xrez-Folio      -> xrezervasyon  C/In Yapildiginda Folio nosu islenir
          02 xrez-ODANO             PIC X(04).
**********>xrez-Odano      -> xrezervasyon esnasinda blokaj yapmaya yarar........
          02 xrez-S-D-T-G           PIC 9.
          02 xrez-ODA-KONUMU        PIC 99.
          02 xrez-KISI.
             03 xrez-BUYUK          PIC 9(02).
             03 xrez-KUCUK          PIC 9(02).
             03 xrez-BEBEK          PIC 9(01).
             03 xrez-FREE           PIC 9(01).
          02 xrez-FIYATI            PIC 9(12)V99 COMP-3.
**********>
          02 xrez-ISL-TAR.
             03 xrez-ISL-YIL        PIC 9999.
             03 xrez-ISL-AY         PIC 99.
             03 xrez-ISL-GUN        PIC 99.
          02 xrez-AL-TAR.
             03 xrez-AL-YIL         PIC 9999.
             03 xrez-AL-AY          PIC 99.
             03 xrez-AL-GUN         PIC 99.
          02 xrez-OPS-TAR.
             03 xrez-OPS-YIL        PIC 9999.
             03 xrez-OPS-AY         PIC 99.
             03 xrez-OPS-GUN        PIC 99.
          02 xrez-GEL-ZAMAN.
             03 xrez-GEL-SAAT       PIC 99.
             03 xrez-GEL-DAK        PIC 99.
          02 xrez-GIT-ZAMAN.
             03 xrez-GIT-SAAT       PIC 99.
             03 xrez-GIT-DAK        PIC 99.
          02 xrez-GENEL-BILGI.
             03 xrez-GRUP-ANAH.
                04 xrez-GRUP-NO     PIC 9(06).
                04 xrez-GRUP-ADI    PIC X(13).
             03 xrez-ADRES1         PIC X(20).
             03 xrez-ADRES2         PIC X(14).
             03 xrez-AKSIYON2-EH    pic 9.
             03 xrez-SPECIAL2-EH     pic 9.
             03 xrez-statu          pic x.
             03 xrez-iptal          pic 9.
             03 xrez-sil-sebeb      pic x(2).
             03 xrez-NOT1           PIC X(100).
             03 xrez-NOT2           PIC X(100).
             03 xrez-eski-alan.
               05 xrez-bavel-eski  PIC X(15).
               05 filler      pic x.
             03 xrez-gel-sirket     PIC X(02).
             03 xrez-git-sirket     PIC X(02).
             03 xrez-operator       pic x(02).
             03 xrez-E-MAIL         PIC X(01).
             03 xrez-gr-olabilir    pic 9.
             03 xrez-voucher-gir-tar.
                04 xrez-voucher-GIR-YIL     PIC 9999.
                04 xrez-voucher-GIR-AY      PIC 99.
                04 xrez-voucher-GIR-GUN     PIC 99.
             03 xrez-gr-status      pic x.
             03 xrez-kaynak-1       pic x(02).
             03 xrez-kaynak-2       pic x(02).
             03 xrez-kaynak-3       pic x(02).
             03 xrez-firma          pic x(05).
             03 xrez-extra-kart2    pic x(7).
          02 xrez-EXTRA-KART        PIC X(7).
          02 xrez-LATE-ZAMAN.
             03 xrez-LATE-GEL-SAAT  PIC 99.
             03 xrez-LATE-GEL-DAK   PIC 99.
          02 xrez-ON-ODEME          PIC 9(12)V99 COMP-3.
          02 xrez-ON-DOVIZ          PIC 9(02).
          02 xrez-PAZAR             PIC X(02).
          02 xrez-EB                PIC X.
          02 xrez-FIYAT-FIX         PIC X.
**********>xrez-FIYAT-FIX  ->="E" Peryot degisiminde fiyatti degismesin     
          02 xrez-FIYAT-KONUMU      PIC 99.
          02 xrez-AKSIYON-EH        PIC X.
          02 xrez-BILBORD-EH        PIC X.
          02 xrez-UG-IND            PIC 9.
          02 xrez-CIN-KURU          PIC 999V99999.
          02 xrez-ODA-TIPI          PIC XX.
          02 xrez-SPECIAL-EH        PIC 9.
          02 xrez-OZEL-DURUM-CAR    PIC 999V9999999.
          02 xrez-OZEL-DURUM        PIC 99.
          02 xrez-TITLE             PIC X(09).
          02 xrez-gec               pic 9.
          02 xrez-plan              pic 9.
          02 xrez-rehber            pic x(2).
          02 xrez-FIYAT-FLAG.
             05 xrez-AKSIYON-FLAG   PIC 9.
             05 xrez-renk           PIC 9.
             05 xrez-SPECIAL-FLAG   PIC 9.
          02 xrez-ODA-TIPI2         PIC XX.
          02 xrez-ODA-TIPI3         PIC XX.
          02 xrez-TIKLER.
             05 xrez-ozel-tip       PIC 9.
             05 xrez-tam-blok       PIC 9.
             05 xrez-share          PIC 9.
          02 xrez-staf-bos       pic x(04).
          02 xrez-sharenum       pic 9(8).
          02 xrez-sil-tar         pic x(8).
          02 xrez-rate-kodu       pic x(8).
          02 xrez-extra-ind       pic 999v99.
          02 xrez-NO-POST          pic 9.
          02 xrez-dev-uye-no      pic 9(8).
          02 xrez-RATE-ACENTA     Pic xxxx.
          02 xrez-room-kdv-yok    pic x.
          02 xrez-extra-kdv-yok   pic x.
          02 xrez-telefon-no      pic x(15).
          02 xrez-bavel           pic x(15).
          02 xrez-VIP-turu        pic x.
          02 xrez-blok-tip        pic 9. |0-acýk 1-kitli blokaj 2-pre cIN
          02 xrez-onodeme-var     pic 9.
          02 xrez-cin-kur-tar.
             03 xrez-cin-kur-yil  pic 9(4).
             03 xrez-cin-kur-ay   pic 9(2).
             03 xrez-cin-kur-gun  pic 9(2).

          02 xrez-kredi-kart.
             03 xrez-kart-tipi     pic x.
             03 xrez-kart-no1      pic x(04).
             03 xrez-kart-no2      pic x(04).
             03 xrez-kart-no3      pic x(04).
             03 xrez-kart-no4      pic x(04).
             03 xrez-cvv-kodu      pic x(03).
             03 xrez-onay-kodu     pic x(15).
             03 xrez-onay-tutar    pic 9(7)v99.
             03 xrez-onay-doviz    pic x(02).
             03 xrez-kart-sahibi   pic x(50).
             03 xrez-kart-son-ay   pic 9(2).
             03 xrez-kart-son-yil  pic 9(2).
             03 xrez-provizyon-notu pic x(20).
          02 xrez-dig-plan.
          03 xrez-oda-plan       pic 9.
          03 xrez-kisi-plan      pic 9.
          03 xrez-fkonum-plan    pic 9.
          03 xrez-pans-plan    pic 9.
          03 xrez-paylas-oda  pic 9.
          03 xrez-sil-neden     pic x(50).
          03 xrez-sehir         pic x(3).
          03 xrez-alan-staff        pic x(4).
          03 xrez-conf-staff        pic x(4).
          02 xrez-degis-zaman.
             03 xrez-degis-saat     pic 99.
             03 xrez-degis-dakika     pic 99.
             03 xrez-degis-saniye     pic 99.
          02 xrez-mail-adr   pic x(30).
          02 xrez-ara-bos    pic x(470).
          02 xrez-cocuklar.
             05 xrez-cocuk-yas    pic 99 occurs 10 times.
          02 xrez-vip-oto-degis     pic 9.
          02  xrez-fix-anl            pic 9.
          02 xrez-acenta-odeme-alindi pic 9.
          02 xrez-call-center      pic x(9).
          02 xrez-sejour-entegre   pic 9.
          02 xrez-sil-uyarildi      pic 9.
           02 xrez-isl-zaman.
             03 xrez-isl-saat     pic 99.
             03 xrez-isl-dakika     pic 99.
             03 xrez-sil-saniye     pic 99.
          02 xrez-odano-uzun        pic x(5) .
          02 xrez-pre-cin           pic 9(01).
          02 xrez-online-cin        pic 9(01).          
          
          02 xrez-edit.
             03 xrez-edit-tarih.
                04 xrez-edit-yil    pic 9(04).
                04 xrez-edit-ay     pic 9(02).
                04 xrez-edit-gun    pic 9(02).
             03 xrez-edit-zaman.
                04 xrez-edit-saat   pic 9(02).
                04 xrez-edit-dakika pic 9(02).
                04 xrez-edit-saniye pic 9(02).
          02 xrez-kv-tipi           pic 9. || 1-içinden duþ 2- Acenta öder. Ek Fiyat bas 3- Musteri öder Extraya ekfiyat
          02 xrez-bosv9             pic x(56). 
          02 xrez-sejour-kod        pic x(120).
          02 xrez-sejour-logid      pic 9(10).
          02 xREZ-STAF              PIC X(04).
          
          
