       fd yanrez label record standard.
       01 yanrez-rec.
          02 yanrez-anah.
             03 yanrez-rezno       pic 9(08).
             03 yanrez-sirano      pic 99.
          02 yanrez-durumu         pic x.
*********> yanrez-durumu   => folionun iceridemi yoksa histroyde mi oldugunu
*********> belirtir...i-> iceride h->historyde gibi............
        
          02 yanrez-gerisi.
          03 yanrez-adi            pic x(20).
          03 yanrez-soyadi         pic x(20).
          03 yanrez-odano          pic x(04).
          03 yanrez-uyruk          pic x(04).
          03 yanrez-gel-tar.
             04 yanrez-gel-yil     pic 9999.
             04 yanrez-gel-ay      pic 99.
             04 yanrez-gel-gun     pic 99.
          03 yanrez-git-tar.
             04 yanrez-git-yil     pic 9999.
             04 yanrez-git-ay      pic 99.
             04 yanrez-git-gun     pic 99.
          03 yanrez-gel-zaman.
             04 yanrez-gel-saat     pic 99.
             04 yanrez-gel-dakika   pic 99.
             04 yanrez-gel-saniye   pic 99.
          03 yanrez-git-zaman.
             04 yanrez-git-saat     pic 99.
             04 yanrez-git-dakika   pic 99.
             04 yanrez-git-saniye   pic 99.
          03 yanrez-tckimlikno      pic 9(11).
          03 yanrez-babaadi         pic x(20).
          03 yanrez-anaadi          pic x(20).
          03 yanrez-dyeri           pic x(40).
          03 yanrez-dog-tar.
             04 yanrez-dog-yil     pic 9999.
             04 yanrez-dog-ay      pic 99.
             04 yanrez-dog-gun     pic 99.
          03 yanrez-kturu          pic x.
          03 yanrez-kseri          pic x(20).
          03 yanrez-nil            pic x(20).
          03 yanrez-nilce          pic x(20).
          03 yanrez-nmahalle       pic x(20).
          03 yanrez-ncilt          pic x(15).
          03 yanrez-naile          pic x(15).
          03 yanrez-nsira          pic x(15).
          03 yanrez-cinsiyet       pic x.
          03 yanrez-medeni         pic x.
          03 yanrez-isi            pic x(20).
          03 yanrez-adr            pic x(100).
          03 yanrez-plaka          pic x(20).
          03 yanrez-prb            pic x.
          03 yanrez-prb-ack        pic x(57).
          03 yanrez-folio-no       pic 9(08).
          03 yanrez-profil-anah.
            05 yanrez-profil-sirket pic x(08).
            05 yanrez-profil-no     pic 9(08).
          03 yanrez-title          pic x(20).
          03 yanrez-hes-kodu       pic x(15).
          03 yanrez-hes-durum      pic x(01).|3Hata 4Tarih 5DigerHata
          03 yanrez-kvkk-cevap     pic x(05).
          03 yanrez-kvkk-mail-tel  pic x(01).
          03 yanrez-bos            pic x(24).
          03 yanrez-staf           pic x(04).
          

