       FD yassinir LABEL RECORD STANDARD.
       01 yassinir-REC.
          02 yassinir-anah.
             03 yassinir-kodu              pic x(10).
             03 yasinisr-bos-anah         .
               05 yassinir-konum-anah      pic x(2).
               05  filler        pic x(18).
          02 yassinir-diger.
             03 yassinir-adi               pic x(50).
            
             03 yassinir-single.
                04 yassinir-sng-pax-sinir  pic 9(2)v99.
                04 yassinir-sng-chi1-sinir pic 9(2)v99.
                04 yassinir-sng-chi2-sinir pic 9(2)v99.
                04 yassinir-sng-chi3-sinir pic 9(2)v99.                                                                
             03 yassinir-double.
                04 yassinir-dbl-pax-sinir  pic 9(2)v99.
                04 yassinir-dbl-chi1-sinir pic 9(2)v99.
                04 yassinir-dbl-chi2-sinir pic 9(2)v99.
                04 yassinir-dbl-chi3-sinir pic 9(2)v99.                                                                
             03 yassinir-triple.
                04 yassinir-trp-pax-sinir  pic 9(2)v99.
                04 yassinir-trp-chi1-sinir pic 9(2)v99.
                04 yassinir-trp-chi2-sinir pic 9(2)v99.
                04 yassinir-trp-chi3-sinir pic 9(2)v99.                                                                
             03 yassinir-ozel-sinir.
                04 yassinir-satir occurs 10 times.
                   05 yassinir-yas-kosul occurs 7 times.
                     06 yassinir-bas-yas       pic 9(2)v99.
                     06 yassinir-bit-yas       pic 9(2)v99.
                   05 yassinir-sonuc.  
	                   07 yassinir-sonuc-buyuk   pic 9.
	                   07 yassinir-sonuc-kucuk   pic 9.
	                   07 yassinir-sonuc-free    pic 9.
	                   07 yassinir-sonuc-bebek   pic 9.
	         03 yassinir-beb-sinir         pic 9v99. 
                 03 yassinir-yaslilik-sinir    pic 99v99.
	         03 yassinir-bos              pic x(96).
	         03 yassinir-staf            pic xxxx.         
                                                           