         copy "genel.lib".
         copy "genel2.lib".
         copy "genelfis.lib".
  
   
         copy "dokumer.lib".
         COPY "rez.lib"   replacing  leading "REZ" by "aREZ".
         copy "aceanlas.lib".
        
         copy "polisxml.lib".
          copy "acenta.lib".
         copy "yanrez.lib".
         copy "yassinir.lib".
         copy "kllnc.lib".
         copy "odalar.lib".
         copy "konum.lib".

         copy "errorlog.lib".
         copy "logindex.lib".


