         COPY "genelfis.lib".
         COPY "genel.lib".
         COPY "dokumer.lib".
         COPY "acenta.lib".
         COPY "takvim.lib".
         COPY "acenhrk.lib".
         COPY "kontrat.lib".
         COPY "konum.lib".
         copy "cast.lib".
         copy "rez.lib".
         copy "odalar.lib".
         copy "grup.lib".

        COPY "errorlog.lib".                                                    
        COPY "logindex.lib".                                                    
