         COPY "prosif.lib".
         COPY "helpmenu.lib".
         COPY "genel.lib".
         COPY "menutext.lib".
         COPY "kllnc.lib".
         COPY "errorlog.lib".
        COPY "genelfis.lib".                                                    
        COPY "logindex.lib".                                                    
