       FD TEKNIK LABEL RECORD STANDARD.
       01 TEKNIK-REC.
          02 TEKNIK-ANAHTAR.
             03 TEKNIK-ODANO          PIC X(04).
             03 TEKNIK-SORUN-TAR.
                04 TEKNIK-SORUN-YIL   PIC 9(4).
                04 TEKNIK-SORUN-AY    PIC 9(2).
                04 TEKNIK-SORUN-GUN   PIC 9(2).
             03 TEKNIK-SORUN-ZAMAN.
                04 TEKNIK-SORUN-SAAT   PIC 9(2).
                04 TEKNIK-SORUN-DAKIKA PIC 9(2).
                04 TEKNIK-SORUN-SANIYE PIC 9(2).
          02 TEKNIK-SORUN-STAF       PIC X(4).
************>
          02 TEKNIK-COZUM-TAR.
             03 TEKNIK-COZUM-YIL   PIC 9(4).
             03 TEKNIK-COZUM-AY    PIC 9(2).
             03 TEKNIK-COZUM-GUN   PIC 9(2).
          02 TEKNIK-COZUM-ZAMAN.
             03 TEKNIK-COZUM-SAAT   PIC 9(2).
             03 TEKNIK-COZUM-DAKIKA PIC 9(2).
             03 TEKNIK-COZUM-SANIYE PIC 9(2).
          02 TEKNIK-COZUM-STAF       PIC X(4).

          02 TEKNIK-SORUN            PIC X(50).
          02 TEKNIK-COZUM            PIC X(50).
          02 TEKNIK-OK               PIC X.
*********> E ISE OKEYLENDI DIGER HALLERDDE ARIZALI....
          02 TEKNIK-BOS              PIC X(10).
