       FD ZIYFIS LABEL RECORD STANDARD.
       01 ZIYFIS-REC.
          02 ZIYFIS-ANAHTAR       PIC 9.
          02 ZIYARET-OTO          PIC 9(06).
          02 CEK-OTO              PIC 9(10).
          02 ZIYFIS-PRINT-NO      PIC 9(04).
          02 EKRAN-FIS-1          PIC 9(04).
          02 FIHRIST-OTO          PIC 9(10).
          02 ZIYFIS-LOG-NO        PIC 9(10).
          02 ZIYFIS-DEKONT-NO     PIC 9(6).
          02 ZIYFIS-BOS           PIC X(034).
          02 ZIYFIS-STAF          PIC X(04).
