       FD aceanlas LABEL RECORD STANDARD.
       01 aceanlas-REC.
          03 aceanlas-ANAH.
             05 aceanlas-acenta               PIC X(4).
             05 aceanlas-anlasma              PIC X(2).
             05 aceanlas-anlasma-sira         pic x(08).
             05 acenanlas-filler              pic x(12).
          03 aceanlas-kabul-bas.
                   05 aceanlas-kabul-bas-yil  pic 9999.
                   05 aceanlas-kabul-bas-ay   pic 99  .
                   05 aceanlas-kabul-bas-gun  pic 99  .
          03 aceanlas-kabul-bit.
                   05 aceanlas-kabul-bit-yil  pic 9999.
                   05 aceanlas-kabul-bit-ay   pic 99  .
                   05 aceanlas-kabul-bit-gun  pic 99  .
          03 aceanlas-donem-bas.
                   05 aceanlas-donem-bas-yil  pic 9999.
                   05 aceanlas-donem-bas-ay   pic 99  .
                   05 aceanlas-donem-bas-gun  pic 99  .
          03 aceanlas-donem-bit.
                   05 aceanlas-donem-bit-yil  pic 9999.
                   05 aceanlas-donem-bit-ay   pic 99  .
                   05 aceanlas-donem-bit-gun  pic 99  .
          03 aceanlas-anlasma-tar.
                   05 aceanlas-anlasma-yil    pic 9999.
                   05 aceanlas-anlasma-ay     pic 99  .
                   05 aceanlas-anlasma-gun    pic 99  .
          03 aceanlas-anlasma-oncelik  pic 99.
          03 aceanlas-anl-zorunlu      pic 9.
          03 aceanlas-aks-yok          pic 9.
          03 aceanlas-aks-yok-zor      pic 9. 
          03 aceanlas-spe-yok          pic 9.
          03 aceanlas-spe-yok-zor      pic 9. 
          03 aceanlas-ear              pic 9. 
          03 aceanlas-ear-zor          pic 9.
          03 aceanlas-bos2             pic x(08).
      *    03 aceanlas-1chi-sinir       pic 99.
      *    03 aceanlas-2chi-sinir       pic 99.
      *    03 aceanlas-1fre-sinir       pic 99.
      *    03 aceanlas-2fre-sinir       pic 99.
          03 aceanlas-yasli-sinir      pic 99.
***************odeme plani*************************
          03 aceanlas-eb-odeme-orani   pic 9(3)v99.
          03 aceanlas-eb-odeme-tarihi.
            05 aceanlas-eb-odeme-yil   pic 9(4).
            05 aceanlas-eb-odeme-ay    pic 9(2).
            05 aceanlas-eb-odeme-gun   pic 9(2).
          03 aceanlas-eb-calisma-tipi  pic x.
          03 aceanlas-eb-odeme-tipi    pic x.
          03 aceanlas-odeme-tarihi.
            05 aceanlas-odeme-yil      pic 9(4).
            05 aceanlas-odeme-ay       pic 9(2).
            05 aceanlas-odeme-gun      pic 9(2).
          03 aceanlas-vade-tarih.
            05 aceanlas-vade-yil       pic 9(4).
            05 aceanlas-vade-ay        pic 9(2).
            05 aceanlas-vade-gun       pic 9(2).
          03 aceanlas-peryot           pic 9(03).
          03 aceanlas-once-sonra       pic x.
          03 aceanlas-calisma-kon-tipi pic x.
          03 aceanlas-1chi-ust-sinir   pic 99v99.
          03 aceanlas-2chi-ust-sinir   pic 99v99.
          03 aceanlas-1fre-ust-sinir   pic 99v99.
          03 aceanlas-2fre-ust-sinir   pic 99v99.
          03 aceanlas-bebek-bas-sinir  pic 99v99.
          03 aceanlas-bebek-bit-sinir  pic 99v99.

          03 aceanlas-1fre-ust-sinir1  pic 99v99.
          03 aceanlas-2fre-ust-sinir1  pic 99v99.
          03 aceanlas-1fre-ust-sinir2  pic 99v99.
          03 aceanlas-2fre-ust-sinir2  pic 99v99.
          
      *    03 aceanlas-bos              pic x(064).
      *   03 aceanlas-bos              pic x(40).
          03 aceanlas-bos              pic x(24).
*************** 03 aceanlas-bos              pic x(100).          



