FD  ACENTA LABEL RECORD IS STANDARD.
01 ACENTA-REC.
     02 ACENTA-ANAHTAR.
         03 ACENTA-KODU      PIC  X(4).
     02 ACENTA-ADI       PIC  X(30).
     02 ACENTA-UNVANI    PIC  X(50).
     02 ACENTA-ADRESIM   PIC  X(30).
     02 acenta-fatalti-ind pic 99V99.
     02 ACENTA-butce      PIC  X(4).
     02 acenta-kontenjan   pic x(4).
     02 acenta-faturada-voucher pic 99.
     02 acenta-bos2      pic  x(06). 
     02 ACENTA-V-DAIRE   PIC  X(30).
     02 ACENTA-V-NO      PIC  X(14).
     02 acenta-profil-anah.
            05 acenta-profil-sirket pic x(08).
            05 acenta-profil-no     pic 9(08).
     02 ACENTA-IL        PIC  X(20).
     02 ACENTA-ILCE      PIC  X(20).
     02 ACENTA-ULKE      PIC  X(03).
     02 filler    PIC  99.
     02 filler     PIC  99.
     02 filler  PIC  X(2).
     02 filler     PIC  X(2).
     02 ACENTA-PERFORMANS PIC X(3).
     02 acenta-rate      pic 9.
     02 FILLER           PIC  X(1).
     02 ACENTA-RAP-SIRA  PIC  X(04).
     02 ACENTA-TELEFON   PIC  X(20).
     02 ACENTA-FAX       PIC  X(20).
     02 ACENTA-E-MAIL    PIC   X(15).
     02 ACENTA-MUHNO2     PIC  X(15).
     02 ACENTA-AVANO     PIC  X(15).
     02 acenta-av-oran   pic  99v99.
     02 acenta-bos3      pic x.          
     02 ACENTA-MUHNO     PIC  X(15).
     02 ACENTA-INDIRIM   PIC  9(02).
     02 ACENTA-TIPI      PIC  9.
     02 ACENTA-DETAY-MAHSUP   PIC X.
     02 acenta-kom-orani pic 99.  
     02 acenta-master    pic x(4).
     02 ACENTA-ULKE-KODU PIC  9(3).
     02 ACENTA-STAF      PIC  X(04).

