FD  ACENTA LABEL RECORD IS STANDARD.
01 ACENTA-REC.
     02 ACENTA-ANAHTAR.
         03 ACENTA-KODU      PIC  X(4).
     02 ACENTA-ADI       PIC  X(30).
     02 ACENTA-UNVANI    PIC  X(50).
     02 ACENTA-ADRESIM   PIC  X(30).
     02 acenta-fatalti-ind pic 99V99.
     02 ACENTA-butce      PIC  X(4).
     02 acenta-kontenjan   pic x(4).
     02 acenta-faturada-voucher pic 99.
     02 acenta-bos2      pic  x(06). 
     02 ACENTA-V-DAIRE   PIC  X(30).
     02 ACENTA-V-NO      PIC  X(14).
     02 acenta-profil-anah.
            05 acenta-profil-sirket pic x(08).
            05 acenta-profil-no     pic 9(08).
     02 ACENTA-IL        PIC  X(20).
     02 ACENTA-ILCE      PIC  X(20).
     02 ACENTA-ULKE      PIC  X(03).
     02 acenta-munferit    pic 9.
     02 acenta-oto-proforma    PIC  9.
     02 filler pic 9.
     02 filler     PIC  9.
     02 filler  PIC  X(2).
     02 filler     PIC  X(2).
     02 ACENTA-PERFORMANS PIC X(3).
     02 acenta-rate      pic 9.
     02 acenta-kredili   PIC  9.
     02 ACENTA-RAP-SIRA  PIC  X(04).
     02 ACENTA-TELEFON   PIC  X(20).
     02 ACENTA-FAX       PIC  X(20).
     02 ACENTA-E-MAIL    PIC   X(15).
     02 ACENTA-MUHNO2     PIC  X(15).
     02 ACENTA-AVANO     PIC  X(15).
     02 acenta-av-oran   pic  99v99.
     02 acenta-coutkuru-kullanma      pic x.          
     02 ACENTA-MUHNO     PIC  X(15).
     02 ACENTA-INDIRIM   PIC  9(02).
     02 ACENTA-TIPI      PIC  9.
     02 ACENTA-DETAY-MAHSUP   PIC X.
     02 acenta-kom-orani pic 99.  
     02 acenta-master    pic x(4).
     02 ACENTA-ULKE-KODU PIC  9(3).
     02 ACENTA-STAF      PIC  X(04).
FD  acebavel LABEL RECORD IS STANDARD.
01 acebavel-REC.
 02 acebavel-anah.
    03 acebavel-acenta-kodu          pic x(04).
    03 acebavel-bos-anah             pic x(20).
 02 acebavel-client-id               pic x(50).
 02 acebavel-company                 pic x(100).
 02 acebavel-tax-id                  pic x(50).
 02 acebavel-adress                  pic x(100).
 02 acebavel-city                    pic x(50).
 02 acebavel-zip                     pic x(50).
 02 acebavel-province                pic x(50).
 02 acebavel-country                 pic x(50).
 02 acebavel-email                   pic x(50).
 02 acebavel-bos                     pic x(300).

**************
FD  firma LABEL RECORD IS STANDARD.
01 firma-REC.
     02 firma-ANAHTAR.
         03 firma-KODU      PIC  X(05).
     02 firma-ADI       PIC  X(30).
     02 firma-UNVANI    PIC  X(50).
     02 firma-ADRESIM   PIC  X(30).
     02 firma-fatalti-ind pic 99V99.
     02 firma-butce      PIC  X(4).
     02 firma-rate        pic x(4).
     02 firma-faturada-voucher pic 99.
     02 firma-bos2      pic  x(06). 
     02 firma-V-DAIRE   PIC  X(30).
     02 firma-V-NO      PIC  X(14).
     02 firma-profil-anah.
            05 firma-profil-sirket pic x(08).
            05 firma-profil-no     pic 9(08).
     02 firma-IL        PIC  X(20).
     02 firma-ILCE      PIC  X(20).
     02 firma-ULKE      PIC  X(03).
     02 filler    PIC  99.
     02 filler     PIC  99.
     02 filler  PIC  X(2).
     02 filler     PIC  X(2).
     02 firma-PERFORMANS PIC X(3).
     02 filler            pic x.

     02 firma-kredili   PIC 9.
     02 firma-RAP-SIRA  PIC  X(04).
     02 firma-TELEFON   PIC  X(20).
     02 firma-FAX       PIC  X(20).
     02 firma-E-MAIL    PIC   X(15).
     02 firma-MUHNO2     PIC  X(15).
     02 firma-AVANO     PIC  X(15).
     02 firma-av-oran   pic  99v99.
     02 firma-bos2      pic x.          
     02 firma-MUHNO     PIC  X(15).
     02 firma-INDIRIM   PIC  9(02).
     02 firma-TIPI      PIC  9.
     02 firma-DETAY-MAHSUP   PIC X.
     02 firma-kom-orani pic 99.  
     02 firma-master    pic x(4).
     02 firma-ULKE-KODU PIC  9(3).
     02 firma-STAF      PIC  X(04).
     
     
*
 FD  otomail LABEL RECORD IS STANDARD.
 01 otomail-REC.
     02 otomail-ANAHTAR.         
         03 otomail-tipi      PIC  X. |A- acenta baska yok isallah her boka mail atacaz
         03 otomail-alt-anah1      pic x(30).
         03 otomail-acenta-anah1 redefines otomail-alt-anah1.
             05 otomail-acenta-kodu pic x(4).
             05 otomail-acenta-bos  pic x(26). 
         03 otomail-rez-anah1  redefines otomail-alt-anah1.
              05  otomail-rez-no    pic 9(8).
              05  otomail-acenta-bos  pic x(22). 
     02 otomail-data.         
	     03 otomail-alt-anah2      pic x(30).
	     03 otomail-acenta-alt-anah2 redefines  otomail-alt-anah2.
	        05 otomail-acenta-ct       pic x.
	        05 otomail-acenta-gun      pic 99.
	        05 otomail-acenta-os        pic x.    
	     03 otomail-alt-anah3     pic x(30).
	     03 otomail-kime       pic x(200).
	     03 otomail-cc         pic x(100).
	     03 otomail-bcc        pic x(100).
	     03 otomail-konu       pic x(100).
	     03 otomail-ustyazi    pic x(300).
	     03 otomail-altyazi    pic x(300).
	     03 otomail-data       pic x(250).
	     03 otomail-aktif     pic 9.  |1- aktif 0-pasif
	     03 otomail-staf     pic x(4).  

    