       FD ACENHRK LABEL RECORD STANDARD.
       01 ACENHRK-REC.
          02 ACENHRK-ANAH.
             03 ACENHRK-ACENTA  PIC X(4).
             03 ACENHRK-TARIH.
                04 ACENHRK-YIL PIC 9999.
                04 ACENHRK-AY  PIC 99.
                04 ACENHRK-GUN PIC 99.
             03 ACENHRK-S-D-T-G    PIC 9.
             03 ACENHRK-PAN-TIPI   PIC XX.
             03 ACENHRK-ODA-KONUMU PIC 99.
***********>Kontrat Bolumu
          02 acenhrk-data.
          03 ACENHRK-KONTRAT-ODA       PIC 9(4) COMP-3.
          03 ACENHRK-KONTRAT-KISI.
             04 ACENHRK-KONTRAT-BUYUK  PIC 9(4) COMP-3.
             04 ACENHRK-KONTRAT-KUCUK  PIC 9(4) COMP-3.
             04 ACENHRK-KONTRAT-FREE   PIC 9(4) COMP-3.
***********>Gerceklesen Bolum 
          03 ACENHRK-SAT-ODA           PIC 9(4) COMP-3.
          03 ACENHRK-SAT-KISI.
             04 ACENHRK-SAT-BUYUK      PIC 9(4) COMP-3.
             04 ACENHRK-SAT-KUCUK      PIC 9(4) COMP-3.
             04 ACENHRK-SAT-FREE       PIC 9(4) COMP-3.
          03 ACENHRK-BOS               PIC X(10).
******** Acenhrk-Oda-Tipi -> 1-Single 2-Double 3-Triple 4-Grup
******** Acenhrk-konum    -> Oda Konumunu Belirtir........
******** Acenhrk          -> Dosyasi Bir acentann bir tarihte herhangibir
********                     rez-tipi ve oda tipine gore toplam kontenjanlarini
********                     ve satilanlarini gosterir..........
******** Acenhrk-pan-tipi -> ileride kullanilmak uzere konuldu icerigi space su anda
