fd ajanda label record standard.
01 ajanda-rec.
     02 ajanda-anahtar.
         03 ajanda-tarih.
            04 ajanda-yil                      pic 9999.
            04 ajanda-ay                       pic 99.
            04 ajanda-gun                      pic 99.
         03 ajanda-kullanici                   pic x(04).
         03 ajanda-zaman.
            04 ajanda-saat                     pic 9(2).
            04 ajanda-dakika                   pic 9(2).
         03 ajanda-sira                        pic 9(4).
     02 ajanda-aciklama                        pic x(60).
     02 ajanda-mesaj-tipi                      pic x.
* A- Ajanda M- Mesaj
     02 ajanda-filler                          pic x.
     02 ajanda-mesaj-zaman.
        03 ajanda-mesaj-saat                   pic 99.
        03 ajanda-mesaj-dakika                 pic 99.
     02 ajanda-okundu-e-h                      pic x.
     02 ajanda-uyar-e-h                        pic x.
     02 ajanda-kimden                          pic x(4).
     02 ajanda-bos                             pic x(16).
* kullanici bos ise genel mesaj yayinlanmistir
* ajanda-kimden mesaji gönderen

