       FD AKSIYHRK LABEL RECORD STANDARD.
       01 AKSIYHRK-REC.
          02 AKSIYHRK-ANAH.
             03 AKSIYHRK-TIPI          PIC X.
             03 AKSIYHRK-ACENTA        PIC X(04).
             03 AKSIYHRK-DETAY.
                04 AKSIYHRK-PAN-TIPI   PIC X(02).
                04 AKSIYHRK-CAL-TIPI   PIC X.
                04 AKSIYHRK-BOS        PIC X(04).
             03 AKSIYHRK-TARIH.
                04 AKSIYHRK-YIL        PIC 9(04).
                04 AKSIYHRK-AY         PIC 9(02).
                04 AKSIYHRK-GUN        PIC 9(02).
             03 AKSIYHRK-GECELE        PIC 9(02).
          02 AKSIYHRK-ODE              PIC 9(02)v99.
          02 AKSIYHRK-SONDAN           PIC 9.
          02 aksiyhrk-ekle             pic 9.
          02 aksiyhrk-hes-tipi         pic 9.
          02 aksiyhrk-ebharic           pic 9.
          02 aksiyhrk-oransal          pic 9.
          02 aksiyhrk-minimum          pic 99.
          02 aksiyhrk-rezal-tar1.
              05 aksiyhrk-rezal-bas-yil  PIC 9(4).
              05 aksiyhrk-rezal-bas-ay   PIC 9(2).
              05 aksiyhrk-rezal-bas-gun  PIC 9(2).
          02 aksiyhrk-rezal-tar2.
              05 aksiyhrk-rezal-bit-yil  PIC 9(4).
              05 aksiyhrk-rezal-bit-ay   PIC 9(2).
              05 aksiyhrk-rezal-bit-gun  PIC 9(2).
          
          
          
          02 aksiyhrk-k-bazli          pic 9. 
          02 AKSIYHRK-BOS1             PIC X(29).
**********Aksiyhrk-tipi     ->A->Aksiyon S->Stopsale K->Acenta Komisyon
**********Aksiyhrk-cal-tipi ->I->Rez.Isleme Tarihi G->Rez.Giris Tarihi
