********************

 FD AKSIYON LABEL RECORD STANDARD.
 01 AKSIYON-REC.
    02 AKSIYON-ANAH.
       03 AKSIYON-TIPI          PIC X.
       03 AKSIYON-ACENTA        PIC X(4).
       03 AKSIYON-DETAY.
          04 AKSIYON-PAN-TIPI   PIC X(02).
          04 AKSIYON-CAL-TIPI   PIC X.
          04 AKSIYON-BOS        PIC X(04).
       03 AKSIYON-G-TARIH.
          04 AKSIYON-G-YIL      PIC 9(04).
          04 AKSIYON-G-AY       PIC 9(02).
          04 AKSIYON-G-GUN      PIC 9(02).
       03 AKSIYON-C-TARIH.
          04 AKSIYON-C-YIL      PIC 9(04).
          04 AKSIYON-C-AY       PIC 9(02).
          04 AKSIYON-C-GUN      PIC 9(02).
       03 AKSIYON-GECELE        PIC 9(02).
    02 AKSIYON-ODE              PIC 9(02).
    02 AKSIYON-SONDAN           PIC 9.
    02 AKSIYON-ODA-BASI         PIC 9.
    02 aksiyon-geceleme2        pic 99.
    02 AKSIYON-ODE-kusur        PIC 9(02).
    02 aksiyon-ekle             pic 9.
    02 aksiyon-hes-tipi         pic 9.
    02 AKSIYON-ebharic          PIC 9.
    02 aksiyon-k-bazli        pic 9.
    02 AKSIYON-STAF             PIC X(04).


*** aksiyon-cal-tipi  special-offer da 1-pax + cocuk /2   toplam
***                                 2-pax + cocuk toplam
***                                 3-per oda toplam (rezervasyon) 
***                                 4-per pax  geceleme            
*******                             5 per  pax + child/2  gecelme  
*******                             6 per pax + child geceleme     
*******                             7-per oda gecelemesi     
*************                       0 eskisi gibi  pax toplam 
*** Aksiyon-Tipi     -> A->Aksiyon S->Stop sale K->Acenta Komisyon
*** Aksiyon-geceleme -> Kalis Gunu  K->Komisyonda Kendi Komisyonu
*** Aksiyon-ode      -> Odeme Gunu  K->Komisyonda Diger Acenta Komisyonu
*** Ornek.......     -> 14 gun kal 10 gun ode gibi...
*** Aksiyon-cal-tipi -> I->Rez.Isleme Tarihi G->Rez.Giris Tarihi
 FD AKSIYON2 LABEL RECORD STANDARD.
 01 AKSIYON2-REC.
    02 AKSIYON2-ANAH.
       03 AKSIYON2-TIPI          PIC X.
       03 AKSIYON2-ACENTA        PIC X(4).
       03 AKSIYON2-DETAY.
          04 AKSIYON2-PAN-TIPI   PIC X(02).
          04 AKSIYON2-CAL-TIPI   PIC X.
          04 AKSIYON2-BOS        PIC X(04).
       03 AKSIYON2-G-TARIH.
          04 AKSIYON2-G-YIL      PIC 9(04).
          04 AKSIYON2-G-AY       PIC 9(02).
          04 AKSIYON2-G-GUN      PIC 9(02).
       03 AKSIYON2-C-TARIH.
          04 AKSIYON2-C-YIL      PIC 9(04).
          04 AKSIYON2-C-AY       PIC 9(02).
          04 AKSIYON2-C-GUN      PIC 9(02).   
       03 AKSIYON2-GECELE        PIC 9(02).
    02 AKSIYON2-rezal-tar1.
        05 aksiyon2-rezal-bas-yil  PIC 9(4).
        05 aksiyon2-rezal-bas-ay   PIC 9(2).
        05 aksiyon2-rezal-bas-gun  PIC 9(2).
    02 AKSIYON2-rezal-tar2.
        05 aksiyon2-rezal-bit-yil  PIC 9(4).
        05 aksiyon2-rezal-bit-ay   PIC 9(2).
        05 aksiyon2-rezal-bit-gun  PIC 9(2).

    02 AKSIYON2-bos3          PIC x(20).
    
    02 AKSIYON2-STAF         PIC X(04).
