       FD basbut  LABEL RECORD STANDARD.
       01 basbut-REC.
           02 basbut-ANAH. 
              03 basbut-TARIH.
                 04 basbut-YIL       PIC 9(4).
                 04 basbut-AY        PIC 9(2).
           02 basbut-gerisi.
              05 basbut-oda          pic 9(06)v99.
              05 basbut-pax          pic 9(06)v99.
              05 basbut-rate         PIC 9(10)V99.
              05 basbut-diger-oda    pic 9(10)v99.   
              05 basbut-yiyecek      PIC 9(10)V99.  
              05 basbut-icecek       pic 9(10)v99.   
              05 basbut-diger        PIC 9(10)V99.  
           02 basbut-bos pic x(300).   
