         FD butcegir LABEL RECORD STANDARD.
         01 butcegir-REC.               
                02 butcegir-anah.                  
                  03 butcegir-tip-1               pic x.
                  03 butcegir-tip-2               pic x.
                  03 butcegir-adi                 pic x(20).
                  03 butcegir-tarih.
                    05 butcegir-yil               pic 9(04).
                    05 butcegir-ay                pic 9(02).
                    05 butcegir-gun               pic 9(02).
                  03 butcegir-takas5-anah.  
                    05 butcegir-ilk-anah          pic x(5).
                    05 butcegir-iki-anah          pic x(5).                    
                 02 butcegir-data.
                    05 butcegir-tarih-DIZI.
                       07 butcegir-TUT            pic 9(12)V99.
                       07 butcegir-oda            pic 9(7).
                       07 butcegir-pax            pic 9(7)v99.
                    05 butcegir-bos               pic x(50).
                    05 butcegir-staf              pic x(04).
