       
        FD butce LABEL RECORD STANDARD.
        01 butce-REC.
        02 butce-ANAH.
          05 butce-adi      pic x(10).
          05 butce-tarih    pic 9(08).
          05 butce-tek-satir.
             10 butce-doviz    pic 9(02).
             10 butce-acenta   pic x(04).
             10 butce-anlasma  pic x(04).
             10 butce-konum    pic 9(02).
        02 butce-datalar.
           05 butce-oda-gun    pic 9999v99999.
           05 butce-pax-gun    pic 9999v99999.
           05 butce-price-pp1   pic 9999v999999.
           
