       FD CASTTOP  LABEL RECORD STANDARD.
       01 CASTTOP-REC.
           02 CASTTOP-ANAH. 
              03 CASTTOP-TARIH.
                 04 CASTTOP-YIL      PIC 9(4).
                 04 CASTTOP-AY       PIC 9(2).
                 04 CASTTOP-GUN      PIC 9(2).
              03 CASTTOP-OTEL        PIC 99.        
              03 CASTTOP-REZ-NO      PIC 9(08).
           02 CASTTOP-ODA-NO         PIC X(04).
***********02 CASTTOP-BOS            PIC X(10).
