**********
 FD CAST  LABEL RECORD STANDARD.
  01 CAST-REC.
           02 CAST-ANAH.
**************(( XFD DATE=YYYYMMDD, USE GROUP ))
*****************    $XFD NAME=CAST-TARIH
              03 CAST-TARIH.
                 04 CAST-YIL       PIC 9(4).
                 04 CAST-AY        PIC 9(2).
                 04 CAST-GUN       PIC 9(2).
              03 CAST-REZ-NO       PIC 9(08).
           02 CAST-ODA-NO          PIC X(04).
           02 CAST-KISI.
              03 CAST-BUYUK        PIC 9(02).
              03 CAST-KUCUK        PIC 9(02).
              03 CAST-BEBEK        PIC 9(01).
              03 CAST-FREE         PIC 9(01).
           02 CAST-FIYATI          PIC 9(10)V99 COMP-3.
           02 CAST-ANLASMA-FIYATI  PIC 9(10)V99 COMP-3.
           02 CAST-BASILAN-FIYAT   PIC s9(10)V99 COMP-3.
           02 CAST-ODA-KONUMU      PIC 99.
           02 CAST-FIYAT-KONUMU    PIC 99.
           02 CAST-ANLASMA         PIC XX.
           02 CAST-PAN-TIPI        PIC XX.
           02 CAST-ODA-ADET        PIC 9.
           02 CAST-share           PIC 9.
           02 cast-fiyat-yok       pic 9. 
           02 cast-duzeltme        PIC s9(7)v99.

***********CAST-ODA-ADET    0 Ise Sharing yapilmis rez demektir
***********                  Istatistiklerde oda sayilmamali.
***********                  Normalde her rez icin 1 olmali
***********CAST-KISI-KONAKLAMA  "E" Kisi Konaklama Var
***********                      "H" Kisi Konaklama Yok





