       FD CEVAP2 LABEL RECORD STANDARD.
       01 CEVAP2-REC.
          02 CEVAP2-ANAHTAR.
             03 CEVAP2-TARIH.
                04 CEVAP2-YIL           PIC 9(04).
                04 CEVAP2-AY            PIC 9(02).
                04 CEVAP2-GUN           PIC 9(02).
             03 CEVAP2-NO               PIC 9(06).
             03 CEVAP2-ANA              PIC X(02).
             03 CEVAP2-ALT              PIC X(03).
          02 CEVAP2-YANIT               PIC 9.
          02 CEVAP2-YORUM.
             03 CEVAP2-YORUM-KODU       PIC 9.
             03 CEVAP2-YORUM-DETAY      PIC X(60).
          02 CEVAP2-BOS                 PIC X(20).
          02 CEVAP2-STAF                PIC X(04).

