       FD DAGILIM LABEL RECORD STANDARD.
       01 DAGILIM-REC.
          02 DAGILIM-ANAH.
             03 DAGILIM-ANAHTAR PIC 99.
          02 DAGILIM-TIPI       PIC X.
          02 DAGILIM-KAHVALTI   PIC 9(12)V99.
          02 DAGILIM-OGLE       PIC 9(12)V99.
          02 DAGILIM-AKSAM      PIC 9(12)V99.
          02 DAGILIM-ICECEK     PIC 9(12)V99.
          02 DAGILIM-EXTRA      PIC 9(12)V99.
          02 DAGILIM-BOS        PIC X(20).
          02 DAGILIM-STAF       PIC X(04).
********dagilim-tipi     ->S->Sabit O->Oran

       FD DAGILIMtar LABEL RECORD STANDARD.
       01 DAGILIMtar-REC.
          02 DAGILIMtar-ANAH.
             03 DAGILIMtar-ANAHTAR PIC 99.
             03 DAGilimtar-pan     pic xx.
             03 dagilimtar-ilktar.
                  05 dagilimtar-ilkyil pic 9999.
                  05 dagilimtar-ilkay  pic 99.
                  05 dagilimtar-ilkgun pic 99.
             03 dagilimtar-sontar.
                  05 dagilimtar-sonyil pic 9999.
                  05 dagilimtar-sonay  pic 99.
                  05 dagilimyar-songun pic 99.
          02 DAGILIMtar-TIPI       PIC X.
          02 DAGILIMtar-KAHVALTI   PIC 9(12)V99.
          02 DAGILIMtar-OGLE       PIC 9(12)V99.
          02 DAGILIMtar-AKSAM      PIC 9(12)V99.
          02 DAGILIMtar-ICECEK     PIC 9(12)V99.
          02 DAGILIMtar-EXTRA      PIC 9(12)V99.
          02 DAGILIMtar-BOS        PIC X(20).
          02 DAGILIMtar-STAF       PIC X(04).
