       fd baglanti label record standard.
       01 baglanti-rec.
          02 baglanti-kodu.
             03 baglanti-ana        pic x(02).
             03 baglanti-alt        pic x(03).
          02 baglanti-alt-kodu.
             03 baglanti-tipi       pic x.
             03 baglanti-adi        pic x(30).
          02 baglanti-aciklama-1    pic x(30).
          02 baglanti-aciklama-2    pic x(21).
          02 baglanti-cost-sirketi  pic x(08).
          02 baglanti-merkezi       pic x.
          02 baglanti-kdv           pic 9(02).
          02 baglanti-staf          pic x(04).
          02 baglanti-guncel        pic 9.
          02 baglanti-bos           pic x(99).
************************* ACIKLAMALAR *********
********> baglanti-Tipi  A = Ambar , D = baglantiman
********> baglanti-Cost-Entehre = "H" ise costta hareket gormez.....
