       FD DEPOZIT LABEL RECORD STANDARD.
          01 DEPOZIT-REC.
             02 DEPOZIT-ANAHTAR.
                03 DEPOZIT-FOLIO       PIC 9(08).
                03 DEPOZIT-DEPKOD      PIC 9(03).
                03 DEPOZIT-FISNO       PIC 9(06).
             02 DEPOZIT-DURUMU         PIC X.
             02 DEPOZIT-NO             PIC X(04).
             02 DEPOZIT-TARIH.
                03 DEPOZIT-YIL         PIC 9(04).
                03 DEPOZIT-AY          PIC 9(02).
                03 DEPOZIT-GUN         PIC 9(02).
             02 DEPOZIT-DOVIZ          PIC 9(02).
             02 DEPOZIT-TUTAR          PIC 9(12)V9(2) COMP-3.
             02 DEPOZIT-STAF           PIC X(04).
             02 DEPOZIT-SIL-TARIH.
                03 DEPOZIT-SIL-YIL     PIC 9(04).
                03 DEPOZIT-SIL-AY      PIC 9(02).
                03 DEPOZIT-SIL-GUN     PIC 9(02).
             02 DEPOZIT-BOS            PIC X(12).
*********> Depozit-durumu = "I" Inhouse "S" Silinmis kayit
