       FD detistr  LABEL RECORD STANDARD.
       01 detistr-REC.
          02 detistr-ANAH.
             03 detistr-ref              pic 9.
             03 detistr-TARIH.  
                04 detistr-YIL           PIC 9999.
                04 detistr-AY            PIC 99.
                04 detistr-GUN           PIC 99.
             03 detistr-ACENTA           PIC X(04).
             03 detistr-ULKE-KODU        PIC XXX. 
             03 detistr-PAN-TIPI         PIC XX. 
             03 detistr-REZ-TIPI         PIC 9. 
             03 detistr-ODA-KONUMU       PIC 99.
             03 detistr-ANLASMA-KODU     PIC 99.
**********> Toplam Kismi........
          02 detistr-TOPLAM. 
             03 detistr-TOP-ODA          PIC 9(04) COMP-3.
             03 detistr-TOP-KISI.  
                04 detistr-TOP-BUYUK     PIC 9(04) COMP-3.
                04 detistr-TOP-KUCUK     PIC 9(04) COMP-3.
                04 detistr-TOP-FREE      PIC 9(04) COMP-3.
                04 detistr-TOP-BEBEK     PIC 9(04) COMP-3.
             03 detistr-TOP-TUTAR        PIC 9(09)V99 COMP-3.
             03 detistr-TOP-CORR         PIC 9(09)V99 COMP-3.
**********> Oda    Kismi........
          02 detistr-ODA. 
             03 detistr-ODA-ODA          PIC 9(04) COMP-3.
             03 detistr-ODA-KISI.  
                04 detistr-ODA-BUYUK     PIC 9(04) COMP-3.
                04 detistr-ODA-KUCUK     PIC 9(04) COMP-3.
                04 detistr-ODA-FREE      PIC 9(04) COMP-3.
                04 detistr-ODA-BEBEK     PIC 9(04) COMP-3.
             03 detistr-ODA-TUTAR        PIC 9(09)V99 COMP-3.
             03 detistr-ODA-CORR         PIC 9(09)V99 COMP-3.
**********> Kahvalti Kismi........
          02 detistr-KAHVALTI.
             03 detistr-KAH-ODA          PIC 9(04) COMP-3.
             03 detistr-KAH-KISI. 
                04 detistr-KAH-BUYUK     PIC 9(04) COMP-3.
                04 detistr-KAH-KUCUK     PIC 9(04) COMP-3.
                04 detistr-KAH-FREE      PIC 9(04) COMP-3.
                04 detistr-KAH-BEBEK     PIC 9(04) COMP-3.
             03 detistr-KAH-TUTAR        PIC 9(09)V99 COMP-3.
             03 detistr-KAH-CORR         PIC 9(09)V99 COMP-3.
**********> Ogle     Kismi........
          02 detistr-OGLE.
             03 detistr-OGL-ODA          PIC 9(04) COMP-3.
             03 detistr-OGL-KISI.  
                04 detistr-OGL-BUYUK     PIC 9(04) COMP-3.
                04 detistr-OGL-KUCUK     PIC 9(04) COMP-3.
                04 detistr-OGL-FREE      PIC 9(04) COMP-3.
                04 detistr-OGL-BEBEK     PIC 9(04) COMP-3.
             03 detistr-OGL-TUTAR        PIC 9(09)V99 COMP-3.
             03 detistr-OGL-CORR         PIC 9(09)V99 COMP-3.
**********> Aksam    Kismi........
          02 detistr-AKSAM.
             03 detistr-AKS-ODA          PIC 9(04) COMP-3.
             03 detistr-AKS-KISI.  
                04 detistr-AKS-BUYUK     PIC 9(04) COMP-3.
                04 detistr-AKS-KUCUK     PIC 9(04) COMP-3.
                04 detistr-AKS-FREE      PIC 9(04) COMP-3.
                04 detistr-AKS-BEBEK     PIC 9(04) COMP-3.
             03 detistr-AKS-TUTAR        PIC 9(09)V99 COMP-3.
             03 detistr-AKS-CORR         PIC 9(09)V99 COMP-3.
**********> Icecek   Kismi........
          02 detistr-ICECEK.
             03 detistr-ICE-ODA          PIC 9(04) COMP-3.
             03 detistr-ICE-KISI.  
                04 detistr-ICE-BUYUK     PIC 9(04) COMP-3.
                04 detistr-ICE-KUCUK     PIC 9(04) COMP-3.
                04 detistr-ICE-FREE      PIC 9(04) COMP-3.
                04 detistr-ICE-BEBEK     PIC 9(04) COMP-3.
             03 detistr-ICE-TUTAR        PIC 9(09)V99 COMP-3.
             03 detistr-ICE-CORR         PIC 9(09)V99 COMP-3.
**********> Extra    Kismi........
          02 detistr-EXTRA.  
             03 detistr-EXT-ODA          PIC 9(04) COMP-3.
             03 detistr-EXT-KISI.  
                04 detistr-EXT-BUYUK     PIC 9(04) COMP-3.
                04 detistr-EXT-KUCUK     PIC 9(04) COMP-3.
                04 detistr-EXT-FREE      PIC 9(04) COMP-3.
                04 detistr-EXT-BEBEK     PIC 9(04) COMP-3.
             03 detistr-EXT-TUTAR        PIC 9(09)V99 COMP-3.
             03 detistr-EXT-CORR         PIC 9(09)V99 COMP-3.
**********> Extra-Bed Kismi........
          02 detistr-EXTRA-BED.  
             03 detistr-EXB-ODA          PIC 9(04) COMP-3.
             03 detistr-EXB-KISI. 
                04 detistr-EXB-BUYUK     PIC 9(04) COMP-3.
                04 detistr-EXB-KUCUK     PIC 9(04) COMP-3.
                04 detistr-EXB-FREE      PIC 9(04) COMP-3.
                04 detistr-EXB-BEBEK     PIC 9(04) COMP-3.
             03 detistr-EXB-TUTAR        PIC 9(09)V99 COMP-3.
             03 detistr-EXB-CORR         PIC 9(09)V99 COMP-3.

**********> Complimentary Kismi ......
          02 detistr-COMPLIMENT.
             03 detistr-COM-ODA             PIC 9(4) COMP-3.
             03 detistr-COM-KISI.  
                04 detistr-COM-BUYUK        PIC 9(4) COMP-3.
                04 detistr-COM-KUCUK        PIC 9(4) COMP-3.
                04 detistr-COM-FREE         PIC 9(4) COMP-3.
                04 detistr-COM-BEBEK        PIC 9(4) COMP-3.
             03 detistr-COM-TUTAR           PIC 9(09)V99 COMP-3.
             03 detistr-COM-CORR            PIC 9(09)V99 COMP-3.
**********> House Use     Kismi ......
          02 detistr-HOUSE-USE.
             03 detistr-HOU-ODA             PIC 9(4) COMP-3.
             03 detistr-HOU-KISI.  
                04 detistr-HOU-BUYUK        PIC 9(4) COMP-3.
                04 detistr-HOU-KUCUK        PIC 9(4) COMP-3.
                04 detistr-HOU-FREE         PIC 9(4) COMP-3.
                04 detistr-HOU-BEBEK        PIC 9(4) COMP-3.
             03 detistr-HOU-TUTAR           PIC 9(09)V99 COMP-3.
             03 detistr-HOU-CORR            PIC 9(09)V99 COMP-3.
**********> No Show  Kismi ......
          02 detistr-NOS-ODA             PIC 9(4) COMP-3.
          02 detistr-NOS-KISI.  
             03 detistr-NOS-BUYUK        PIC 9(4) COMP-3.
             03 detistr-NOS-KUCUK        PIC 9(4) COMP-3.
             03 detistr-NOS-FREE         PIC 9(4) COMP-3.
             03 detistr-NOS-BEBEK        PIC 9(4) COMP-3.
          02 detistr-NOS-TUTAR           PIC 9(09)V99 COMP-3.
          02 detistr-NOS-CORR            PIC 9(09)V99 COMP-3.
**********> Single-Double-Triple-Group Istatistigi...........
          02 detistr-SDT OCCURS 4 TIMES. 
             03 detistr-SDT-ODA          PIC 9(4) COMP-3.
             03 detistr-SDT-KISI.  
                04 detistr-SDT-BUYUK     PIC 9(4) COMP-3.
                04 detistr-SDT-KUCUK     PIC 9(4) COMP-3.
                04 detistr-SDT-FREE      PIC 9(4) COMP-3.
                04 detistr-SDT-BEBEK     PIC 9(4) COMP-3.
             03 detistr-SDT-TUTAR        PIC 9(09)V99 COMP-3.
             03 detistr-SDT-CORR         PIC 9(09)V99 COMP-3.
          02 detistr-BOS                 PIC X(30). 
