       FD detisttop  LABEL RECORD STANDARD.
       01 detisttop-REC.
          02 detisttop-ANAH.
             03 detisttop-TARIH.  
                04 detisttop-YIL           PIC 9999.
                04 detisttop-AY            PIC 99.
                04 detisttop-GUN           PIC 99.
             03 detisttop-ACENTA           PIC X(04).
             03 detisttop-ULKE-KODU        PIC XXX. 
             03 detisttop-PAN-TIPI         PIC XX. 
             03 detisttop-REZ-TIPI         PIC 9. 
             03 detisttop-ODA-KONUMU       PIC 99.
             03 destistop-anlasma-kodu     pic 99.
             
**********> Toplam Kismi........
          02 detisttop-TOPLAM. 
             03 detisttop-TOP-ODA          PIC 9(04) COMP-3.
             03 detisttop-TOP-KISI.  
                04 detisttop-TOP-BUYUK     PIC 9(04) COMP-3.
                04 detisttop-TOP-KUCUK     PIC 9(04) COMP-3.
                04 detisttop-TOP-FREE      PIC 9(04) COMP-3.
                04 detisttop-TOP-BEBEK     PIC 9(04) COMP-3.
             03 detisttop-TOP-TUTAR        PIC 9(09)V99 COMP-3.
             03 detisttop-TOP-CORR         PIC 9(09)V99 COMP-3.
**********> Oda    Kismi........
          02 detisttop-ODA. 
             03 detisttop-ODA-ODA          PIC 9(04) COMP-3.
             03 detisttop-ODA-KISI.  
                04 detisttop-ODA-BUYUK     PIC 9(04) COMP-3.
                04 detisttop-ODA-KUCUK     PIC 9(04) COMP-3.
                04 detisttop-ODA-FREE      PIC 9(04) COMP-3.
                04 detisttop-ODA-BEBEK     PIC 9(04) COMP-3.
             03 detisttop-ODA-TUTAR        PIC 9(09)V99 COMP-3.
             03 detisttop-ODA-CORR         PIC 9(09)V99 COMP-3.
**********> Kahvalti Kismi........
          02 detisttop-KAHVALTI.
             03 detisttop-KAH-ODA          PIC 9(04) COMP-3.
             03 detisttop-KAH-KISI. 
                04 detisttop-KAH-BUYUK     PIC 9(04) COMP-3.
                04 detisttop-KAH-KUCUK     PIC 9(04) COMP-3.
                04 detisttop-KAH-FREE      PIC 9(04) COMP-3.
                04 detisttop-KAH-BEBEK     PIC 9(04) COMP-3.
             03 detisttop-KAH-TUTAR        PIC 9(09)V99 COMP-3.
             03 detisttop-KAH-CORR         PIC 9(09)V99 COMP-3.
**********> Ogle     Kismi........
          02 detisttop-OGLE.
             03 detisttop-OGL-ODA          PIC 9(04) COMP-3.
             03 detisttop-OGL-KISI.  
                04 detisttop-OGL-BUYUK     PIC 9(04) COMP-3.
                04 detisttop-OGL-KUCUK     PIC 9(04) COMP-3.
                04 detisttop-OGL-FREE      PIC 9(04) COMP-3.
                04 detisttop-OGL-BEBEK     PIC 9(04) COMP-3.
             03 detisttop-OGL-TUTAR        PIC 9(09)V99 COMP-3.
             03 detisttop-OGL-CORR         PIC 9(09)V99 COMP-3.
**********> Aksam    Kismi........
          02 detisttop-AKSAM.
             03 detisttop-AKS-ODA          PIC 9(04) COMP-3.
             03 detisttop-AKS-KISI.  
                04 detisttop-AKS-BUYUK     PIC 9(04) COMP-3.
                04 detisttop-AKS-KUCUK     PIC 9(04) COMP-3.
                04 detisttop-AKS-FREE      PIC 9(04) COMP-3.
                04 detisttop-AKS-BEBEK     PIC 9(04) COMP-3.
             03 detisttop-AKS-TUTAR        PIC 9(09)V99 COMP-3.
             03 detisttop-AKS-CORR         PIC 9(09)V99 COMP-3.
**********> Icecek   Kismi........
          02 detisttop-ICECEK.
             03 detisttop-ICE-ODA          PIC 9(04) COMP-3.
             03 detisttop-ICE-KISI.  
                04 detisttop-ICE-BUYUK     PIC 9(04) COMP-3.
                04 detisttop-ICE-KUCUK     PIC 9(04) COMP-3.
                04 detisttop-ICE-FREE      PIC 9(04) COMP-3.
                04 detisttop-ICE-BEBEK     PIC 9(04) COMP-3.
             03 detisttop-ICE-TUTAR        PIC 9(09)V99 COMP-3.
             03 detisttop-ICE-CORR         PIC 9(09)V99 COMP-3.
**********> Extra    Kismi........
          02 detisttop-EXTRA.  
             03 detisttop-EXT-ODA          PIC 9(04) COMP-3.
             03 detisttop-EXT-KISI.  
                04 detisttop-EXT-BUYUK     PIC 9(04) COMP-3.
                04 detisttop-EXT-KUCUK     PIC 9(04) COMP-3.
                04 detisttop-EXT-FREE      PIC 9(04) COMP-3.
                04 detisttop-EXT-BEBEK     PIC 9(04) COMP-3.
             03 detisttop-EXT-TUTAR        PIC 9(09)V99 COMP-3.
             03 detisttop-EXT-CORR         PIC 9(09)V99 COMP-3.
**********> Extra-Bed Kismi........
          02 detisttop-EXTRA-BED.  
             03 detisttop-EXB-ODA          PIC 9(04) COMP-3.
             03 detisttop-EXB-KISI. 
                04 detisttop-EXB-BUYUK     PIC 9(04) COMP-3.
                04 detisttop-EXB-KUCUK     PIC 9(04) COMP-3.
                04 detisttop-EXB-FREE      PIC 9(04) COMP-3.
                04 detisttop-EXB-BEBEK     PIC 9(04) COMP-3.
             03 detisttop-EXB-TUTAR        PIC 9(09)V99 COMP-3.
             03 detisttop-EXB-CORR         PIC 9(09)V99 COMP-3.

**********> Complimentary Kismi ......
          02 detisttop-COMPLIMENT.
             03 detisttop-COM-ODA             PIC 9(4) COMP-3.
             03 detisttop-COM-KISI.  
                04 detisttop-COM-BUYUK        PIC 9(4) COMP-3.
                04 detisttop-COM-KUCUK        PIC 9(4) COMP-3.
                04 detisttop-COM-FREE         PIC 9(4) COMP-3.
                04 detisttop-COM-BEBEK        PIC 9(4) COMP-3.
             03 detisttop-COM-TUTAR           PIC 9(09)V99 COMP-3.
             03 detisttop-COM-CORR            PIC 9(09)V99 COMP-3.
**********> House Use     Kismi ......
          02 detisttop-HOUSE-USE.
             03 detisttop-HOU-ODA             PIC 9(4) COMP-3.
             03 detisttop-HOU-KISI.  
                04 detisttop-HOU-BUYUK        PIC 9(4) COMP-3.
                04 detisttop-HOU-KUCUK        PIC 9(4) COMP-3.
                04 detisttop-HOU-FREE         PIC 9(4) COMP-3.
                04 detisttop-HOU-BEBEK        PIC 9(4) COMP-3.
             03 detisttop-HOU-TUTAR           PIC 9(09)V99 COMP-3.
             03 detisttop-HOU-CORR            PIC 9(09)V99 COMP-3.
**********> No Show  Kismi ......
          02 detisttop-NOS-ODA             PIC 9(4) COMP-3.
          02 detisttop-NOS-KISI.  
             03 detisttop-NOS-BUYUK        PIC 9(4) COMP-3.
             03 detisttop-NOS-KUCUK        PIC 9(4) COMP-3.
             03 detisttop-NOS-FREE         PIC 9(4) COMP-3.
             03 detisttop-NOS-BEBEK        PIC 9(4) COMP-3.
          02 detisttop-NOS-TUTAR           PIC 9(09)V99 COMP-3.
          02 detisttop-NOS-CORR            PIC 9(09)V99 COMP-3.
**********> Single-Double-Triple-Group Istatistigi...........
          02 detisttop-SDT OCCURS 4 TIMES. 
             03 detisttop-SDT-ODA          PIC 9(4) COMP-3.
             03 detisttop-SDT-KISI.  
                04 detisttop-SDT-BUYUK     PIC 9(4) COMP-3.
                04 detisttop-SDT-KUCUK     PIC 9(4) COMP-3.
                04 detisttop-SDT-FREE      PIC 9(4) COMP-3.
                04 detisttop-SDT-BEBEK     PIC 9(4) COMP-3.
             03 detisttop-SDT-TUTAR        PIC 9(09)V99 COMP-3.
             03 detisttop-SDT-CORR         PIC 9(09)V99 COMP-3.
          02 detisttop-BOS                 PIC X(30). 
