       FD DETIST  LABEL RECORD STANDARD.
       01 DETIST-REC.
          02 DETIST-ANAH.
             03 DETIST-TARIH.  
                04 DETIST-YIL           PIC 9999.
                04 DETIST-AY            PIC 99.
                04 DETIST-GUN           PIC 99.
             03 DETIST-ACENTA           PIC X(04).
             03 DETIST-ULKE-KODU        PIC XXX. 
             03 DETIST-PAN-TIPI         PIC XX. 
             03 DETIST-REZ-TIPI         PIC 9. 
             03 DETIST-ODA-KONUMU       PIC 99.
             03 DETIST-ANLASMA-KODU     PIC 99.
**********> Toplam Kismi........
          02 DETIST-TOPLAM. 
             03 DETIST-TOP-ODA          PIC 9(04) COMP-3.
             03 DETIST-TOP-KISI.  
                04 DETIST-TOP-BUYUK     PIC 9(04) COMP-3.
                04 DETIST-TOP-KUCUK     PIC 9(04) COMP-3.
                04 DETIST-TOP-FREE      PIC 9(04) COMP-3.
                04 DETIST-TOP-BEBEK     PIC 9(04) COMP-3.
             03 DETIST-TOP-TUTAR        PIC 9(09)V99 COMP-3.
             03 DETIST-TOP-CORR         PIC 9(09)V99 COMP-3.
**********> Oda    Kismi........
          02 DETIST-ODA. 
             03 DETIST-ODA-ODA          PIC 9(04) COMP-3.
             03 DETIST-ODA-KISI.  
                04 DETIST-ODA-BUYUK     PIC 9(04) COMP-3.
                04 DETIST-ODA-KUCUK     PIC 9(04) COMP-3.
                04 DETIST-ODA-FREE      PIC 9(04) COMP-3.
                04 DETIST-ODA-BEBEK     PIC 9(04) COMP-3.
             03 DETIST-ODA-TUTAR        PIC 9(09)V99 COMP-3.
             03 DETIST-ODA-CORR         PIC 9(09)V99 COMP-3.
**********> Kahvalti Kismi........
          02 DETIST-KAHVALTI.
             03 DETIST-KAH-ODA          PIC 9(04) COMP-3.
             03 DETIST-KAH-KISI. 
                04 DETIST-KAH-BUYUK     PIC 9(04) COMP-3.
                04 DETIST-KAH-KUCUK     PIC 9(04) COMP-3.
                04 DETIST-KAH-FREE      PIC 9(04) COMP-3.
                04 DETIST-KAH-BEBEK     PIC 9(04) COMP-3.
             03 DETIST-KAH-TUTAR        PIC 9(09)V99 COMP-3.
             03 DETIST-KAH-CORR         PIC 9(09)V99 COMP-3.
**********> Ogle     Kismi........
          02 DETIST-OGLE.
             03 DETIST-OGL-ODA          PIC 9(04) COMP-3.
             03 DETIST-OGL-KISI.  
                04 DETIST-OGL-BUYUK     PIC 9(04) COMP-3.
                04 DETIST-OGL-KUCUK     PIC 9(04) COMP-3.
                04 DETIST-OGL-FREE      PIC 9(04) COMP-3.
                04 DETIST-OGL-BEBEK     PIC 9(04) COMP-3.
             03 DETIST-OGL-TUTAR        PIC 9(09)V99 COMP-3.
             03 DETIST-OGL-CORR         PIC 9(09)V99 COMP-3.
**********> Aksam    Kismi........
          02 DETIST-AKSAM.
             03 DETIST-AKS-ODA          PIC 9(04) COMP-3.
             03 DETIST-AKS-KISI.  
                04 DETIST-AKS-BUYUK     PIC 9(04) COMP-3.
                04 DETIST-AKS-KUCUK     PIC 9(04) COMP-3.
                04 DETIST-AKS-FREE      PIC 9(04) COMP-3.
                04 DETIST-AKS-BEBEK     PIC 9(04) COMP-3.
             03 DETIST-AKS-TUTAR        PIC 9(09)V99 COMP-3.
             03 DETIST-AKS-CORR         PIC 9(09)V99 COMP-3.
**********> Icecek   Kismi........
          02 DETIST-ICECEK.
             03 DETIST-ICE-ODA          PIC 9(04) COMP-3.
             03 DETIST-ICE-KISI.  
                04 DETIST-ICE-BUYUK     PIC 9(04) COMP-3.
                04 DETIST-ICE-KUCUK     PIC 9(04) COMP-3.
                04 DETIST-ICE-FREE      PIC 9(04) COMP-3.
                04 DETIST-ICE-BEBEK     PIC 9(04) COMP-3.
             03 DETIST-ICE-TUTAR        PIC 9(09)V99 COMP-3.
             03 DETIST-ICE-CORR         PIC 9(09)V99 COMP-3.
**********> Extra    Kismi........
          02 DETIST-EXTRA.  
             03 DETIST-EXT-ODA          PIC 9(04) COMP-3.
             03 DETIST-EXT-KISI.  
                04 DETIST-EXT-BUYUK     PIC 9(04) COMP-3.
                04 DETIST-EXT-KUCUK     PIC 9(04) COMP-3.
                04 DETIST-EXT-FREE      PIC 9(04) COMP-3.
                04 DETIST-EXT-BEBEK     PIC 9(04) COMP-3.
             03 DETIST-EXT-TUTAR        PIC 9(09)V99 COMP-3.
             03 DETIST-EXT-CORR         PIC 9(09)V99 COMP-3.
**********> Extra-Bed Kismi........
          02 DETIST-EXTRA-BED.  
             03 DETIST-EXB-ODA          PIC 9(04) COMP-3.
             03 DETIST-EXB-KISI. 
                04 DETIST-EXB-BUYUK     PIC 9(04) COMP-3.
                04 DETIST-EXB-KUCUK     PIC 9(04) COMP-3.
                04 DETIST-EXB-FREE      PIC 9(04) COMP-3.
                04 DETIST-EXB-BEBEK     PIC 9(04) COMP-3.
             03 DETIST-EXB-TUTAR        PIC 9(09)V99 COMP-3.
             03 DETIST-EXB-CORR         PIC 9(09)V99 COMP-3.

**********> Complimentary Kismi ......
          02 DETIST-COMPLIMENT.
             03 DETIST-COM-ODA             PIC 9(4) COMP-3.
             03 DETIST-COM-KISI.  
                04 DETIST-COM-BUYUK        PIC 9(4) COMP-3.
                04 DETIST-COM-KUCUK        PIC 9(4) COMP-3.
                04 DETIST-COM-FREE         PIC 9(4) COMP-3.
                04 DETIST-COM-BEBEK        PIC 9(4) COMP-3.
             03 DETIST-COM-TUTAR           PIC 9(09)V99 COMP-3.
             03 DETIST-COM-CORR            PIC 9(09)V99 COMP-3.
**********> House Use     Kismi ......
          02 DETIST-HOUSE-USE.
             03 DETIST-HOU-ODA             PIC 9(4) COMP-3.
             03 DETIST-HOU-KISI.  
                04 DETIST-HOU-BUYUK        PIC 9(4) COMP-3.
                04 DETIST-HOU-KUCUK        PIC 9(4) COMP-3.
                04 DETIST-HOU-FREE         PIC 9(4) COMP-3.
                04 DETIST-HOU-BEBEK        PIC 9(4) COMP-3.
             03 DETIST-HOU-TUTAR           PIC 9(09)V99 COMP-3.
             03 DETIST-HOU-CORR            PIC 9(09)V99 COMP-3.
**********> No Show  Kismi ......
          02 DETIST-NOS-ODA             PIC 9(4) COMP-3.
          02 DETIST-NOS-KISI.  
             03 DETIST-NOS-BUYUK        PIC 9(4) COMP-3.
             03 DETIST-NOS-KUCUK        PIC 9(4) COMP-3.
             03 DETIST-NOS-FREE         PIC 9(4) COMP-3.
             03 DETIST-NOS-BEBEK        PIC 9(4) COMP-3.
          02 DETIST-NOS-TUTAR           PIC 9(09)V99 COMP-3.
          02 DETIST-NOS-CORR            PIC 9(09)V99 COMP-3.
**********> Single-Double-Triple-Group Istatistigi...........
          02 DETIST-SDT OCCURS 4 TIMES. 
             03 DETIST-SDT-ODA          PIC 9(4) COMP-3.
             03 DETIST-SDT-KISI.  
                04 DETIST-SDT-BUYUK     PIC 9(4) COMP-3.
                04 DETIST-SDT-KUCUK     PIC 9(4) COMP-3.
                04 DETIST-SDT-FREE      PIC 9(4) COMP-3.
                04 DETIST-SDT-BEBEK     PIC 9(4) COMP-3.
             03 DETIST-SDT-TUTAR        PIC 9(09)V99 COMP-3.
             03 DETIST-SDT-CORR         PIC 9(09)V99 COMP-3.
          02 DETIST-BOS                 PIC X(30). 
