*
 fd dilayar label record standard.
 01 dilayar-rec.
    02 dilayar-anah.
       03 dilayar-tipi            pic x(3).
          88 dilayar-trk2diger value "A  ".
       03 dilayar-dil             pic x.      
       03 dilayar-program         pic x(40).
       03 dilayar-form-title      pic x(30).
       03 dilayar-line            pic 9(5)v9(2).
       03 dilayar-col             pic 9(5)v9(2).
       03 dilayar-from            pic x(100).
    02 dilayar-to                 pic x(100).
    02 dilayar-class              pic 99.
    02 filler                     pic x(200).
    02 dilayar-compile.
       03 dilayar-compile-yil     pic 9(4).
       03 dilayar-compile-ay      pic 9(2).
       03 dilayar-compile-gun     pic 9(2).
       03 dilayar-compile-saat    pic 9(2).
       03 dilayar-compile-dakika  pic 9(2).
       03 dilayar-compile-saniye  pic 9(2).
*/ dilayar dosyasina yapýlan son rewrite yada write iþlemi
    02 dilayar-update-date-time.
       03 dilayar-kistas-tarih.
          04 dilayar-kistas-yil   pic 9(4).
          04 dilayar-kistas-ay    pic 9(2).
          04 dilayar-kistas-gun   pic 9(2).
       03 dilayar-kistas-zaman.
          04 dilayar-kistas-saat   pic 9(2).
          04 dilayar-kistas-dakika pic 9(2).
          04 dilayar-kistas-saniye pic 9(2).
    02 dilayar-staf               pic x(4).


