*
 FD dokumer LABEL RECORD STANDARD.
 01 dokumer-rec.
    02 dokumer-20.
       03 dokumer-20-01.
          04 dokumer-20-islem           pic x.
             88 dokumer-20-win-baslik   value "W".
             88 dokumer-20-baslik       value "B".
             88 dokumer-20-ozellik      value "O".
             88 dokumer-20-detay        value "D".
             88 dokumer-20-data         value space.
             88 dokumer-20-toplam       value "T".
             88 dokumer-20-yuzde        value "Y".
             88 dokumer-20-islem-yok    values are h"00" thru h"31"
                                                   h"33" thru "A",
                                                     "C",
                                                     "E" thru "N",
                                                     "P" thru "S",
                                                     "U", "V",
                                                     "Z" thru h"ff".
       03 dokumer-20-02.
          04 dokumer-20-sira            pic 9 comp-x.
          04 dokumer-20-detay-sira
             redefines dokumer-20-sira  pic 9.
             88 dokumer-20-detay-1      value 1.
             88 dokumer-20-detay-2      value 2.
             88 dokumer-20-detay-3      value 3.
             88 dokumer-20-detay-4      value 4.
             88 dokumer-20-detay-5      value 5.
             88 dokumer-20-detay-6      value 6.
             88 dokumer-20-detay-7      value 7.
             88 dokumer-20-detay-8      value 8.
             88 dokumer-20-detay-9      value 9.
       03 dokumer-20-03.
          04 dokumer-20-renk            pic x.
             88 dokumer-20-renk-satir   value "A".
             88 dokumer-20-renk-cell    value "C".
             88 dokumer-20-renk-yok     values are h"00" thru "@"
                                                     "B",
                                                     "D" thru h"ff".
       03 dokumer-20-04                 pic x.
       03 dokumer-20-05.
          04 dokumer-20-yazici          pic x.
             88 dokumer-20-sayfa-basi   value "P".
             88 dokumer-20-ekran-yazma  value "-".
             88 dokumer-20-yazici-yok   values are h"00" thru h"2c",
                                                   h"2e" thru "o",
                                                     "Q" thru h"ff".
       03 dokumer-20-06.
          04 dokumer-20-esittir         pic x.
             88 dokumer-20-esit-yaz     value "=".
             88 dokumer-20-esittir-yok  values are h"00" thru h"3c",
                                                   h"3e" thru h"ff".
       03 dokumer-20-07.
          04 dokumer-20-altcizgi        pic x.
             88 dokumer-20-altcizgi-cek value "_".
             88 dokumer-20-altcizgi-yok values are h"00" thru h"5e",
                                                   h"60" thru h"ff".
       03 dokumer-20-08.
          04 dokumer-20-top-sutunu      pic 9 comp-x value zero.
             88 dokumer-20-top-yok      value zero.
             88 dokumer-20-top-var      values are 1 thru 255.
       03 dokumer-20-09.
          04 dokumer-20-yuz-sutunu      pic 9 comp-x value zero.
             88 dokumer-20-yuz-yok      value zero.
             88 dokumer-20-yuz-var      values are 1 thru 255.
       03 dokumer-20-10.
          04 dokumer-20-yazdirma-sayisi pic 9 comp-x.
          04 dokumer-20-yaz-sayi
             redefines dokumer-20-yazdirma-sayisi
                                        pic 9.
             88 dokumer-20-yaz-0        value 0.
             88 dokumer-20-yaz-1        value 1.
             88 dokumer-20-yaz-2        value 2.
             88 dokumer-20-yaz-3        value 3.
             88 dokumer-20-yaz-4        value 4.
             88 dokumer-20-yaz-5        value 5.
             88 dokumer-20-yaz-6        value 6.
             88 dokumer-20-yaz-7        value 7.
             88 dokumer-20-yaz-8        value 8.
             88 dokumer-20-yaz-9        value 9.
       03 dokumer-20-11                 pic x.
       03 dokumer-20-12                 pic x.
       03 dokumer-20-13                 pic x.
       03 dokumer-20-14                 pic x.
       03 dokumer-20-15                 pic x.
       03 dokumer-20-16                 pic x.
       03 dokumer-20-17                 pic x.
       03 dokumer-20-18                 pic x.
       03 dokumer-20-19                 pic x.
       03 dokumer-20-20                 pic x.
    02 filler                           pic x.
    02 dokumer-450.
       78 data-dokumer-length   VALUE 3000.
       03 dokumer-400                   pic x(data-dokumer-length).
       03 dokumer-son                   pic x(50).

*

