       FD DOV-BOZ  LABEL RECORD  STANDARD.
       01 DOV-BOZ-REC.
          02 DOV-BOZ-ANAH.
             03 DOV-BOZ-TARIH.
                04  DOV-BOZ-YIL      PIC 9999.
                04  DOV-BOZ-AY       PIC 99.
                04  DOV-BOZ-GUN      PIC 99.
              03 DOV-BOZ-ALIS-SATIS  pic 9.
              03 DOV-BOZ-FISNO       PIC 9(05).
**********02 DOV-BOZ-ALIS-SATIS     PIC X.
***********  Dov-Boz-Alis-Satis = 0-> Doviz-Alisi 1-> Doviz-Satisi
          02 DOV-BOZ-BANKA          PIC 99.
          02 DOV-BOZ-TIPI           PIC X.
***********  Dov-Boz-Tipi = D-> Doviz E-> Efektif
          02 DOV-BOZ-DOVIZ          PIC  99.
***********  Dov-Boz-Doviz = Doviz Kodu
          02 DOV-BOZ-KUR-TUTAR      PIC 9(9)V9(05).
          02 DOV-BOZ-DV-TUTAR       PIC 9(9)V99.
          02 DOV-BOZ-TL-TUTAR       PIC 9(12)V99.
          02 DOV-BOZ-KOM-ORANI      PIC 9(02).
          02 DOV-BOZ-KOMISYON       PIC 9(12)V99.
          02 DOV-BOZ-NET-TL-TUTAR   PIC 9(12)V99.
          02 DOV-BOZ-BILGI.
             03 DOV-BOZ-FOLIO       PIC  9(08).
             03 DOV-BOZ-ADI         PIC  X(20).
             03 DOV-BOZ-SOY         PIC  X(20).
             03 DOV-BOZ-ULKE        PIC  X(03).
             03 DOV-BOZ-BELGE       PIC  9.
********* Dov-Boz-Belge -> 1->Nuf.Cuz 2->Pasaport 3->Ehliyet 4->Evlilik Cuz
*********                  5->Sigorta Karti 6->Diger......
             03 DOV-BOZ-BELGE-TAR.
                04 DOV-BOZ-BELGE-YIL    PIC 9999.
                04 DOV-BOZ-BELGE-AY     PIC 99.
                04 DOV-BOZ-BELGE-GUN    PIC 99.
             03 DOV-BOZ-BELGE-NO        PIC X(10).
             03 DOV-BOZ-BELGE-YERI      PIC X(10).
          02 DOV-BOZ-ZAMAN.
             03 DOV-BOZ-SAAT   PIC 99.
             03 DOV-BOZ-DAKIKA PIC 99.
             03 DOV-BOZ-SANIYE PIC 99.
          02 DOV-BOZ-SERINO             PIC X(40).
          02 DOV-BOZ-DURUMU             PIC X.
          02 DOV-BOZ-ELLE               PIC X(1).
          02 DOV-BOZ-sil-ZAMAN.
             03 DOV-BOZ-sil-SAAT   PIC 99.
             03 DOV-BOZ-sil-DAKIKA PIC 99.
             03 DOV-BOZ-sil-SANIYE PIC 99.
          02 DOV-BOZ-sil-STAF           PIC X(04).
          02 DOV-BOZ-ODA                PIC X(04).
          02 DOV-BOZ-islem              pic 9(8).
          02 DOV-BOZ-BOS                PIC X(07).
          02 DOV-BOZ-STAF               PIC X(04).
********* Dov-Boz-Durmu -> S->Silinmis Kayit... 
