       FD DOVIZ LABEL RECORD STANDARD.
       01 DOVIZ-REC.
          02 DOVIZ-KODU          PIC 9(2).
          02 D-KISA-ADI          PIC X(05).
          02 D-ADI-1             PIC X(20).
          02 D-ACIKLAMA-1        PIC X(07).
          02 D-MERKEZ-BANKA-KODU PIC X(03).
          02 D-hesap             PIC x(10).
          02 D-STAF              PIC X(04).
