********************

 FD esAKSIYON LABEL RECORD STANDARD.
 01 esAKSIYON-REC.
    02 esAKSIYON-ANAH.
       03 esAKSIYON-TIPI          PIC X.
       03 esAKSIYON-ACENTA        PIC X(4).
       03 esAKSIYON-DETAY.
          04 esAKSIYON-PAN-TIPI   PIC X(02).
          04 esAKSIYON-CAL-TIPI   PIC X.
          04 esaksiyon-konum      pic xx.
          04 esAKSIYON-BOS        PIC X(02).
       03 esAKSIYON-G-TARIH.
          04 esAKSIYON-G-YIL      PIC 9(04).
          04 esAKSIYON-G-AY       PIC 9(02).
          04 esAKSIYON-G-GUN      PIC 9(02).
       03 esAKSIYON-C-TARIH.
          04 esAKSIYON-C-YIL      PIC 9(04).
          04 esAKSIYON-C-AY       PIC 9(02).
          04 esAKSIYON-C-GUN      PIC 9(02).
       03 esAKSIYON-GECELE        PIC 9(02).
    02 esAKSIYON-ODE              PIC 9(02).
    02 esAKSIYON-SONDAN           PIC 9.
    02 esAKSIYON-ODA-BASI         PIC 9.
    02 esaksiyon-geceleme2        pic 99.
    02 esAKSIYON-ODE-kusur        PIC 9(02).
    02 esaksiyon-ekle             pic 9.
    02 esaksiyon-hes-tipi         pic 9.
    02 esAKSIYON-ebharic          PIC 9.
    02 esaksiyon-k-bazli          pic 9.  
    02 esAKSIYON-STAF             PIC X(04).


*** aksiyon-cal-tipi  special-offer da 1-pax + cocuk /2   toplam
***                                 2-pax + cocuk toplam
***                                 3-per oda toplam (rezervasyon) 
***                                 4-per pax  geceleme            
*******                             5 per  pax + child/2  gecelme  
*******                             6 per pax + child geceleme     
*******                             7-per oda gecelemesi     
*************                       0 eskisi gibi  pax toplam 
*** Aksiyon-Tipi     -> A->Aksiyon S->Stop sale K->Acenta Komisyon
*** Aksiyon-geceleme -> Kalis Gunu  K->Komisyonda Kendi Komisyonu
*** Aksiyon-ode      -> Odeme Gunu  K->Komisyonda Diger Acenta Komisyonu
*** Ornek.......     -> 14 gun kal 10 gun ode gibi...
*** Aksiyon-cal-tipi -> I->Rez.Isleme Tarihi G->Rez.Giris Tarihi

