       FD esAKSIYHRK LABEL RECORD STANDARD.
       01 esAKSIYHRK-REC.
          02 esAKSIYHRK-ANAH.
             03 esAKSIYHRK-TIPI          PIC X.
             03 esAKSIYHRK-ACENTA        PIC X(04).
             03 esAKSIYHRK-DETAY.
                04 esAKSIYHRK-PAN-TIPI   PIC X(02).
                04 esAKSIYHRK-CAL-TIPI   PIC X.
                04 esaksiyhrk-konum      pic xx.
                04 esAKSIYHRK-BOS        PIC X(02).
             03 esAKSIYHRK-TARIH.
                04 esAKSIYHRK-YIL        PIC 9(04).
                04 esAKSIYHRK-AY         PIC 9(02).
                04 esAKSIYHRK-GUN        PIC 9(02).
             03 esAKSIYHRK-GECELE        PIC 9(02).
          02 esAKSIYHRK-ODE              PIC 9(02)v99.
          02 esAKSIYHRK-SONDAN           PIC 9.
          02 esaksiyhrk-ekle             pic 9.
          02 esaksiyhrk-hes-tipi         pic 9.
          02 esaksiyhrk-ebharic           pic 9.
          02 esaksiyhrk-oransal          pic 9.
          02 esaksiyhrk-minimum          pic 99.
          02 esaksiyhrk-rezal-tar1.
              05 esaksiyhrk-rezal-bas-yil  PIC 9(4).
              05 esaksiyhrk-rezal-bas-ay   PIC 9(2).
              05 esaksiyhrk-rezal-bas-gun  PIC 9(2).
          02 esaksiyhrk-rezal-tar2.
              05 esaksiyhrk-rezal-bit-yil  PIC 9(4).
              05 esaksiyhrk-rezal-bit-ay   PIC 9(2).
              05 esaksiyhrk-rezal-bit-gun  PIC 9(2).          
          02 esaksiyhrk-k-bazli          pic 9. 
          02 esaksiyhrk-bas-tar          pic x(8).
          02 esaksiyhrk-bit-tar          pic x(8).
          02 esAKSIYHRK-BOS1             PIC X(13).
**********Aksiyhrk-tipi     ->A->Aksiyon S->Stopsale K->Acenta Komisyon
**********Aksiyhrk-cal-tipi ->I->Rez.Isleme Tarihi G->Rez.Giris Tarihi
