**********
 FD escast  LABEL RECORD STANDARD.
  01 escast-REC.
           02 escast-ANAH.
**************(( XFD DATE=YYYYMMDD, USE GROUP ))
*****************    $XFD NAME=escast-TARIH
              03 escast-TARIH.
                 04 escast-YIL       PIC 9(4).
                 04 escast-AY        PIC 9(2).
                 04 escast-GUN       PIC 9(2).
              03 escast-REZ-NO       PIC 9(08).
           02 escast-ODA-NO          PIC X(04).
           02 escast-KISI.
              03 escast-BUYUK        PIC 9(02).
              03 escast-KUCUK        PIC 9(02).
              03 escast-BEBEK        PIC 9(01).
              03 escast-FREE         PIC 9(01).
           02 escast-FIYATI          PIC 9(10)V99 COMP-3.
           02 escast-ANLASMA-FIYATI  PIC 9(10)V99 COMP-3.
           02 escast-BASILAN-FIYAT   PIC s9(10)V99 COMP-3.
           02 escast-ODA-KONUMU      PIC 99.
           02 escast-FIYAT-KONUMU    PIC 99.
           02 escast-ANLASMA         PIC XX.
           02 escast-PAN-TIPI        PIC XX.
           02 escast-ODA-ADET        PIC 9.
           02 escast-share           PIC 9.
           02 escast-fiyat-yok       pic 9. 
           02 escast-duzeltme        PIC s9(7)v99.

***********escast-ODA-ADET    0 Ise Sharing yapilmis rez demektir
***********                  Istatistiklerde oda sayilmamali.
***********                  Normalde her rez icin 1 olmali
***********escast-KISI-KONAKLAMA  "E" Kisi Konaklama Var
***********                      "H" Kisi Konaklama Yok





