*
 FD esNT LABEL RECORD STANDARD.
 01 esnot-REC.
      03 filler.
          05 esnot-ANAH.
             07 esnot-DOS           PIC XXX.
             07 esnot-DOS-ANAH      PIC X(30).
             07 esnot-SIRA          pic 99. 
       03 esnot-gerisi.      
          05 esnot-BUYUK     .
            06 esnot1     PIC X(100) .
            06 esnot2.   
              07 esnot-Giris-BILGI.
               09 esnot-Giris-TARIH.
                 11 esnot-Giris-YIL        PIC 9999.
                 11 esnot-Giris-AY         PIC 99.
                 11 esnot-Giris-GUN        PIC 99.
               09 esnot-Giris-ZAMAN.
                 11 esnot-Giris-SAAT       PIC 99.
                 11 esnot-Giris-DAKIKA     PIC 99.
                 11 esnot-Giris-SANIYE     PIC 99.
               09 esnot-Giris-STAF         PIC X(04). 
             07 esnot-ILK-OKU-BILGI.
               09 esnot-ILK-OKU-TARIH.
                 11 esnot-ILK-OKU-YIL      PIC 9999.
                 11 esnot-ILK-OKU-AY       PIC 99.
                 11 esnot-ILK-OKU-GUN      PIC 99.
               09 esnot-ILK-OKU-ZAMAN.
                 11 esnot-ILK-OKU-SAAT     PIC 99.
                 11 esnot-ILK-OKU-DAKIKA   PIC 99.
                 11 esnot-ILK-OKU-SANIYE   PIC 99.
               09 esnot-ILK-OKU-STAF       PIC X(04). 
             07 esnot-son-OKU-BILGI.
               09 esnot-son-OKU-TARIH.
                 11 esnot-son-OKU-YIL      PIC 9999.
                 11 esnot-son-OKU-AY       PIC 99.
                 11 esnot-son-OKU-GUN      PIC 99.
               09 esnot-son-OKU-ZAMAN.
                 11 esnot-son-OKU-SAAT     PIC 99.
                 11 esnot-son-OKU-DAKIKA   PIC 99.
                 11 esnot-son-OKU-SANIYE   PIC 99.
               09 esnot-son-OKU-STAF       PIC X(04). 
          05 esnot-TIP              PIC X.  
          05 esnot-ALT-TIP          PIC 9.
          05 esnot-OKUNDU           PIC 9.
          05 esnot-GOSTERME         PIC 9.
          05 esnot-SIL              PIC 9.
          05 esnot-NEREDE.
             07 esnot-REZ           PIC 9.
             07 esnot-REGISTER      PIC 9.
             07 esnot-RACKDE        PIC 9.
             07 esnot-BLOKAJ        PIC 9.
             07 esnot-CEKR          PIC 9.
             07 esnot-CEKE          PIC 9.
             07 esnot-COUTr          PIC 9.
             07 esnot-COUTe          PIC 9.
             07 esnot-CIN           PIC 9.
             07 esnot-RFOLIO        PIC 9.
             07 esnot-EFOLIO        PIC 9.
             07 esnot-pos           pic 9.
             07 esnot-NEREYE-BOS    PIC 9.

             
          05 esnot-bos             PIC X(10).
          

*********>             A C I K L A M A L A R      *******************
*********>  esnot-DOSYA ONCE DOSYA ADI -REZ--REZ
*****                                     -KON--KONUK
*****                                     -RHR--ROMHRK
*****                                     -EXT--EXTHRK
*****                                     -FAN--FIYATANA
*****                                     -STF--STAF DA ILK GIRISDE
*****       esnot-TIP ---M-MESAJ
*****                  N-esnot
*****                  A-ACIKLAMA
*****                  S-Silinmis
*****       esnot-ALT-TIP--- 

