       FD esrez LABEL RECORD STANDARD.
       01 esrez-REC.
          02 esrez-ANAH.
             03 esrez-NO             PIC 9(08).
          02 esrez-TIPI              PIC 9.
**********>1->Alotment 2->It 3->Grup 4->Munferit...gibi
          02 esrez-DURUMU            PIC X.
**********>esrez-Durumu => esrezervasyonun durumunu belirtir....
**********>I->Iceridekir esrez.  S->Silinmis,Iplat esrez.
**********>Onemli butun anahtar sahalarda olacak...............
          02 esrez-ACEN-ANAH.
             03 esrez-ACENTA         PIC X(4).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=esrez_GIR_TAR
             03 esrez-GIR-TAR.
                04 esrez-GIR-YIL     PIC 9999.
                04 esrez-GIR-AY      PIC 99.
                04 esrez-GIR-GUN     PIC 99.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=esrez_CIK_TAR
             03 esrez-CIK-TAR.
                04 esrez-CIK-YIL     PIC 9999.
                04 esrez-CIK-AY      PIC 99.
                04 esrez-CIK-GUN     PIC 99.
          02 esrez-ADI               PIC X(20).
          02 esrez-SOYADI            PIC X(20).
          02 esrez-BANKA             PIC 99.
          02 esrez-DOVIZ             PIC 99.
          02 esrez-ANLASMA           PIC XX.
          02 esrez-ODEME-TIPI        PIC XX.
          02 esrez-PAN-TIPI          PIC XX.
          02 esrez-ULKE              PIC X(03).
          02 esrez-VOUCHER           PIC X(10).
          02 esrez-KUR-AYGUN         PIC X.
**********>A->Ay basi kuru   G->Gunluk Kur....
          02 esrez-K-G-B             PIC X.
**********>K->Confirme G->Gecici B->Beklemede I-Infox
          02 esrez-VIP               PIC X.
**********>V->V.I.P    T->Top V.I.P
          02 esrez-KOMISYON          PIC 99.
**********>esrez-Komisyon   -> Acenta Komisyonunu Belirlemek Icin Kullanilir
          02 esrez-NOR-INDIRIM       PIC 99V99.
**********>esrez-Nor-Indirim-> Girilen oran kadar fiyattan indirilecek......
**********>Indirim ile cocuk indirimi birlestirildi..
          02 esrez-C-IN              PIC X.
          02 esrez-FOLIO             PIC 9(08).
**********>esrez-C-In       -> esrezervasyonun C/In Yapilip yapilmadigini belirtir.
**********>esrez-Folio      -> esrezervasyon  C/In Yapildiginda Folio nosu islenir
          02 esrez-ODANO             PIC X(04).
**********>esrez-Odano      -> esrezervasyon esnasinda blokaj yapmaya yarar........
          02 esrez-S-D-T-G           PIC 9.
          02 esrez-ODA-KONUMU        PIC 99.
          02 esrez-KISI.
             03 esrez-BUYUK          PIC 9(02).
             03 esrez-KUCUK          PIC 9(02).
             03 esrez-BEBEK          PIC 9(01).
             03 esrez-FREE           PIC 9(01).
          02 esrez-FIYATI            PIC 9(12)V99 COMP-3.
**********>
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=esrez_ISL_TAR
          02 esrez-ISL-TAR.
             03 esrez-ISL-YIL        PIC 9999.
             03 esrez-ISL-AY         PIC 99.
             03 esrez-ISL-GUN        PIC 99.
          02 esrez-AL-TAR.
             03 esrez-AL-YIL         PIC 9999.
             03 esrez-AL-AY          PIC 99.
             03 esrez-AL-GUN         PIC 99.
          02 esrez-OPS-TAR.
             03 esrez-OPS-YIL        PIC 9999.
             03 esrez-OPS-AY         PIC 99.
             03 esrez-OPS-GUN        PIC 99.
          02 esrez-GEL-ZAMAN.
             03 esrez-GEL-SAAT       PIC 99.
             03 esrez-GEL-DAK        PIC 99.
          02 esrez-GIT-ZAMAN.
             03 esrez-GIT-SAAT       PIC 99.
             03 esrez-GIT-DAK        PIC 99.
          02 esrez-GENEL-BILGI.
             03 esrez-GRUP-ANAH.
                04 esrez-GRUP-NO     PIC 9(06).
                04 esrez-GRUP-ADI    PIC X(13).
             03 esrez-ADRES1         PIC X(20).
             03 esrez-ADRES2         PIC X(14).
             03 esrez-AKSIYON2-EH    pic 9.
             03 esrez-SPECIAL2-EH     pic 9.
             03 esrez-statu          pic x.
             03 esrez-iptal          pic 9.
             03 esrez-sil-sebeb      pic x(2).
             03 esrez-NOT1           PIC X(20).
             03 esrez-NOT2           PIC X(18).
             03 esrez-profil-anah.
               05 esrez-profil-sirket  PIC X(8).
               05 esrez-profil-no      pic 9(8).
             03 esrez-gel-sirket     PIC X(02).
             03 esrez-git-sirket     PIC X(02).
             03 esrez-operator       pic x(02).
             03 esrez-E-MAIL         PIC X(01).
             03 esrez-gr-olabilir    pic 9.
             03 esrez-voucher-gir-tar.
                04 esrez-voucher-GIR-YIL     PIC 9999.
                04 esrez-voucher-GIR-AY      PIC 99.
                04 esrez-voucher-GIR-GUN     PIC 99.
             03 esrez-gr-status      pic x.
             03 esrez-kaynak-1       pic x(02).
             03 esrez-kaynak-2       pic x(02).
             03 esrez-kaynak-3       pic x(02).
             03 esrez-firma          pic x(05).
             03 esrez-extra-kart2    pic x(7).
          02 esrez-EXTRA-KART        PIC X(7).
          02 esrez-LATE-ZAMAN.
             03 esrez-LATE-GEL-SAAT  PIC 99.
             03 esrez-LATE-GEL-DAK   PIC 99.
          02 esrez-ON-ODEME          PIC 9(12)V99 COMP-3.
          02 esrez-ON-DOVIZ          PIC 9(02).
          02 esrez-PAZAR             PIC X(02).
          02 esrez-EB                PIC X.
          02 esrez-FIYAT-FIX         PIC X.
**********>esrez-FIYAT-FIX  ->="E" Peryot degisiminde fiyatti degismesin     
          02 esrez-FIYAT-KONUMU      PIC 99.
          02 esrez-AKSIYON-EH        PIC X.
          02 esrez-BILBORD-EH        PIC X.
          02 esrez-UG-IND            PIC 9.
          02 esrez-CIN-KURU          PIC 999V99999.
          02 esrez-ODA-TIPI          PIC XX.
          02 esrez-SPECIAL-EH        PIC 9.
          02 esrez-OZEL-DURUM-CAR    PIC 999V9999999.
          02 esrez-OZEL-DURUM        PIC 99.
          02 esrez-TITLE             PIC X(09).
          02 esrez-gec               pic 9.
          02 esrez-plan              pic 9.
          02 esrez-rehber            pic x(2).
          02 esrez-FIYAT-FLAG.
             05 esrez-AKSIYON-FLAG   PIC 9.
             05 esrez-renk           PIC 9.
             05 esrez-SPECIAL-FLAG   PIC 9.
          02 esrez-ODA-TIPI2         PIC XX.
          02 esrez-ODA-TIPI3         PIC XX.
          02 esrez-TIKLER.
             05 esrez-ozel-tip       PIC x.
             05 esrez-tam-blok       PIC 9.
             05 esrez-share          PIC 9.
           
          02 esrez-STAF              PIC X(04).
          
**************          
       FD esrezek LABEL RECORD STANDARD.
       01 esrezek-REC.
          02 esrezek-ANAH.
             03 esrezek-NO             PIC 9(08).
          02 esrezek-datalar           .
              05 esrezek-source1    pic x(2).
              05 esrezek-source2    pic x(2).
              05 esrezek-source3    pic x(2).
              05 esrezek-gr-status  pic x.
              05 esrezek-bos    pic x(100).
              05 esrezek-esrezidance redefines esrezek-bos.
                07 esrezek-fiyat-tip   pic 9. | 0-gunluk 1- aylik
                07 esrezek-aylik-fiyat  pic 9(8)v99.
                07 esrezek-odeme-gunu   pic 99.
                07 esrezek-odeme-tip   pic 9. | 0-ay bitiminde 1- on odemeli
                07 esrezek-aidat-odeme-tip   pic 9.| 0-ay bitiminde 1- on odmemeli
                07 esrezek-aidat-fiyat  pic 9(8)v99.
                07 esrezek-aidat-odeme-gunu   pic 99.
                
              05 esrezek-STAF              PIC X(04).

******************
       FD esrezdigtar LABEL RECORD STANDARD.
       01 esrezdigtar-REC.
          02 esrezdigtar-ANAH.
             03 esrezdigtar-esrezno             PIC 9(08).
          02 esrezdigtar-mail-tar.
             03 esrezdigtar-mail-YIL         PIC 9999.
             03 esrezdigtar-mail-AY          PIC 99.
             03 esrezdigtar-mail-GUN         PIC 99.
          02 esrezdigtar-odeme-tar.
             03 esrezdigtar-odeme-YIL         PIC 9999.
             03 esrezdigtar-odeme-AY          PIC 99.
             03 esrezdigtar-odeme-GUN         PIC 99.
          02 esrezdigtar-odemeeb-tar.
             03 esrezdigtar-odemeeb-YIL         PIC 9999.
             03 esrezdigtar-odemeeb-AY          PIC 99.
             03 esrezdigtar-odemeeb-GUN         PIC 99.
          02 esrezdigtar-odemeeb-oran      pic 999.
          02 esrezdigtar-4-tar.
             03 esrezdigtar-4-YIL         PIC 9999.
             03 esrezdigtar-4-AY          PIC 99.
             03 esrezdigtar-4-GUN         PIC 99.
         
         02 esrezdigtar-5-tar    pic x(8).
         02 esrezdigtar-6-tar    pic x(8).
         02 esrezdigtar-aylik    pic 9.
         02 esrezdigtar-bos      pic x(99).
