
       FD EXTPOST LABEL RECORD STANDARD.
       01 EXTPOST-REC.
          02 EXTPOST-ANAH.
             03 EXTPOST-FOLIO      PIC 9(08). 
             03 EXTPOST-DEP        PIC 9(03). 
          02 EXTPOST-DURUMU        PIC X.       
          02 EXTPOST-P-K           PIC X.       
          02 EXTPOST-SAT-TAR.     
             03 EXTPOST-SAT-YIL        PIC 9999.
             03 EXTPOST-SAT-AY         PIC 99.
             03 EXTPOST-SAT-GUN        PIC 99.
          02 EXTPOST-ILK-TAR.     
             03 EXTPOST-ILK-YIL        PIC 9999.
             03 EXTPOST-ILK-AY         PIC 99.
             03 EXTPOST-ILK-GUN        PIC 99.
          02 EXTPOST-SON-TAR.     
             03 EXTPOST-SON-YIL        PIC 9999.
             03 EXTPOST-SON-AY         PIC 99.
             03 EXTPOST-SON-GUN        PIC 99.
          02 EXTPOST-POSTKODU          PIC X(04).
          02 EXTPOST-TL-TUTAR          PIC 9(12)V99 COMP-3.
          02 EXTPOST-DV-TUTAR          PIC 9(09)V99 COMP-3.
          02 EXTPOST-POSTING-EH        PIC X. 
          02 EXTPOST-BOS               PIC X(20).  
          02 EXTPOST-STAF              PIC X(04).  
