***** 
 fd fatdetay label record standard.
 01 fatdetay-rec.
    02 fatdetay-anah.
       03 fatdetay-fat-tar.
               05 fatdetay-fat-yil      PIC  9(04).
               05 fatdetay-fat-ay       PIC  9(02).
               05 fatdetay-fat-gun      PIC  9(02).
       03 fatdetay-fat-no            pic x(10).
       03 fatdetay-kdv               pic 99v99.
       03 fatdetay-tip               pic x.
       03 fatdetay-depkod            pic xxx.
       03 fatdetay-folio             pic x(8).       
       03 fatdetay-islem             pic x(8). 
    02 fatdetay-romhrk-exthrk        pic x.
    02 fatdetay-isl-tar.
               05 fatdetay-isl-yil      PIC  9(04).
               05 fatdetay-isl-ay       PIC  9(02).
               05 fatdetay-isl-gun      PIC  9(02).
    02 fatdetay-kes-tar.
          03 fatdetay-kes-tarih.
               05 fatdetay-kes-yil      PIC  9(04).
               05 fatdetay-kes-ay       PIC  9(02).
               05 fatdetay-kes-gun      PIC  9(02).
          03 fatdetay-kes-zaman.
               05 fatdetay-kes-saat       PIC  9(02).
               05 fatdetay-kes-dak      PIC  9(02).
     02 fatdetay-kdv-orani           pic 9(03)v99.
     02 fatdetay-fatura-matrah       pic s9(15)v99. 
     02 fatdetay-fatura-kdv          pic s9(15)v99. 
     02 fatdetay-fatura-toplam       pic s9(15)v99.
     02 fatdetay-fatura-toplamdv       pic s9(8)v99.
     02 fatdetay-fatura-matrah18     pic s9(8)v99.
     02 fatdetay-fatura-kdv18        pic s9(8)v99.

     02 fatdetay-bos                 pic x(20).
     
