       FD FATURA LABEL RECORD STANDARD.
       01 FATURA-REC. 
          02 FATURA-ANAH. 
             03 FATURA-TARIH.
                04 FATURA-YIL     PIC 9999. 
                04 FATURA-AY      PIC 99. 
                04 FATURA-GUN     PIC 99. 
             03 FATURA-FOLIO      PIC 9(08). 
          02 FATURA-TIPI          PIC X. 
**********Fatura-Tipi =>[F] Folio Faturasi [A] Acenta Faturasi
          02 FATURA-ACENTA        PIC XXXX. 
          02 FATURA-PAN-TIPI      PIC XX. 
          02 FATURA-GIR-TAR. 
             03 FATURA-GIR-YIL    PIC 9999.
             03 FATURA-GIR-AY     PIC 99.
             03 FATURA-GIR-GUN    PIC 99.
          02 FATURA-CIK-TAR. 
             03 FATURA-CIK-YIL    PIC 9999.
             03 FATURA-CIK-AY     PIC 99.
             03 FATURA-CIK-GUN    PIC 99.
          02 FATURA-ODANO         PIC X(04).
          02 FATURA-ODA           PIC 9(03).
          02 FATURA-KISI. 
             03 FATURA-BUYUK      PIC 999.
             03 FATURA-KUCUK      PIC 999.
             03 FATURA-BEBEK      PIC 9.
             03 FATURA-FREE       PIC 99.
          02 FATURA-INDIRIM       PIC 9(15)V99. 
          02 FATURA-MATRAH        PIC 9(15)V99. 
          02 FATURA-KDV           PIC 9(15)V99. 
          02 FATURA-TOPLAM        PIC 9(15)V99. 
          02 FATURA-BOS           PIC X(50). 
          02 FATURA-STAF          PIC X(04). 
