*
 fd faxmng label record standard.
 01 faxmng-rec.
    02 faxmng-anah.
       03 faxmng-tipi           pic xxx.
          88 faxmng-fax      value "A  ".
          88 faxmng-mail     value "M  ".
       03 faxmng-islem-no       pic 9(10).
******** genelfis-log-no kullanildi
       03 faxmng-ilk-tarih.
          04 faxmng-ilk-yil        pic 9(4).
          04 faxmng-ilk-ay         pic 9(2).
          04 faxmng-ilk-gun        pic 9(2).
       03 faxmng-ilk-zaman.
          04 faxmng-ilk-saat       pic 9(2).
          04 faxmng-ilk-dakika     pic 9(2).
          04 faxmng-ilk-saniye     pic 9(2).
       03 faxmng-islem-sira     pic 9(4).
       03 filler                pic x(20).

    02 faxmng-ilk-staf-adi      pic x(20).
    02 faxmng-ilk-staf-soyadi   pic x(20).
    02 faxmng-ilk-staf          pic x(4).
    02 faxmng-durum.
       03 faxmng-ana-durum      pic x.
          88 faxmng-ana-durum-beklemede      value "A"," ".
          88 faxmng-ana-durum-gonderildi     value "B".
          88 faxmng-ana-durum-iptal          value "C".
          88 faxmng-ana-durum-gonderilemeyen value "D".
       03 faxmng-alt-durum      pic x.
          88 faxmng-alt-durum-beklemede      value "A".
          88 faxmng-alt-durum-gonderilemeyen value "B".
    02 faxmng-son-staf          pic x(4).
    02 faxmng-son-staf-adi      pic x(20).
    02 faxmng-son-staf-soyadi   pic x(20).
    02 faxmng-son-tarih.
       03 faxmng-son-yil        pic 9(4).
       03 faxmng-son-ay         pic 9(2).
       03 faxmng-son-gun        pic 9(2).
    02 faxmng-son-zaman.
       03 faxmng-son-saat       pic 9(2).
       03 faxmng-son-dakika     pic 9(2).
       03 faxmng-son-saniye     pic 9(2).
    02 faxmng-tel               pic x(30).
    02 faxmng-dosya             pic x(100).
    02 faxmng-dosya2            pic x(100).
    02 faxmng-dosya3            pic x(100).
    02 faxmng-dosya4            pic x(100).
    02 faxmng-dosya5            pic x(100).
    02 faxmng-dosya6            pic x(100).
    02 faxmng-to                pic x(50).
    02 faxmng-bilgi             pic x(200).
    02 faxmng-aciklama          pic x(100).
    02 faxmng-proc.
       03 faxmng-proc-occ occurs 100 times.
          04 faxmng-proc-eh                     pic x.
*/ dizide islem varsa E
          04 faxmng-proc-start-tarih.
             05 faxmng-proc-start-yil           pic 9(4).
             05 faxmng-proc-start-ay            pic 9(2).
             05 faxmng-proc-start-gun           pic 9(2).
          04 faxmng-proc-start-zaman.
             05 faxmng-proc-start-saat          pic 9(2).
             05 faxmng-proc-start-dakika        pic 9(2).
             05 faxmng-proc-start-saniye        pic 9(2).
          04 faxmng-proc-finish-tarih.
             05 faxmng-proc-finish-yil          pic 9(4).
             05 faxmng-proc-finish-ay           pic 9(2).
             05 faxmng-proc-finish-gun          pic 9(2).
          04 faxmng-proc-finish-zaman.
             05 faxmng-proc-finish-saat         pic 9(2).
             05 faxmng-proc-finish-dakika       pic 9(2).
             05 faxmng-proc-finish-saniye       pic 9(2).
          04 faxmng-proc-status         pic s9(5).
          04 faxmng-proc-tel            pic x(20).
    02 faxmng-oncelik           pic x.
       88 faxmng-acil   value "A".
       88 faxmng-onemli value "O".
       88 faxmng-normal valUE " ".
    02 faxmng-faxhavuz                  pic x(3).
    02 faxmng-proc-son-i                pic 9(3).
    02 filler                   pic x(394).
