       FD fiyatana2 LABEL RECORD STANDARD.
       01 fiyatana2-REC.
          02 fiyatana2-ANAH.
             03 fiyatana2-DIGER-ANAH.
                  04 fiyatana2-PER-ANAH.
                     05 fiyatana2-ACENTA     PIC X(4).
                     05 fiyatana2-ILK-TARIH.
                        06 fiyatana2-ILK-YIL PIC 9999.
                        06 fiyatana2-ILK-AY  PIC 99.
                        06 fiyatana2-ILK-GUN PIC 99.
                     05 fiyatana2-SON-TARIH.
                        06 fiyatana2-SON-YIL PIC 9999.
                        06 fiyatana2-SON-AY  PIC 99.
                        06 fiyatana2-SON-GUN PIC 99.

                   04 fiyatana2-REZ-TIPI   PIC 9.
                   04 fiyatana2-PAN-TIPI   PIC XX.
                   04 fiyatana2-BANKA      PIC 99.
                   04 fiyatana2-DOVIZ      PIC 99.
                   04 fiyatana2-ANLASMA    PIC XX.
             03 fiyatana2-BUYUK      PIC 99.
             03 fiyatana2-KUCUK      PIC 99.
          02 fiyatana2-ODA-DIZI.
             03 fiyatana2-KONUM-DIZI OCCURS 19 TIMES.
                04 fiyatana2-ODA-FIYATI PIC 9(12)V99 COMP-3.
          02 fiyatana2-KICK-BACK     PIC 999.
          02 fiyatana2-EB-EH         PIC X.
          02 fiyatana2-EB-ORAN       PIC 9(2).
          02 fiyatana2-EB-BAS-TARIH.
             03 fiyatana2-EB-BAS-YIL PIC 9(4).     
             03 fiyatana2-EB-BAS-AY  PIC 9(2).     
             03 fiyatana2-EB-BAS-GUN PIC 9(2).     
          02 fiyatana2-EB-BIT-TARIH.
             03 fiyatana2-EB-BIT-YIL PIC 9(4).     
             03 fiyatana2-EB-BIT-AY  PIC 9(2).     
             03 fiyatana2-EB-BIT-GUN PIC 9(2).

          02 fiyatana2-UG-EH         PIC X.
          02 fiyatana2-UG-ORAN       PIC 9(2).
          02 fiyatana2-UG-geceleme    PIC 9(3).
          02 fiyatana2-UG-BAS-TARIH.
             03 fiyatana2-UG-BAS-YIL PIC 9(4).     
             03 fiyatana2-UG-BAS-AY  PIC 9(2).     
             03 fiyatana2-UG-BAS-GUN PIC 9(2).     
          02 fiyatana2-UG-BIT-TARIH.
             03 fiyatana2-UG-BIT-YIL PIC 9(4).     
             03 fiyatana2-UG-BIT-AY  PIC 9(2).     
             03 fiyatana2-UG-BIT-GUN PIC 9(2).

          02 fiyatana2-ACIKLAMA      PIC X(20).
          02 fiyatana2-fiks          pic 9.
          02 fiyatana2-eb-kusur      pic 99.
          02 fiyatana2-ug-kusur      pic 99.
          02 fiyatana2-KICK-BACK2    PIC 999.
          02 fiyatana2-BOS           PIC X(12).
          02 fiyatana2-STAF          PIC X(04).

********* fiyatana2-konum-dizi -> Fiyatin oda tipi (standart,suit...)
********* Fiyat-Rez-tipi      -> Fiyatin rezervasyon tipi 1-Alotment 2-It.
********* Fiyat-Pan-tipi      -> Fiyatin Pansiyon    tipi BO,BB,HB,FB,HI..
********* Fiyat-Banka         -> Hangi banka ile calisiliyor..............
********* Fiyat-Doviz         -> Hangi kur ile calisiliyor................
********* fiyatana2-Anlasma    -> Aanlasma Tipi 
********* fiyatana2-Buyuk      -> Buyuk Kisi
********* fiyatana2-Kucuk      -> Ucretli Cocuk

