       FD FIYAT LABEL RECORD STANDARD.
       01 FIYAT-REC.
          02 FIYAT-ANAH.
             03 FIYAT-ACENTA      PIC X(4).
             03 FIYAT-TARIH.
                04 FIYAT-YIL      PIC 9999.
                04 FIYAT-AY       PIC 99.
                04 FIYAT-GUN      PIC 99.
             03 FIYAT-REZ-TIPI    PIC 9.
             03 FIYAT-PAN-TIPI    PIC XX.
             03 FIYAT-BANKA       PIC 99.
             03 FIYAT-DOVIZ       PIC 99.
             03 FIYAT-ANLASMA     PIC XX.
             03 FIYAT-BUYUK       PIC 99.
             03 FIYAT-KUCUK       PIC 99.

           02 FIYAT-BAS-TARIH     PIC 9(8).
           02 FIYAT-BIT-TARIH     PIC 9(8).
           02 FIYAT-BOS           PIC X(20).
********* Fiyat-Rez-tipi     -> Fiyatin rezervasyon tipi 1-Alotment 2-It.
********* Fiyat-Pan-tipi     -> Fiyatin Pansiyon    tipi BO,BB,HB,FB,HI..
********* Fiyat-Banka        -> Hangi banka ile calisiliyor..............
********* Fiyat-Kur          -> Hangi kur ile calisiliyor................
********* Fiyatbastar        -> fiyatana baslangic tarihi ve bitis tarihi

