       FD FIYATANA LABEL RECORD STANDARD.
       01 FIYATANA-REC.
          02 FIYATANA-ANAH.
             03 FIYATANA-DIGER-ANAH.
                  04 FIYATANA-PER-ANAH.
                     05 FIYATANA-ACENTA     PIC X(4).
                     05 FIYATANA-ILK-TARIH.
                        06 FIYATANA-ILK-YIL PIC 9999.
                        06 FIYATANA-ILK-AY  PIC 99.
                        06 FIYATANA-ILK-GUN PIC 99.
                     05 FIYATANA-SON-TARIH.
                        06 FIYATANA-SON-YIL PIC 9999.
                        06 FIYATANA-SON-AY  PIC 99.
                        06 FIYATANA-SON-GUN PIC 99.
                   04 FIYATANA-REZ-TIPI   PIC 9.
                   04 FIYATANA-PAN-TIPI   PIC XX.
                   04 FIYATANA-BANKA      PIC 99.
                   04 FIYATANA-DOVIZ      PIC 99.
                   04 FIYATANA-ANLASMA    PIC XX.
             03 FIYATANA-BUYUK      PIC 99.
             03 FIYATANA-KUCUK      PIC 99.
          02 FIYATANA-ODA-DIZI.
             03 FIYATANA-KONUM-DIZI OCCURS 40 TIMES.
                04 FIYATANA-ODA-FIYATI PIC 9(12)V99 COMP-3.
          02 FIYATANA-KICK-BACK     PIC 999.
          02 FIYATANA-EB-EH         PIC X.
          02 FIYATANA-EB-ORAN       PIC 9(2).
          02 FIYATANA-EB-BAS-TARIH.
             03 FIYATANA-EB-BAS-YIL PIC 9(4).     
             03 FIYATANA-EB-BAS-AY  PIC 9(2).     
             03 FIYATANA-EB-BAS-GUN PIC 9(2).     
          02 FIYATANA-EB-BIT-TARIH.
             03 FIYATANA-EB-BIT-YIL PIC 9(4).     
             03 FIYATANA-EB-BIT-AY  PIC 9(2).     
             03 FIYATANA-EB-BIT-GUN PIC 9(2).

          02 FIYATANA-UG-EH         PIC X.
          02 FIYATANA-UG-ORAN       PIC 9(2).
          02 FIYATANA-UG-geceleme   PIC 9(3).
          02 FIYATANA-UG-BAS-TARIH.
             03 FIYATANA-UG-BAS-YIL PIC 9(4).     
             03 FIYATANA-UG-BAS-AY  PIC 9(2).     
             03 FIYATANA-UG-BAS-GUN PIC 9(2).     
          02 FIYATANA-UG-BIT-TARIH.
             03 FIYATANA-UG-BIT-YIL PIC 9(4).     
             03 FIYATANA-UG-BIT-AY  PIC 9(2).     
             03 FIYATANA-UG-BIT-GUN PIC 9(2).
          02 FIYATANA-ACIKLAMA      PIC X(20).
          02 fiyatana-fiks          pic 9.
          02 fiyatana-eb-kusur      pic 99.
          02 fiyatana-ug-kusur      pic 99.
          02 FIYATANA-KICK-BACK2    PIC 999.
          02 fiyatana-d-1yc         pic 99.
          02 fiyatana-d-1yf         pic 99.
          02 fiyatana-d-2yc         pic 99.
          02 fiyatana-d-2yf         pic 99.
          02 fiyatana-resim         pic x(20).
          02 fiyatana-komisyon      pic 999v99.
          02 FIYATANA-BOS           PIC X(25).
          02 FIYATANA-STAF          PIC X(04).

********* Fiyatana-konum-dizi -> Fiyatin oda tipi (standart,suit...)
********* Fiyat-Rez-tipi      -> Fiyatin rezervasyon tipi 1-Alotment 2-It.
********* Fiyat-Pan-tipi      -> Fiyatin Pansiyon    tipi BO,BB,HB,FB,HI..
********* Fiyat-Banka         -> Hangi banka ile calisiliyor..............
********* Fiyat-Doviz         -> Hangi kur ile calisiliyor................
********* Fiyatana-Anlasma    -> Aanlasma Tipi 
********* Fiyatana-Buyuk      -> Buyuk Kisi
********* Fiyatana-Kucuk      -> Ucretli Cocuk

