       FD formul LABEL RECORD STANDARD.
       01 formul-REC.
          03 formul-anah.
             05 formul-anahtar.         
               07 formul-acenta       pic x(4).
             05 formul-anah-bos           PIC X(20).
          03 formul-ind-sira         pic 99.
          03 formul-eb-sira          pic 99.
          03 formul-ug-sira          pic 99.
          03 formul-ozl-sira         pic 99.
          03 formul-aks1-sira        pic 99.
          03 formul-aks2-sira        pic 99.
          03 formul-so1-sira         pic 99.
          03 formul-so2-sira         pic 99.
          03 formul-kkp-sira         pic 99.
          03 formul-kom-sira         pic 99.              
          03 formul-kb-sira          pic 99.
          03 formul-fm-sira          pic 99.
          03 formul-mo-sira          pic 99.

          03 formul-bos              pic x(192).

