FD  GENELFIS
    LABEL RECORD IS STANDARD.
 01 GENELFIS-REC.
     02 GENELFIS-ANAHTAR   PIC  9.
     02 REZ-OTO            PIC  9(08).
     02 FOLIO-OTO          PIC  9(08).
     02 CEKGIR-OTO         PIC  9(08).
     02 FIHRIST-OTO        PIC  9(10).
     02 DOV-BOZ-OTO        PIC  9(06).
     02 PRINT-NO           PIC  9(04).
     02 acenta-no redefines print-no pic 9(04).
     02 EKRAN-FIS-1        PIC  9(04).
     02 GENELFIS-LOG-NO    PIC  9(10).
     02 TEL-FIS-OTO        PIC  9(06).
     02 firma-no redefines TEL-FIS-OTO pic 9(05).
     02 filler   redefines TEL-FIS-OTO pic x.
     02 HK-TK-SERVIS-NO    PIC  9(08).
     02 POS-OTO-ODENMEZ-NO PIC  9(08).
     02 GRUP-OTO           PIC  9(04).
     02 profile-oto        pic  9(08).
*     02 GENELFIS-BOS       PIC  X(04).
*     02 GENELFIS-STAF      PIC  X(04).
*/genelfis-anahtar = 2 için print-no acenta kodu arttýrmak için kullanýldý.
