*

 FD grapher LABEL RECORD STANDARD.
 01 grapher-rec.
    02 grapher-ana-no                   unsigned-int.
    02 grapher-satir-no                 unsigned-int.
    02 grapher-20.
       03 grapher-20-01.
          04 grapher-20-islem           pic x.
             88 grapher-20-win-baslik   values are "W","w".
             88 grapher-20-baslik       values are "B","b".
             88 grapher-20-ozellik      values are "O","o".
             88 grapher-20-detay        values are "D","d".
             88 grapher-20-data         values are "V","v",space.
             88 grapher-20-toplam       values are "T","t".
             88 grapher-20-yuzde        values are "Y","y".
             88 grapher-20-pipe         values are "|".
             88 grapher-20-islem-yok    values are h"00" thru h"31"
                                                   h"33" thru "A",
                                                     "C",
                                                     "E" thru "N",
                                                     "P" thru "S",
                                                     "U", "V",
                                                     "Z" thru "a"
                                                     "c",
                                                     "e" thru "n",
                                                     "p" thru "s",
                                                     "u", "v",
                                                     "z" thru h"7b"
                                                   h"7d" thru h"ff".
       03 grapher-20-02.
          04 grapher-20-sira            pic 9 comp-x.
       03 grapher-20-03.
          04 grapher-20-renk            pic x.
             88 grapher-20-renk-satir   value "A".
             88 grapher-20-renk-cell    value "C".
             88 grapher-20-renk-yok     values are h"00" thru "@"
                                                     "B",
                                                     "D" thru h"60"
                                                     "b",
                                                     "d" thru h"ff".
       03 grapher-20-04                 pic x.
       03 grapher-20-05.
          04 grapher-20-yazici          pic x.
             88 grapher-20-sayfa-basi   value "P","p".
             88 grapher-20-ekran-yazma  value "-".
             88 grapher-20-yazici-yok   values are h"00" thru h"2c",
                                                   h"2e" thru "O",
                                                     "Q" thru "o",
                                                     "q" thru h"ff".
       03 grapher-20-06.
          04 grapher-20-esittir         pic x.
             88 grapher-20-esit-yaz     value "=".
             88 grapher-20-esittir-yok  values are h"00" thru h"3c",
                                                   h"3e" thru h"ff".
       03 grapher-20-07.
          04 grapher-20-altcizgi        pic x.
             88 grapher-20-altcizgi-cek value "_".
             88 grapher-20-altcizgi-yok values are h"00" thru h"5e",
                                                   h"60" thru h"ff".
       03 grapher-20-08.
          04 grapher-20-top-sutunu      pic 9 comp-x value zero.
             88 grapher-20-top-yok      values are zero, null.
             88 grapher-20-top-var      values are 1 thru 255.
       03 grapher-20-09.
          04 grapher-20-yuz-sutunu      pic 9 comp-x value zero.
             88 grapher-20-yuz-yok      values are zero, null.
             88 grapher-20-yuz-var      values are 1 thru 255.
       03 grapher-20-10.
          04 grapher-20-yazdirma-sayisi pic 9 comp-x.
       03 grapher-20-11                 pic x.
       03 grapher-20-12                 pic x.
       03 grapher-20-13                 pic x.
       03 grapher-20-14                 pic x.
       03 grapher-20-15                 pic x.
       03 grapher-20-16                 pic x.
       03 grapher-20-17                 pic x.
       03 grapher-20-18                 pic x.
       03 grapher-20-19                 pic x.
       03 grapher-20-20                 pic x.
    02 filler                           pic x.
    02 grapher-400                      pic x(400).
    02 grapher-sutun-sayisi             unsigned-short value zero.
    02 grapher-sutunlar                 value all low-values.
       03 grapher-sutun                 occurs 200 times.
          04 grapher-sutun-pos          unsigned-short value zero.
          04 grapher-sutun-boy          unsigned-short value zero.

*
