******************
 FD grrez LABEL RECORD STANDARD.
 01 grrez-REC.
          02 grrez-ANAH.
               03 grrez-NO             PIC 9(08).
               03 grrez-sira           pic 9.
          02 grrez-DURUMU            PIC X.
**********>grrez-Durumu => grrezervasyonun durumunu belirtir....
**********>I->Iceridekir grrez.  S->Silinmis,Iplat grrez.
**********>Onemli butun anahtar sahalarda olacak...............
          02 grrez-ACEN-ANAH.
             03 grrez-ACENTA         PIC X(4).
             03 grrez-GIR-TAR.
                04 grrez-GIR-YIL     PIC 9999.
                04 grrez-GIR-AY      PIC 99.
                04 grrez-GIR-GUN     PIC 99.
             03 grrez-CIK-TAR.
                04 grrez-CIK-YIL     PIC 9999.
                04 grrez-CIK-AY      PIC 99.
                04 grrez-CIK-GUN     PIC 99.
          02 grrez-ADI               PIC X(20).
          02 grrez-soyadi            PIC X(20).
          02 grrez-Dog-TAR.
                04 grrez-dog-YIL     PIC 9999.
                04 grrez-dog-AY      PIC 99.
                04 grrez-dog-GUN     PIC 99.
          02 grrez-rez-ADI               PIC X(20).
          02 grrez-rez-SOYADI            PIC X(20).
          02 grrez-ULKE              PIC X(03).
          02 grrez-VOUCHER           PIC X(10).
          02 grrez-VIP               PIC X.
**********>V->V.I.P    T->Top V.I.P
          02 grrez-FOLIO             PIC 9(08).
**********>grrez-C-In       -> grrezervasyonun C/In Yapilip yapilmadigini belirtir.
**********>grrez-Folio      -> grrezervasyon  C/In Yapildiginda Folio nosu islenir
          02 grrez-ODANO             PIC X(04).
          02 grrez-KISI.
             03 grrez-BUYUK          PIC 9(02).
             03 grrez-KUCUK          PIC 9(02).
             03 grrez-BEBEK          PIC 9(01).
             03 grrez-FREE           PIC 9(01).
          02 grrez-ISL-TAR.
             03 grrez-ISL-YIL        PIC 9999.
             03 grrez-ISL-AY         PIC 99.
             03 grrez-ISL-GUN        PIC 99.
          02 grrez-GENEL-BILGI.
             03 grrez-GRUP-ANAH.
                04 grrez-GRUP-NO     PIC X(04).
                04 grrez-GRUP-ADI    PIC X(15).
          02 grrez-operator       pic x(02).
          02 grrez-bos            pic x(30).

