       FD grtumrez LABEL RECORD STANDARD.
       01 grtumrez-REC.
          02 grtumrez-ANAH.
               03 grtumrez-sirket         PIC x(08).
               03 grtumrez-NO             PIC 9(08).
               03 grtumrez-sira           PIC 9.
          02 grtumrez-DURUMU            PIC X.
**********>grtumrez-Durumu => grtumrezervasyonun durumunu belirtir....
**********>I->Iceridekir grtumrez.  S->Silinmis,Iplat grtumrez.
**********>Onemli butun anahtar sahalarda olacak...............
          02 grtumrez-ACEN-ANAH.
             03 grtumrez-ACENTA         PIC X(4).
             03 grtumrez-GIR-TAR.
                04 grtumrez-GIR-YIL     PIC 9999.
                04 grtumrez-GIR-AY      PIC 99.
                04 grtumrez-GIR-GUN     PIC 99.
             03 grtumrez-CIK-TAR.
                04 grtumrez-CIK-YIL     PIC 9999.
                04 grtumrez-CIK-AY      PIC 99.
                04 grtumrez-CIK-GUN     PIC 99.
          02 grtumrez-ADI               PIC X(20).
          02 grtumrez-soyadi            PIC X(20).
          02 grtumrez-Dog-TAR.
                04 grtumrez-dog-YIL     PIC 9999.
                04 grtumrez-dog-AY      PIC 99.
                04 grtumrez-dog-GUN     PIC 99.
          02 grtumrez-rez-ADI               PIC X(20).
          02 grtumrez-rez-SOYADI            PIC X(20).
          02 grtumrez-ULKE              PIC X(03).
          02 grtumrez-VOUCHER           PIC X(10).
          02 grtumrez-VIP               PIC X.
**********>V->V.I.P    T->Top V.I.P
          02 grtumrez-FOLIO             PIC 9(08).
**********>grtumrez-C-In       -> grtumrezervasyonun C/In Yapilip yapilmadigini belirtir.
**********>grtumrez-Folio      -> grtumrezervasyon  C/In Yapildiginda Folio nosu islenir
          02 grtumrez-ODANO             PIC X(04).
          02 grtumrez-KISI.
             03 grtumrez-BUYUK          PIC 9(02).
             03 grtumrez-KUCUK          PIC 9(02).
             03 grtumrez-BEBEK          PIC 9(01).
             03 grtumrez-FREE           PIC 9(01).
          02 grtumrez-ISL-TAR.
             03 grtumrez-ISL-YIL        PIC 9999.
             03 grtumrez-ISL-AY         PIC 99.
             03 grtumrez-ISL-GUN        PIC 99.
          02 grtumrez-GENEL-BILGI.
             03 grtumrez-GRUP-ANAH.
                04 grtumrez-GRUP-NO     PIC X(04).
                04 grtumrez-GRUP-ADI    PIC X(15).
          02 grtumrez-operator       pic x(02).
          02 grtumrez-bos            pic x(30).

