       FD GRUP LABEL RECORD STANDARD.
       01 GRUP-REC.
          02 GRUP-ANAH.
             03 GRUP-TIPI      PIC X.
                88 GRUP-ACENTA       VALUE IS "A".
                88 GRUP-DEPART       VALUE IS "D".
                88 GRUP-sirket       VALUE IS "S".
                88 GRUP-ULKE         VALUE IS "U".
                88 GRUP-TAKIP-DEP    VALUE IS "T".
                88 GRUP-HK-TS        VALUE IS "R".
                88 GRUP-MESAJ-DURUMU VALUE IS "M".
             03 GRUP-KODU      PIC X(02).
             03 GRUP-ALT       PIC X(04).
          02 GRUP-ADI          PIC X(25).
          02 GRUP-ACIKLAMA     PIC X(25).
          02 GRUP-TURU         PIC X.
*******> A- ARIZA KODU 
*******  H-H/K ODA KODU 
*******  M-MAID KODU
          02 GRUP-ODA-DURUMU   PIC X.
*******> B-BOS TEMIZ
*******> D-DOLU TEMIZ
*******> O-O.O.O
*******> T-Temizlik baslama saati- maidin odaya giris zamani
          02 GRUP-BOS          PIC X(23).
          02 GRUP-STAF         PIC X(04).
