       FD HALK LABEL RECORD STANDARD.
       01 HALK-REC.
          02 HALK-KODU.
             03 HALK-ANA        PIC X(02).
             03 HALK-ALT        PIC X(03).
          02 HALK-TIPI          PIC X.
          02 HALK-ADI           PIC X(40).
          02 HALK-SORU          PIC X(53).
          02 halk-kat           pic 99.
          02 HALK-CEVAP         PIC 9(02).
          02 HALK-STAF          PIC X(04).
      */ halk-Tipi  A=Ust,D=Alt
