       FD ISTDATA  LABEL RECORD STANDARD.
       01 ISTDATA-REC.
          02 ISTDATA-ANAH.
             03 IST-TARIH.  
                04 IST-YIL           PIC 9999.
                04 IST-AY            PIC 99.
                04 IST-GUN           PIC 99.
             03 IST-ACENTA           PIC X(04).
             03 IST-REZ-TIPI         PIC 9. 
**********> Toplam Kismi........
          02 IST-TOP-ODA          PIC 9(4) COMP-3.
          02 IST-TOP-KISI.  
             03 IST-TOP-BUYUK     PIC 9(4) COMP-3.
             03 IST-TOP-KUCUK     PIC 9(4) COMP-3.
             03 IST-TOP-FREE      PIC 9(4) COMP-3.
          02 IST-TOP-TUTAR        PIC s9(14)V99 COMP-3.
**********> Oda           Kismi ......
          02 IST-ODA-ODA          PIC 9(4) COMP-3.
          02 IST-ODA-KISI.  
             03 IST-ODA-BUYUK     PIC 9(4) COMP-3.
             03 IST-ODA-KUCUK     PIC 9(4) COMP-3.
             03 IST-ODA-FREE      PIC 9(4) COMP-3.
          02 IST-ODA-TUTAR        PIC s9(15)V99 COMP-3.
**********> Kahvalti      Kismi ......
          02 IST-KAH-ODA          PIC 9(4) COMP-3.
          02 IST-KAH-KISI.  
             03 IST-KAH-BUYUK     PIC 9(4) COMP-3.
             03 IST-KAH-KUCUK     PIC 9(4) COMP-3.
             03 IST-KAH-FREE      PIC 9(4) COMP-3.
          02 IST-KAH-TUTAR        PIC s9(15)V99 COMP-3.
**********> Ogle  Yemegi  Kismi ......
          02 IST-OGL-ODA          PIC 9(4) COMP-3.
          02 IST-OGL-KISI.  
             03 IST-OGL-BUYUK     PIC 9(4) COMP-3.
             03 IST-OGL-KUCUK     PIC 9(4) COMP-3.
             03 IST-OGL-FREE      PIC 9(4) COMP-3.
          02 IST-OGL-TUTAR        PIC s9(15)V99 COMP-3.
**********> Aksam Yemegi  Kismi ......
          02 IST-AKS-ODA          PIC 9(4) COMP-3.
          02 IST-AKS-KISI.  
             03 IST-AKS-BUYUK     PIC 9(4) COMP-3.
             03 IST-AKS-KUCUK     PIC 9(4) COMP-3.
             03 IST-AKS-FREE      PIC 9(4) COMP-3.
          02 IST-AKS-TUTAR        PIC s9(15)V99 COMP-3.
**********> Icecek        Kismi ......
          02 IST-ICE-ODA          PIC 9(4) COMP-3.
          02 IST-ICE-KISI.  
             03 IST-ICE-BUYUK     PIC 9(4) COMP-3.
             03 IST-ICE-KUCUK     PIC 9(4) COMP-3.
             03 IST-ICE-FREE      PIC 9(4) COMP-3.
          02 IST-ICE-TUTAR        PIC s9(15)V99 COMP-3.
**********> Extralar      Kismi ......
          02 IST-EXT-ODA          PIC 9(4) COMP-3.
          02 IST-EXT-KISI.  
             03 IST-EXT-BUYUK     PIC 9(4) COMP-3.
             03 IST-EXT-KUCUK     PIC 9(4) COMP-3.
             03 IST-EXT-FREE      PIC 9(4) COMP-3.
          02 IST-EXT-TUTAR        PIC s9(15)V99 COMP-3.
**********> Ectra Bed     Kismi ......
          02 IST-EXB-ODA          PIC 9(4) COMP-3.
          02 IST-EXB-KISI.  
             03 IST-EXB-BUYUK     PIC 9(4) COMP-3.
             03 IST-EXB-KUCUK     PIC 9(4) COMP-3.
             03 IST-EXB-FREE      PIC 9(4) COMP-3.
          02 IST-EXB-TUTAR        PIC s9(15)V99 COMP-3.
**********> Diger-1       Kismi ......
          02 IST-DI1-ODA          PIC 9(4) COMP-3.
          02 IST-DI1-KISI.  
             03 IST-DI1-BUYUK     PIC 9(4) COMP-3.
             03 IST-DI1-KUCUK     PIC 9(4) COMP-3.
             03 IST-DI1-FREE      PIC 9(4) COMP-3.
          02 IST-DI1-TUTAR        PIC s9(15)V99 COMP-3.
**********> Complimentary Kismi ......
          02 IST-COM-ODA          PIC 9(4) COMP-3.
          02 IST-COM-KISI.  
             03 IST-COM-BUYUK     PIC 9(4) COMP-3.
             03 IST-COM-KUCUK     PIC 9(4) COMP-3.
             03 IST-COM-FREE      PIC 9(4) COMP-3.
          02 IST-COM-TUTAR        PIC s9(15)V99 COMP-3.
**********> House Use     Kismi ......
          02 IST-HOU-ODA          PIC 9(4) COMP-3.
          02 IST-HOU-KISI.  
             03 IST-HOU-BUYUK     PIC 9(4) COMP-3.
             03 IST-HOU-KUCUK     PIC 9(4) COMP-3.
             03 IST-HOU-FREE      PIC 9(4) COMP-3.
          02 IST-HOU-TUTAR        PIC s9(15)V99 COMP-3.
**********> No Show  Kismi ......
          02 IST-NOS-ODA          PIC 9(4) COMP-3.
          02 IST-NOS-KISI.  
             03 IST-NOS-BUYUK     PIC 9(4) COMP-3.
             03 IST-NOS-KUCUK     PIC 9(4) COMP-3.
             03 IST-NOS-FREE      PIC 9(4) COMP-3.
          02 IST-NOS-TUTAR        PIC s9(15)V99 COMP-3.
**********> Single-Double-Triple-Group Istatistigi...........
          02 IST-SDT OCCURS 4 TIMES. 
             03 IST-SDT-ODA          PIC 9(4) COMP-3.
             03 IST-SDT-KISI.  
                04 IST-SDT-BUYUK     PIC 9(4) COMP-3.
                04 IST-SDT-KUCUK     PIC 9(4) COMP-3.
                04 IST-SDT-FREE      PIC 9(4) COMP-3.
             03 IST-SDT-TUTAR        PIC s9(15)V99 COMP-3.
          02 IST-TOP-corr-TUTAR      PIC 9(08)v99. 
          02 IST-BOS                 PIC X(20). 
