       FD ISTDATATOP  LABEL RECORD STANDARD.
       01 ISTDATATOP-REC.
          02 ISTDATATOP-ANAH.
             03 ISTTOP-TARIH.  
                04 ISTTOP-YIL           PIC 9999.
                04 ISTTOP-AY            PIC 99.
                04 ISTTOP-GUN           PIC 99.
             03 ISTTOP-ACENTA           PIC X(04).
             03 ISTTOP-REZ-TIPI         PIC 9. 
**********> Toplam Kismi........
        02 istdatatop-sayisallar.
          04 ISTTOP-TOP-ODA          PIC 9(4) COMP-3.
             04 ISTTOP-TOP-BUYUK     PIC 9(4) COMP-3.
             04 ISTTOP-TOP-KUCUK     PIC 9(4) COMP-3.
             04 ISTTOP-TOP-FREE      PIC 9(4) COMP-3.
          04 ISTTOP-TOP-TUTAR        PIC 9(15)V99 COMP-3.
**********> Oda           Kismi ......
          04 ISTTOP-ODA-ODA          PIC 9(4) COMP-3.
             04 ISTTOP-ODA-BUYUK     PIC 9(4) COMP-3.
             04 ISTTOP-ODA-KUCUK     PIC 9(4) COMP-3.
             04 ISTTOP-ODA-FREE      PIC 9(4) COMP-3.
          04 ISTTOP-ODA-TUTAR        PIC 9(15)V99 COMP-3.
**********> Kahvalti      Kismi ......
          04 ISTTOP-KAH-ODA          PIC 9(4) COMP-3.
             04 ISTTOP-KAH-BUYUK     PIC 9(4) COMP-3.
             04 ISTTOP-KAH-KUCUK     PIC 9(4) COMP-3.
             04 ISTTOP-KAH-FREE      PIC 9(4) COMP-3.
          04 ISTTOP-KAH-TUTAR        PIC 9(15)V99 COMP-3.
**********> Ogle  Yemegi  Kismi ......
          04 ISTTOP-OGL-ODA          PIC 9(4) COMP-3.
             04 ISTTOP-OGL-BUYUK     PIC 9(4) COMP-3.
             04 ISTTOP-OGL-KUCUK     PIC 9(4) COMP-3.
             04 ISTTOP-OGL-FREE      PIC 9(4) COMP-3.
          04 ISTTOP-OGL-TUTAR        PIC 9(15)V99 COMP-3.
**********> Aksam Yemegi  Kismi ......
          04 ISTTOP-AKS-ODA          PIC 9(4) COMP-3.
             04 ISTTOP-AKS-BUYUK     PIC 9(4) COMP-3.
             04 ISTTOP-AKS-KUCUK     PIC 9(4) COMP-3.
             04 ISTTOP-AKS-FREE      PIC 9(4) COMP-3.
          04 ISTTOP-AKS-TUTAR        PIC 9(15)V99 COMP-3.
**********> Icecek        Kismi ......
          04 ISTTOP-ICE-ODA          PIC 9(4) COMP-3.
             04 ISTTOP-ICE-BUYUK     PIC 9(4) COMP-3.
             04 ISTTOP-ICE-KUCUK     PIC 9(4) COMP-3.
             04 ISTTOP-ICE-FREE      PIC 9(4) COMP-3.
          04 ISTTOP-ICE-TUTAR        PIC 9(15)V99 COMP-3.
**********> Extralar      Kismi ......
          04 ISTTOP-EXT-ODA          PIC 9(4) COMP-3.
             04 ISTTOP-EXT-BUYUK     PIC 9(4) COMP-3.
             04 ISTTOP-EXT-KUCUK     PIC 9(4) COMP-3.
             04 ISTTOP-EXT-FREE      PIC 9(4) COMP-3.
          04 ISTTOP-EXT-TUTAR        PIC 9(15)V99 COMP-3.
**********> Ectra Bed     Kismi ......
          04 ISTTOP-EXB-ODA          PIC 9(4) COMP-3.
             04 ISTTOP-EXB-BUYUK     PIC 9(4) COMP-3.
             04 ISTTOP-EXB-KUCUK     PIC 9(4) COMP-3.
             04 ISTTOP-EXB-FREE      PIC 9(4) COMP-3.
          04 ISTTOP-EXB-TUTAR        PIC 9(15)V99 COMP-3.
**********> Diger-1       Kismi ......
          04 ISTTOP-DI1-ODA          PIC 9(4) COMP-3.
             04 ISTTOP-DI1-BUYUK     PIC 9(4) COMP-3.
             04 ISTTOP-DI1-KUCUK     PIC 9(4) COMP-3.
             04 ISTTOP-DI1-FREE      PIC 9(4) COMP-3.
          04 ISTTOP-DI1-TUTAR        PIC 9(15)V99 COMP-3.
**********> Complimentary Kismi ......
          04 ISTTOP-COM-ODA          PIC 9(4) COMP-3.
             04 ISTTOP-COM-BUYUK     PIC 9(4) COMP-3.
             04 ISTTOP-COM-KUCUK     PIC 9(4) COMP-3.
             04 ISTTOP-COM-FREE      PIC 9(4) COMP-3.
          04 ISTTOP-COM-TUTAR        PIC 9(15)V99 COMP-3.
**********> House Use     Kismi ......
          04 ISTTOP-HOU-ODA          PIC 9(4) COMP-3.
             04 ISTTOP-HOU-BUYUK     PIC 9(4) COMP-3.
             04 ISTTOP-HOU-KUCUK     PIC 9(4) COMP-3.
             04 ISTTOP-HOU-FREE      PIC 9(4) COMP-3.
          04 ISTTOP-HOU-TUTAR        PIC 9(15)V99 COMP-3.
**********> No Show  Kismi ......
          04 ISTTOP-NOS-ODA          PIC 9(4) COMP-3.
             04 ISTTOP-NOS-BUYUK     PIC 9(4) COMP-3.
             04 ISTTOP-NOS-KUCUK     PIC 9(4) COMP-3.
             04 ISTTOP-NOS-FREE      PIC 9(4) COMP-3.
          04 ISTTOP-NOS-TUTAR        PIC 9(15)V99 COMP-3.
**********> Single-Double-Triple-Group Istatistigi...........
          02 ISTTOP-SDT OCCURS 4 TIMES. 
             04 ISTTOP-SDT-ODA          PIC 9(4) COMP-3.
             04 ISTTOP-SDT-KISI.  
                05 ISTTOP-SDT-BUYUK     PIC 9(4) COMP-3.
                05 ISTTOP-SDT-KUCUK     PIC 9(4) COMP-3.
                05 ISTTOP-SDT-FREE      PIC 9(4) COMP-3.
             04 ISTTOP-SDT-TUTAR        PIC 9(15)V99 COMP-3.
          02 ISTTOP-BOS                 PIC X(30). 
