       FD ISYERI LABEL RECORD STANDARD.
       01 ISYERI-REC. 
          02 ISYERI-NO      PIC 9(2).
          02 ISYERI-ADRES   PIC X(8).
          02 ISYERI-UNVAN   PIC X(30).
          02 ISYERI-SIRA    PIC 9(03).
          02 ISYERI-RES-ADI PIC X(30).
          02 ISYERI-SIFRE   PIC X(10).
          02 ISYERI-SAKLI   PIC X.
*********** S- ise sakli hic bir zaman gozukmuyor ...
*********** T- ise tusa bagli
*********** diger hallerde gozukuyor ...
          02 ISYERI-grup   PIC 9.
          02 ISYERI-BOS     PIC X(58).
          02 ISYERI-STAF    PIC X(04).
