       FD KAT LABEL RECORD STANDARD.
       01 KAT-REC.
          02 KAT-ANAHTAR.
             03 KAT-KODU      PIC 9.
          02 KAT-SAYISI OCCURS 15 TIMES.
             03 KAT-ADI       PIC X(15).
             03 KAT-KAPASITE  PIC 9(04) COMP-3.
             03 KAT-BASLANGIC PIC 9(04) COMP-3.
             03 KAT-BITIS     PIC 9(04) COMP-3.
          02 KAT-BOS          PIC X(10).
          02 KAT-STAF         PIC X(04).
******** KAT KAPASITE - KAC ODA VAR
