FD  KATEGORI LABEL RECORD IS STANDARD.
01 KATEGORI-REC.
       02 KATEGORI-ANAH.
          03 KATEGORI-BUYUK   PIC  99.
          03 KATEGORI-KUCUK   PIC  99.
       02 KATEGORI-ADI        PIC  X(25).
       02 KATEGORI-BOS        PIC  X(25).
       02 KATEGORI-STAF       PIC  X(04).
