FD KODLAR02 LABEL RECORD STANDARD.
01 KODLAR02-REC.
    02 KODLAR02-ANAH.
       03 KODLAR02-TIPI       PIC X.
       03 KODLAR02-KODU       PIC X(02).
    02 KODLAR02-ADI           PIC X(25).
*/  Pansiyon Bolumu
    02 KODLAR02-PANSIYON.
       03 PAN-1.
          04 PAN-ODA             PIC X.
          04 ODA-DEP             PIC 999.
          04 ITV-ONB-DEP REDEFINES ODA-DEP PIC 999.
       03 PAN-2.
          04 PAN-KAHVALTI        PIC X.
          04 KAHVALTI-DEP        PIC 999.
       03 PAN-3.
          04 PAN-OGLE            PIC X.
          04 OGLE-DEP            PIC 999.
       03 PAN-4.
          04 PAN-AKSAM           PIC X.
          04 AKSAM-DEP           PIC 999.
       03 PAN-5.
          04 PAN-ICECEK          PIC X.
          04 ICECEK-DEP          PIC 999.
       03 PAN-6.
          04 PAN-EXTRA           PIC X.
          04 EXTRA-DEP           PIC 999.
       03 PAN-KAHVALTI-GIRIS     pic x.
       03 PAN-KAHVALTI-KALIS     PIC X.
       03 PAN-KAHVALTI-CIKIS     PIC X.
       03 PAN-OGLEN-GIRIS        pic x.
       03 PAN-OGLEN-KALIS        PIC X.
       03 PAN-OGLEN-CIKIS        PIC X.
       03 PAN-AKSAM-GIRIS        pic x.
       03 PAN-AKSAM-KALIS        PIC X.
       03 PAN-AKSAM-CIKIS        PIC X.

       03 PAN-BOS                PIC X(01).
*/  Odeme Bolumu
    02 KODLAR02-ODEME.
       03 ODE-TIPI            PIC X.
       03 ODE-INDIRIM         PIC 999.
       03 ODE-POSTING         PIC X.
       03 ODE-BOS             PIC X(10).
    02 KODLAR02-HESAP REDEFINES KODLAR02-ODEME pic x(15).
*/  House Keepinq Bolumu
    02 KODLAR02-HOUSE.
       03 HOU-BOS             PIC X(10).
    02 KODLAR02-KONUM         PIC 9 .
    02 kodlar02-kasa      pic 9 redefines KODLAR02-KONUM . 
    02 KODLAR02-ALKOL         PIC 9.
    02 KODLAR02-SAYISAL       PIC 9(3)V9(7).
    02 KODLAR02-BOS           PIC X(08).
    02 kodlar02-kisa-adi      pic x(08) redefines kodlar02-bos. 
    02 KODLAR02-STAF          PIC X(04).
    66 kodlar02-ozl-tipi   renames ode-tipi.
    66 KODLAR02-ANL-BUTCE RENAMES 
       ODE-BOS.
    66 KODLAR02-VIP-SETUP-REC RENAMES 
       KODLAR02-ADI THRU KODLAR02-STAF.
*       03 KODLAR02-VIP-SETUP-OCC OCCURS 30 TIMES.
*          04 KODLAR02-VIP-SETUP-ADET    PIC X.
*          04 KODLAR02-VIP-SETUP-KOD     PIC X(2).


*/  Aciklamalar;
*/  KODLAR02-TIPI -> A = Pansiyon
*/                   B = Odeme
*/                   C = House Keeping
*/                   D = Fiyat Tipi (Last minute,Infox gibi)  Anlasma
*/                   E = Pazar Tanimlamasi
*/                   F = Kat Isimleri
*/                   G = Oda Tip
*/                   H = Oda Tip2
*/                   I = Oda Tip3
*/                   O = operator Kodu
*/                   V = VIP SETUP KODLARI
*/                   Y = VIP setup icerikleri
*                    J - Tikler
*                    P - CALLCENTER ÝPTAL NEDENÝ
*                    K - CALLCENTER DEPARTMAN                     
***                  S - CALLCENTER ARIZA SEBEBI
*                    R - REHBER KODLARI 
*                    Z - ozel durum
*/                   W - ITV DEPARTMAN KODLARI
*/                   a - route grup tanimlama
*/                   v - vip durum kodlari vip1 vip2 vs...
*/Ode-Tipi      = A-Pesin,B-Kredi,C-Indirimli,D-Compliment
*/              = E-All In Clusive,F-House Use,G-Limit Iade,H-Diger-1
*/              = O-Odenmez....
*/Ode-Posting   = "H" Ise Bu Odemeye fiyat girilemez........
