       FD KONUM LABEL RECORD STANDARD.
       01 KONUM-REC.
           02 KONUM-ANAHTAR    PIC 99.
           02 KONUM-ADI        PIC X(15).
           02 KONUM-TOP-ODA    PIC 9(04).
           02 KONUM-HAZIR-ODA  PIC 9(04).
           02 konum-ref        pic 9.
           02 konum-satis      pic 9.
           02 konum-ust1       pic 99.
           02 konum-ust2       pic 99.
           02 konum-sira       pic 99.
           02 KONUM-BOS        PIC X(02).
           02 KONUM-STAF       PIC X(04).
**********-> Oda Konumlarini belirten datadir...
**********-> 1.Kara Tarifi 2.Deniz Tarafi gibi..
**********-> KONUM-TOP-ODA  -> Bu tipte kac oda oldugunu belirtir....
**********-> KONUM-HAZIR-ODA-> Bu tipte satisa hazir kac oda oldugunu belirtir.
