       FD KUR LABEL RECORD STANDARD.
       01 KUR-REC.
          02 KUR-KODU.
             03 KUR-TARIH.
                04 KUR-YIL    PIC 9(4).
                04 KUR-AY     PIC 9(2).
                04 KUR-GUN    PIC 9(2).
             03 KUR-BANKA     PIC 9(2).
             03 KUR-DOVIZ     PIC 9(2).
          02 DOVIZ-ALIS       PIC 9(9)V9(05) COMP-3.
          02 DOVIZ-SATIS      PIC 9(9)V9(05) COMP-3.
          02 EFEKTIF-ALIS     PIC 9(9)V9(05) COMP-3.
          02 EFEKTIF-SATIS    PIC 9(9)V9(05) COMP-3.
          02 PARITE           PIC 9(6)V9(05) COMP-3.
          02 DOVIZ-STAF       PIC X(04).
