       FD lapkont LABEL RECORD STANDARD.
       01 lapkont-REC.
          02 lapkont-anah.
             03 lapkont-islem-no      PIC s9(9).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=lapkont-tarih
          02 lapkont-tarih.
            03 lapkont-yil            pic 9(04).
            03 lapkont-ay             pic 9(02).
            03 lapkont-gun            pic 9(02).
          02 lapkont-asya-anah        PIC X(20).
          02 lapkont-depkod           PIC 9(03).
          02 lapkont-folio-no         PIC 9(8).
          02 lapkont-tutar-tl         PIC 9(06)v99.
          02 lapkont-tutar-dv         PIC 9(06)v99.
          02 lapkont-dv-kodu          PIC xx.
          02 lapkont-fat-no           PIC x(20).
          02 lapkont-asya-islendi     PIC 9.
          02 lapkont-asya-silindi     PIC 9.
          02 lapkont-aciklama         PIC X(255).
          02 lapkont-hata-acik        pic x(100).
          02 lapkont-staf             pic x(04).
          02 lapkont-adisyon-no       pic x(10).
          02 lapkont-DOV-BOZ-ANAH.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=lapkont-dov-boz-tarih
             03 lapkont-dov-boz-tarih.
                04  lapkont-DOV-BOZ-YIL      PIC 9999.
                04  lapkont-DOV-BOZ-AY       PIC 99.
                04  lapkont-DOV-BOZ-GUN      PIC 99.
              03 lapkont-DOV-BOZ-ALIS-SATIS  pic 9.
              03 lapkont-DOV-BOZ-FISNO       PIC 9(05).
          02 lapkont-kontrol                 pic x(40).
          02 lapkont-hata-kodu               pic 9(02).
***********************************************************************
*************
          02 lapkont-isl-tarih.
            03 lapkont-isl-yil               pic 9(04).
            03 lapkont-isl-ay                pic 9(02).
            03 lapkont-isl-gun               pic 9(02).
          02 lapkont-isl-zaman.
            03 lapkont-isl-saat              pic 9(02).
            03 lapkont-isl-dakika            pic 9(02).
            03 lapkont-isl-saniye            pic 9(02).
          02 lapkont-email-gonderildi        pic 9.
          02 lapkont-bos                     pic x(069).




