       FD lpsentgr LABEL RECORD STANDARD.
       01 lpsentgr-REC.
          02 lpsentgr-anah.
             03 lapis-islem-no      PIC s9(9).
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=lapis-tarih
          02 lapis-tarih.
            03 lapis-yil            pic 9(04).
            03 lapis-ay             pic 9(02).
            03 lapis-gun            pic 9(02).
          02 lapis-asya-anah        PIC X(20).
          02 lapis-depkod           PIC 9(03).
          02 lapis-folio-no         PIC 9(8).
          02 lapis-tutar-tl         PIC 9(06)v99.
          02 lapis-tutar-dv         PIC 9(06)v99.
          02 lapis-dv-kodu          PIC xx.
          02 lapis-fat-no           PIC x(20).
          02 lapis-asya-islendi     PIC 9.
          02 lapis-asya-silindi     PIC 9.
          02 lapis-aciklama         PIC X(255).
          02 lapis-hata-acik        pic x(100).
          02 lapis-staf             pic x(04).
          02 lapis-adisyon-no       pic x(10).
          02 lapis-DOV-BOZ-ANAH.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=lapis-dov-boz-tarih
             03 lapis-dov-boz-tarih.
                04  lapis-DOV-BOZ-YIL      PIC 9999.
                04  lapis-DOV-BOZ-AY       PIC 99.
                04  lapis-DOV-BOZ-GUN      PIC 99.
              03 lapis-DOV-BOZ-ALIS-SATIS  pic 9.
              03 lapis-DOV-BOZ-FISNO       PIC 9(05).
          02 lapis-kontrol                 pic x(40).
          02 lapis-hata-kodu               pic 9(02).
***********************************************************************
*************
          02 lapis-tip                     pic 9.
      *(( XFD DATE=HHNNSS, USE GROUP ))
      $XFD NAME=lapis-islenme-zamani
          02 lapis-islenme-zamani.
             03 lapis-islenme-saat         pic 9(02).
             03 lapis-islenme-dakika       pic 9(02).
             03 lapis-islenme-saniye       pic 9(02).
          02 lapis-bos                     pic x(077).
          



