       FD MAILKIME LABEL RECORD STANDARD.
       01 MAILKIME-REC.
          02 MAILKIME-ANAH.
             03 MAILKIME-TARIH.
                04 MAILKIME-YIL          PIC 9(04).
                04 MAILKIME-AY           PIC 9(02).
                04 MAILKIME-GUN          PIC 9(02).
             03 MAILKIME-TIP             PIC X(02).
             03 MAILKIME-ADI             PIC X(20).
             03 MAILKIME-SOYADI          PIC X(20).
             03 MAILKIME-BOS             PIC X(20).

          02 MAILKIME-BASLIK             PIC X(100).
          02 MAILKIME-EKLI-DOSYA         PIC X(100).
          02 FILLER                      PIC X(09).
          02 MAILKIME-HTML-NO            PIC X(02).
          02 MAILKIME-SEND.
             03 MAILKIME-SEND-DURUM         PIC X.
             03 MAILKIME-SEND-TARIH.
                04 MAILKIME-SEND-YIL        PIC 9(4).
                04 MAILKIME-SEND-AY         PIC 9(2).
                04 MAILKIME-SEND-GUN        PIC 9(2).
             03 MAILKIME-SEND-ZAMAN.
                04 MAILKIME-SEND-SAAT       PIC 99.
                04 MAILKIME-SEND-DAKIKA     PIC 99.
                04 MAILKIME-SEND-SANIYE     PIC 99.
             03 MAILKIME-SEND-DONUS         PIC X.
          02 MAILKIME-E-MAIL             PIC X(50).
          02 MAILKIME-ULKESI             PIC X(03).
          
