       FD FATURA LABEL RECORD STANDARD.
       01 FATURA-REC. 
          02 FATURA-ANAH.
             03 FATURA-SERI       PIC XX. 
             03 FATURA-NO         PIC 9(08). 
             03 FATURA-SIRA       PIC 9(03).      
          02 FATURA-TARIHI.
             03 FATURA-YIL        PIC 9999. 
             03 FATURA-AY         PIC 99. 
             03 FATURA-GUN        PIC 99. 
          02 FATURA-TIPI          PIC X.
**********Fatura-Tipi =>[F]-Folio Faturasi [A] Acenta Faturasi
          02 FATURA-DURUMU        PIC X. 
**********Fatura-Durumu =>[B]-Bos Fatura [D]-Dolu Fatura [I]-Iptal Fatura
          02 FATURA-FOLIO         PIC 9(08).
          02 FATURA-ADRES.
             03 FATURA-BASLIK-1   PIC X(40).
             03 FATURA-BASLIK-2   PIC X(40).
             03 FATURA-ADRES-1    PIC X(40).
             03 FATURA-ADRES-2    PIC X(40).
             03 FATURA-IL         PIC X(20).
             03 FATURA-ILCE       PIC X(20).
             03 FATURA-ULKE       PIC X(20).
             03 FATURA-VER-DA     PIC X(20).
             03 FATURA-VER-NO     PIC X(20).
             03 FATURA-ADRES-BOS  PIC X(40).
          02 FATURA-ACIKLAMA      PIC X(150).
          02 FATURA-ACENTA        PIC XXXX. 
          02 FATURA-TOPLAM        PIC 9(15)V99. 
          02 FATURA-INDIRIM       PIC 9(15)V99. 
          02 FATURA-MATRAH        PIC 9(15)V99. 
          02 FATURA-KDV           PIC 9(15)V99. 
          02 FATURA-G-TOPLAM      PIC 9(15)V99.
          02 FATURA-MATRAH-18      PIC 9(8)V99. 
          02 FATURA-KDV-18         PIC 9(8)V99. 
          02 FATURA-MATRAH-8      PIC 9(8)V99. 
          02 FATURA-KDV-8         PIC 9(8)V99. 
          02 FATURA-BOS           PIC X(10). 
          02 FATURA-STAF          PIC X(04). 
