*
 fd menutext label record standard.
 01 menutext-rec.
            02 menutext-str              pic x(100).
            02 menutext-kisayol-redefines redefines menutext-str.
               03 menutext-kisayol-cnt   pic x(6).
               03 filler              pic x.
               03 menutext-kisayol-str   pic x(93).
            02 menutext-button-redefines redefines menutext-str.
               03 menutext-button-str    pic x(7).
               03 menutext-button-sira   pic 9(2).
               03 filler              pic x.
               03 menutext-button-bmp-adres  pic x(6).
               03 filler              pic x.
               03 menutext-button-title      pic x(40).
               03 filler              pic x.
               03 menutext-button-prog-adres pic x(42).
            02 menutext-menu-redefines redefines menutext-str.
               03 menutext-menu-islem    pic x.
               03 menutext-menu-handle1  pic 9(2).
               03 menutext-menu-handle2  pic 9(2).
               03 filler              pic x.
               03 menutext-menu-aciklama pic x(30).
               03 filler              pic x.
               03 menutext-menu-bmp      pic x(6).
               03 filler              pic x.
               03 menutext-menu-prog     pic x(30).
               03 filler              pic x.
               03 menutext-menu-id       pic 9(4).

