       FD ODADEGIS  LABEL RECORD  STANDARD.
       01 ODADEGIS-REC.
          02 ODADEGIS-ANAH.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=ODADEGIS_TARIH
             03 ODADEGIS-TARIH.
                04 ODADEGIS-YIL  PIC 9999.
                04 ODADEGIS-AY   PIC 99.
                04 ODADEGIS-GUN  PIC 99.
             03 ODADEGIS-ESKI-ODA   PIC X(04). 
             03 ODADEGIS-YENI-ODA   PIC X(04).
             03 ODADEGIS-ZAMAN.
                04 ODADEGIS-SAAT    PIC 99.
                04 ODADEGIS-DAKIKA  PIC 99.
                04 ODADEGIS-SANIYE  PIC 99.
          02 ODADEGIS-FOLIO         PIC 9(08).
          02 ODADEGIS-ACIKLAMA      PIC X(40).
          02 ODADEGIS-BOS           PIC X(20).
          02 ODADEGIS-STAF          PIC X(04).
