       FD ODENMEZ LABEL RECORD IS STANDARD.
       01 ODENMEZ-REC.
          02 ODENMEZ-ANAH.
             03 ODENMEZ-ILK     PIC X.
             03 ODENMEZ-KODU    PIC 9(08).
          02 ODENMEZ-ADI        PIC X(40).
          02 ODENMEZ-LIMIT      PIC 9(12)V99.
          02 ODENMEZ-BOS        PIC X(100).
          02 ODENMEZ-STAF       PIC X(04).
**********Odenmez kodu (8) hanedir.... Onburodaki folio numarasi ile ayni
**********cakismamasi icin basina bir rakam atanmistir.....
