       FD onbtak LABEL RECORD STANDARD.
       01 onbtak-REC.
          02 onbtak-ANAH.
             03 onbtak-YIL       PIC 9999.
             03 onbtak-AY        PIC 99.
             03 onbtak-GUN       PIC 99.
          02 onbtak-KACINCI      PIC 999.
          02 onbtak-GUN-ADI      PIC 9.
          02 onbtak-MESAI-TATIL  PIC X.
          02 onbtak-TOP-ODA      PIC 9999 COMP-3.
          02 onbtak-HAZIR-ODA    PIC 9999 COMP-3.
            02 onbTAK-SATILAN OCCURS 19 TIMES. 
************             03 filler occurs 4 times .
                07 onbTAK-SAT-ODA      PIC 9999 COMP-3.
                07 onbTAK-SAT-KISI.
                   09 onbTAK-SAT-BUYUK PIC 9999 COMP-3.
                   09 onbTAK-SAT-KUCUK PIC 9999 COMP-3.
                   09 onbTAK-SAT-FREE  PIC 9999 COMP-3.
          
         02 onbtak-konumlar occurs 19 times.
            05 onbtak-konum-oda    pic 9999.
            05 filler              pic 9999.
          02 filler pic x(533).
          02 onbTAK-HAZIR-YATAK   PIC 9999.

          02 onbtak-posting      pic 9. 
          02 onbtak-BOS          PIC X(14).
*******> onbtak-TOP-ODA    => O tarihteki toplam oda sayisi
*******> onbtak-HAZIR-ODA  => O tarihteki toplam satisa hazir oda sayisi
*******> onbtak-SAT-ODA    => O tarihteki toplam satilan oda sayisi
*******> onbtak-SAT-KISI   => O tarihteki toplam satilan pax(Buyuk,Kucuk,Free)
