*
fd ototakip label record standard.
 01 ototakip-rec.
   02 ototakip-anah.
     03 ototakip-tipi                    pic xxx.
        88 ototakip-elektrik-sayac       value "A  ".
        88 ototakip-su-sayac             value "S  ".
        88 ototakip-lng-sayac            value "L  ".
        88 ototakip-lpg-sayac            value "P  ".
     03 ototakip-tarih.
        04 ototakip-yil                  pic 9(4).
        04 ototakip-ay                   pic 9(2).
        04 ototakip-gun                  pic 9(2).
     03 ototakip-fis                     pic 9(10).
     03 ototakip-sira                    pic 9(6).
     03 ototakip-oda-no                  pic x(4).
     03 ototakip-filler                  pic x(10).


***** Gecen Ayýn Degerleri *************************************
   02 ototakip-elktrk-gaad               pic 9(5)v9(3).
   02 ototakip-elktrk-gard               pic 9(5)v9(3).
   02 ototakip-elktrk-gakd               pic 9(5)v9(3).

***** Aktif / Reaktif / Kapasitif / Carpan Deger ***************
   02 ototakip-elktrk-cd                 pic 9(5)v9(3). 
   02 ototakip-elktrk-ad                 pic 9(5)v999.
   02 ototakip-elktrk-rd                 pic 9(5)v999.
   02 ototakip-elktrk-kd                 pic 9(5)v999.

***** Aktif / Reaktif / Kapasitif Tüketim /Gunluk **************
   02 ototakip-elktrk-rt                 pic 9(5)v999.
   02 ototakip-elktrk-kt                 pic 9(5)v999.
   02 ototakip-elktrk-at                 pic 9(5)v999.
   02 ototakip-elktrk-gt                 pic 9(5)v999.

***** % Degerler ***********************************************
   02 ototakip-elktrk-kty                pic 9(2)v999.
   02 ototakip-elktrk-rty                pic 9(2)v999.
   02 ototakip-elktrk-fatno              pic x(25).
   02 ototakip-elktrk-fattut             pic 9(6)v9(3).
   02 ototakip-elktrk-fatmik             pic 9(6)v9(3).
   02 ototakip-elktrk-birimtut           pic 9(4)v9(3).
   02 ilk-fattar.
      03 ilk-fattar-yil                  pic 9(4).
      03 ilk-fattar-ay                   pic 9(2).
      03 ilk-fattar-gun                  pic 9(2).
   02 son-fattar.                         
      03 son-fattar-yil                  pic 9(4).
      03 son-fattar-ay                   pic 9(2).
      03 son-fattar-gun                  pic 9(2).

   

***** SU *******************************************************
   02 ototakip-su-gad                    pic 9(5)v9(3).                                  
   02 ototakip-su-sd                     pic 9(5)v9(3).
   02 ototakip-su-gt                     pic 9(5)v9(3).
   02 ototakip-su-cd                     pic 9(4)v9(2).


****  LNG ******************************************************
   02 ototakip-lng-aig                   pic 9(3)v9(3).
   02 ototakip-lng-tsy                   pic s9(3).
   02 ototakip-lng-tuky                  pic s9(2).
   02 ototakip-lng-tukk                  pic 9(4)v9(3).
   02 ototakip-lng-cd                    pic 9(4)v9(2).
   02 ototakip-lng-tsyd                  pic s9(3).
   02 ototakip-lng-taig                  pic 9(3)v9(3).
   02 ototakip-lng-ak                    pic 9(3)v9(3).
   02 ototakip-lng-fatno                 pic x(25).
   02 ototakip-lng-fattut                pic 9(6)v9(3).
   02 ototakip-lng-fatmik                pic 9(6)v9(3).
   02 ototakip-lng-birimtut              pic 9(4)v9(3).

**** LPG ********************************************************
   02 ototakip-lpg-aig                   pic 9(3)v9(3).
   02 ototakip-lpg-tsy                   pic s9(3)v9(1).
   02 ototakip-lpg-tuky                  pic s9(2).
   02 ototakip-lpg-tukk                  pic 9(4)v9(3).
   02 ototakip-lpg-cd                    pic 9(4)v9(2).
   02 ototakip-lpg-tsyd                  pic s9(3).
   02 ototakip-lpg-taig                  pic 9(3)v9(3).
   02 ototakip-lpg-ak                    pic 9(3)v9(3).
   02 ototakip-lpg-fatno                 pic x(25).
   02 ototakip-lpg-fattut                pic 9(6)v9(3).
   02 ototakip-lpg-fatmik                pic 9(6)v9(3).
   02 ototakip-lpg-birimtut              pic 9(4)v9(3).
   02 ototakip-folio-no                  pic 9(8).
   02 ototakip-elektrik-alindi           pic 9.
   02 ototakip-su-alindi                 pic 9.
   02 ototakip-aidat-alindi              pic 9.

**** KARSILASTIRMA ********************************************
   02 filler                             pic x(298).
                                         
