*
 FD outof LABEL RECORD STANDARD.
 01 outof-REC.
  02 outof-ANAH.
    03 outof-odano       PIC XXXX.
    03 outof-bas-tarih.
      04 outof-bas-yil    pic 9(04).
      04 outof-bas-ay     pic 9(02).
      04 outof-bas-gun    pic 9(02).
    03 outof-bit-tarih.
      04 outof-bit-yil    pic 9(04).
      04 outof-bit-ay     pic 9(02).
      04 outof-bit-gun    pic 9(02).
  02 outof-isl-tarih.
    03 outof-isl-yil    pic 9(04).
    03 outof-isl-ay     pic 9(02).
    03 outof-isl-gun    pic 9(02).
  02 outof-aciklama     pic x(50).
  02 outof-staf         pic x(04).
  02 outof-bos          pic x(100).
