       FD POSTKOD LABEL RECORD STANDARD.
       01 POSTKOD-REC.
          02 POSTKOD-ANAH.
             03 POSTKOD-KODU     PIC 9(03).
             03 POSTKOD-NO       PIC X(04).
          02 POSTKOD-ADI         PIC X(20).
          02 POSTKOD-TL-TUTAR    PIC 9(12)V99.
          02 POSTKOD-DV-TUTAR    PIC 9(09)V99.
          02 POSTKOD-DOLU-BOS    PIC X.
          02 POSTKOD-BOS         PIC X(10).
          02 POSTKOD-STAF        PIC X(04).
