*
 FD prohrk2 LABEL RECORD STANDARD.
 01 prohrk2-REC.
   02 prohrk2-anah.
      03 prohrk2-profil-anah.
        05 prohrk2-profil-sirket      pic x(8).
        05 prohrk2-profil-no          pic 9(8).
      03 prohrk2-rez-anah.
        05 prohrk2-rez-sirket         pic x(8).
        05 prohrk2-rez-no             pic 9(8).
        05 prohrk2-rez-sira           pic 99.
   02 prohrk2-pro-adi                 pic x(20).
   02 prohrk2-pro-soyadi              pic x(20).         
   02 prohrk2-acenta                  pic x(4).
   02 prohrk2-gel-tar.
      03 prohrk2-gel-yil              pic 9(4).
      03 prohrk2-gel-ay               pic 9(2).
      03 prohrk2-gel-gun              pic 9(2).
   02 prohrk2-git-tar.
      03 prohrk2-git-yil              pic 9(4).
      03 prohrk2-git-ay               pic 9(2).
      03 prohrk2-git-gun              pic 9(2). 
   02 prohrk2-banka                   pic x(02).
   02 prohrk2-doviz                   pic x(02).
   02 prohrk2-pans                    pic x(02).
   02 prohrk2-pazar                   pic x(02).
   02 prohrk2-ulke                    pic x(03).
   02 prohrk2-voucher                 pic x(10).
   02 prohrk2-t-oda-fiyati            pic 9(7)v99.
   02 prohrk2-t-ext-fiyati            pic 9(7)v99.
   02 prohrk2-odano                   pic x(04).
   02 prohrk2-r-folio                 pic 9(08).
   02 prohrk2-e-folio                 pic 9(08).
   02 prohrk2-anlasma                 pic x(02).
   02 prohrk2-kur-deg                 PIC 9(9)V9(05) COMP-3.
   02 prohrk2-duz-tarih.
     03 prohrk2-duz-yil               pic 9(4).
     03 prohrk2-duz-ay                pic 9(2).
     03 prohrk2-duz-gun               pic 9(2).
   02 filler                          pic x.
   02 prohrk2-rez-durumu              pic x.
   02 prohrk2-bos                     pic x(49).

