       FD PROSIF LABEL RECORD STANDARD.
       01 PROSIF-REC.
          02 PROSIF-ANAH.
             03 PROSIF-KIM         PIC X(04).
             03 PROSIF-COB         PIC X(50).
             03 PROSIF-TIPI        PIC X.
          02 PROSIF-KODU           PIC X(50).
          02 PROSIF-ADI            PIC X(50).
          02 PROSIF-SIFRE          PIC X(20).
          02 PROSIF-YETKI.
             03 PROSIF-GIRIS       PIC X.
             03 PROSIF-RAPOR       PIC X.
             03 PROSIF-WRITE       PIC X.
             03 PROSIF-REWRITE     PIC X.
             03 PROSIF-DELETE      PIC X.
             03 PROSIF-DIGER-1     PIC X.
             03 PROSIF-DIGER-2     PIC X.
             03 PROSIF-DIGER-3     PIC X.
             03 PROSIF-DIGER-4     PIC X.
             03 PROSIF-DIGER-5     PIC X.
             03 PROSIF-DIGER-6     PIC X.
             03 PROSIF-DIGER-7     PIC X.
             03 PROSIF-DIGER-8     PIC X.
             03 PROSIF-DIGER-9     PIC X.
             03 PROSIF-DIGER-10    PIC X.
          02 PROSIF-DETAYLAR       PIC X(50).
***********> 10101010101 Olan detaylar 1 olamayanlar 0
          02 PROSIF-GENEL-AYARLAR.
             03 PROSIF-KULLANICI-ADI  PIC X.
             03 PROSIF-TERMINAL-ADI   PIC X.
             03 PROSIF-SISTEM-TARIHI  PIC X.
             03 PROSIF-TOPLAM-SAYFA   PIC X.
             03 PROSIF-SAYFA-NUMARASI PIC X.
             03 PROSIF-SISTEM-SAATI   PIC X.
          02 PROSIF-KUL-SIFRE         PIC X.
          02 PROSIF-BOS            PIC X(13).
          02 PROSIF-STAF           PIC X(4).
****************************************************
***********PROSIF-TIPI                **************
***********S-SIRKET GIRIS IZNI        **************
***********  PROSIF-KIM KULLANICI KODU**************
***********  PROSIF-COB SIRKET-KODU   **************
***********  PROSIF-GIRIS = "E" ise sirkete girebilir 
***********P-PROGRAM SIFRESI          **************
***********  PROSIF-KIM SPACES        **************
***********  PROSIF-COB PROGRAM ISMI  **************
***********Y-Yetkiler                 **************
***********D-Detaylar                 **************
***********  PROSIF-KIM = Kullanici   **************
***********    eger program kullanici **************
***********    bazinda detay          **************
***********    kullanmayacaksa bosluk **************
***********  PROSIF-COB = program ismi**************
***********  PROSIF-DETAY = Eger detay kullanilacaksa 1            
***********  diger hallerde 0
****************************************************
