fd rapor label record standard.
01 rapor-rec.
   02 rapor-anahtar.
      03 rapor-tipi           pic x.
      03 rapor-no             pic 9(4).
   02 rapor-adi               pic x(50).
* rapor anah secimi ve start sirasi
   02 rapor-anah-sira      pic 9(2). 
   02 rapor-anah-sahalar.
      03 rapor-anah-sahalar-occ  occurs 15 times.
         04 rapor-anah-secim               pic 9.
         04 rapor-anah-gorunsunmu          pic 9.
            88 rapor-anah-invisible     value 0.
            88 rapor-anah-visible       value 1. 
         04 rapor-anah-bas-flt-tipi             pic x.
            88 rapor-anah-bas-flt-sabit      value "S".
            88 rapor-anah-bas-flt-degisken   value "D".
            88 rapor-anah-bas-flt-gune-bagli value "G".
         04 rapor-anah-bit-flt-tipi             pic x.
            88 rapor-anah-bit-flt-sabit      value "S".
            88 rapor-anah-bit-flt-degisken   value "D".
            88 rapor-anah-bit-flt-gune-bagli value "G".
         04 rapor-anah-fltler-esitmi            pic x.
            88 rapor-anah-fltler-esit        value "E".
         04 rapor-anah-fltler-bas-deger         pic x(20).
         04 rapor-anah-fltler-bit-deger         pic x(20).
   02 rapor-yrd-sahalar.
      03 rapor-yrd-sahalar-occ occurs 50 times.
         04 rapor-yrd-gorunsunmu         pic 9.
            88 rapor-yrd-invisible     value 0.
            88 rapor-yrd-visible       value 1. 
         04 rapor-yrd-bas-flt-tipi             pic x.
            88 rapor-yrd-bas-flt-sabit      value "S".
            88 rapor-yrd-bas-flt-degisken   value "D".
            88 rapor-yrd-bas-flt-gune-bagli value "G".
         04 rapor-yrd-fltler-bas-deger         pic x(10).
   02 rapor-detaylar.
      03 rapor-detaylar-occ    occurs 50 times.
         04 rapor-detaylar-e-h                 pic x.
            88 rapor-detaylar-ciksin        value "E".
         04 rapor-detaylar-sira                pic 9(2).
         04 rapor-detaylar-au                  pic 9(2).
   02 rapor-icmal.
      03 rapor-icmal-sekil             pic 9.
         88 rapor-icmal-sekil-detay       values are 0,1.
         88 rapor-icmal-sekil-detay-icmal value 2.
         88 rapor-icmal-sekil-icmal       value 3.
      03 rapor-icmal-anahlar.
         04 rapor-icmal-anah11     pic 9(2).
         04 rapor-icmal-anah12     pic 9(2).
         04 rapor-icmal-anah21     pic 9(2).
         04 rapor-icmal-anah22     pic 9(2).
         04 rapor-icmal-anah31     pic 9(2).
         04 rapor-icmal-anah32     pic 9(2).
      03 rapor-icmal-detaylar.
         04 rapor-icmal-detaylar-occ occurs 50 times.
            05 rapor-icmal-detaylar-gorev       pic 9.
               88 rapor-icmal-detaylar-yok   value 0.
               88 rapor-icmal-detaylar-say   value 1.
               88 rapor-icmal-detaylar-topla value 2.
   02 rapor-gelecek                            pic x(937).
   02 rapor-info.
      03 rapor-olus-tarih.
         04 rapor-olus-yil      pic 9(4).
         04 rapor-olus-ay       pic 9(2).
         04 rapor-olus-gun      pic 9(2).
      03 rapor-olus-zaman.
         04 rapor-olus-saat     pic 9(2).
         04 rapor-olus-dakika   pic 9(2).
         04 rapor-olus-saniye   pic 9(2).
   02 rapor-staf                               pic x(4).
* rapor-tipi "R" rezbul.asy den gelen raporlar

fd veritabani label record standard.
01 veritabani-rec.
   02 veritabani-anah.
      03 veritabani-anah11       pic x(20).
      03 veritabani-anah12       pic x(20).
      03 veritabani-anah21       pic x(20).
      03 veritabani-anah22       pic x(20).
      03 veritabani-anah31       pic x(20).
      03 veritabani-anah32       pic x(20).
   02 veritabani-goster-1        pic x.
   02 veritabani-goster-2        pic x.
   02 veritabani-goster-3        pic x.
   02 veritabani-degerler.
      03 veritabani-deger-occ occurs 50 times.
         04 veritabani-deger     pic 9(15)v9(2) comp-3.
