fd rapordzg label record standard.
01 rapordzg-rec.
   02 rapordzg-anah.
      03 rapordzg-prog      pic x(50).
      03 rapordzg-kllnc     pic x(08).
   02 
