fd rapor label record standard.
01 rapor-rec.
   02 rapor-anahtar.
      03 rapor-tipi           pic x.
      03 rapor-no             pic 9(4).
   02 rapor-adi               pic x(50).
   02 rapor-cb-1              pic 9.
   02 rapor-cb-2              pic 9.
   02 rapor-cb-3              pic 9.
   02 rapor-cb-4              pic 9.
   02 rapor-cb-5              pic 9.
   02 rapor-cb-6              pic 9.
   02 rapor-cb-7              pic 9.
   02 rapor-cb-8              pic 9.
   02 rapor-gelecek           pic x(192).
