       FD rezgrup2 LABEL RECORD STANDARD.
       01 rezgrup2-REC.
          02 rezgrup2-ANAHTAR.
             03 rezgrup2-kodu      PIC 9(6).
          02 rezgrup2-diger.
             03 rezgrup2-adi       Pic x(20).
             03 rezgrup2-acenta        pic x(04).
             03 rezgrup2-gel-tar       pic 9(08).
             03 rezgrup2-git-tar       pic 9(08).
             
