       FD REZTOP LABEL RECORD STANDARD.
       01 REZTOP-REC.
          02 REZTOP-ANAH.
              03 REZTOP-OTEL           PIC 99.
              03 REZTOP-NO             PIC 9(08).
          02 REZTOP-TIPI              PIC 9.
**********>1->Alotment 2->It 3->Grup 4->Munferit...gibi
          02 REZTOP-DURUMU            PIC X.
**********>REZ-Durumu => REZervasyonun durumunu belirtir....
**********>I->Iceridekir REZ.  S->Silinmis,Iplat REZ.
**********>Onemli butun anahtar sahalarda olacak...............
          02 REZTOP-ACEN-ANAH.
             03 REZTOP-ACENTA         PIC X(4).
             03 REZTOP-GIR-TAR.
                04 REZTOP-GIR-YIL     PIC 9999.
                04 REZTOP-GIR-AY      PIC 99.
                04 REZTOP-GIR-GUN     PIC 99.
             03 REZTOP-CIK-TAR.
                04 REZTOP-CIK-YIL     PIC 9999.
                04 REZTOP-CIK-AY      PIC 99.
                04 REZTOP-CIK-GUN     PIC 99.
          02 REZTOP-ADI               PIC X(20).
          02 REZTOP-SOYADI            PIC X(20).
          02 REZTOP-BANKA             PIC 99.
          02 REZTOP-DOVIZ             PIC 99.
          02 REZTOP-ANLASMA           PIC XX.
          02 REZTOP-ODEME-TIPI        PIC XX.
          02 REZTOP-PAN-TIPI          PIC XX.
          02 REZTOP-ULKE              PIC X(03).
          02 REZTOP-VOUCHER           PIC X(10).
          02 REZTOP-KUR-AYGUN         PIC X.
**********>A->Ay basi kuru   G->Gunluk Kur....
          02 REZTOP-K-G-B             PIC X.
**********>K->Confirme G->Gecici B->Beklemede
          02 REZTOP-VIP               PIC X.
**********>V->V.I.P    T->Top V.I.P
          02 REZTOP-KOMISYON          PIC 99.
**********>REZTOP-Komisyon   -> Acenta Komisyonunu Belirlemek Icin Kullanilir
          02 REZTOP-NOR-INDIRIM       PIC 99V99.
**********>REZTOP-Nor-Indirim-> Girilen oran kadar fiyattan indirilecek......
**********>Indirim ile cocuk indirimi birlestirildi..
          02 REZTOP-C-IN              PIC X.
          02 REZTOP-FOLIO             PIC 9(08).
**********>REZTOP-C-In       -> REZTOPervasyonun C/In Yapilip yapilmadigini belirtir.
**********>REZTOP-Folio      -> REZTOPervasyon  C/In Yapildiginda Folio nosu islenir
          02 REZTOP-ODANO             PIC X(04).
**********>REZTOP-Odano      -> REZTOPervasyon esnasinda blokaj yapmaya yarar........
          02 REZTOP-S-D-T-G           PIC 9.
          02 REZTOP-ODA-KONUMU        PIC 9.
          02 REZTOP-KISI.
             03 REZTOP-BUYUK          PIC 9(02).
             03 REZTOP-KUCUK          PIC 9(02).
             03 REZTOP-bebek          PIC 9(01).
             03 REZTOP-FREE           PIC 9(01).
          02 REZTOP-FIYATI            PIC 9(12)V99 COMP-3.
**********>
          02 REZTOP-ISL-TAR.
             03 REZTOP-ISL-YIL        PIC 9999.
             03 REZTOP-ISL-AY         PIC 99.
             03 REZTOP-ISL-GUN        PIC 99.
          02 REZTOP-AL-TAR.
             03 REZTOP-AL-YIL         PIC 9999.
             03 REZTOP-AL-AY          PIC 99.
             03 REZTOP-AL-GUN         PIC 99.
          02 REZTOP-OPS-TAR.
             03 REZTOP-OPS-YIL        PIC 9999.
             03 REZTOP-OPS-AY         PIC 99.
             03 REZTOP-OPS-GUN        PIC 99.
          02 REZTOP-GEL-ZAMAN.
             03 REZTOP-GEL-SAAT       PIC 99.
             03 REZTOP-GEL-DAK        PIC 99.
          02 REZTOP-GIT-ZAMAN.
             03 REZTOP-GIT-SAAT       PIC 99.
             03 REZTOP-GIT-DAK        PIC 99.
          02 REZTOP-GENEL-BILGI.
             03 REZTOP-GRUP-NO        PIC X(04).
             03 REZTOP-GRUP-ADI       PIC X(15).
             03 REZTOP-ADRES1         PIC X(20).
             03 REZTOP-ADRES2         PIC X(20).
             03 REZTOP-NOT1           PIC X(20).
             03 REZTOP-NOT2           PIC X(20).
             03 REZTOP-TELNO          PIC X(20).
             03 REZTOP-E-MAIL         PIC X(40).
          02 REZTOP-ON-ODEME          pic 9(12)V99 COMP-3.
          02 REZTOP-ON-DOVIZ          pic 9(02).
          02 REZTOP-PAZAR             pic X(02).
          02 REZTOP-EB                pic X.
          02 REZTOP-FIYAT-FIX         PIC X.
**********>REZTOP-FIYAT-FIX  ->="E" Peryot degisiminde fiyatti degismesin     
          02 REZTOP-FIYAT-KONUMU      PIC 9.
          02 REZTOP-AKSIYON-EH        PIC X.
          02 REZTOP-BOS               PIC X(48).
          02 REZTOP-STAF              PIC X(04).
