****************
 FD ROMHRK LABEL RECORD STANDARD.
 01 ROMHRK-REC.
          02 ROMHRK-ANAH.
             03 ROMHRK-FOLIO      PIC 9(08).
             03 ROMHRK-ISLEM      PIC 9(08).
          02 ROMHRK-ISLEM-TIPI    PIC X.
          02 ROMHRK-ISLEM-TIPI2   PIC X.
          02 ROMHRK-TARIH.
             03 ROMHRK-YIL        PIC 9999.
             03 ROMHRK-AY         PIC 99.
             03 ROMHRK-GUN        PIC 99.
          02 ROMHRK-DEPKOD        PIC 999.
          02 ROMHRK-CORR-DEPKOD   PIC 999.
          02 ROMHRK-BA            PIC X.
          02 ROMHRK-TL-TUTAR      PIC 9(12)V99 COMP-3.
          02 ROMHRK-DV-TUTAR      PIC 9(09)V99 COMP-3.
          02 ROMHRK-ZAMAN.
             03 ROMHRK-SAAT       PIC 99.
             03 ROMHRK-DAKIKA     PIC 99.
             03 ROMHRK-SANIYE     PIC 99.
          02 ROMHRK-KART-NO       PIC X(05).
          02 ROMHRK-CEKNO         PIC 9(06).
          02 ROMHRK-POS-KODU      PIC X(02).
          02 ROMHRK-ref           PIC 9.
          02 ROMHRK-BOS           PIC X(04).
          02 ROMHRK-FATURA-NO       PIC 9(8) COMP-3.
          02 ROMHRK-FATURA-NO-ALFABE 
             REDEFINES ROMHRK-FATURA-NO PIC X(5).
          02 ROMHRK-STAF          PIC X(04).

*********>             A C I K L A M A L A R      *******************
*********> belirtir...I-> Inhouse H->History Gibi............

*********> Romhrk-Islem-Tipi=> Islemin Kaynagini Belirtir...
*********  M->Manuel O->OtoMatik Posting P->Postan Gelen Kayit L-Single posting
*********  Y-Yilbasi Devri
*********  C->Check-Out Kaydi S->Santral Kaysi T->Transfer..Ilaveler Eklenecek
*********> Romhrk-P-K      => Islemin Pesin mi Kredi mi Oldugunu belirtir....

$XFD FILE =exthrk
 FD EXTHRK LABEL RECORD STANDARD.
 01 EXTHRK-REC.
          02 EXTHRK-ANAH.
             03 EXTHRK-FOLIO      PIC 9(08).
             03 EXTHRK-ISLEM      PIC 9(08).
          02 EXTHRK-ISLEM-TIPI    PIC X.
          02 EXTHRK-ISLEM-TIPI2   PIC X.
          02 EXTHRK-TARIH.
             03 EXTHRK-YIL        PIC 9999.
             03 EXTHRK-AY         PIC 99.
             03 EXTHRK-GUN        PIC 99.
          02 EXTHRK-DEPKOD        PIC 999.
          02 EXTHRK-CORR-DEPKOD   PIC 999.
          02 EXTHRK-BA            PIC X.
          02 EXTHRK-TL-TUTAR      PIC 9(12)V99 COMP-3.
          02 EXTHRK-DV-TUTAR      PIC 9(09)V99 COMP-3.
          02 EXTHRK-ZAMAN.
             03 EXTHRK-SAAT       PIC 99.
             03 EXTHRK-DAKIKA     PIC 99.
             03 EXTHRK-SANIYE     PIC 99.
          02 EXTHRK-KART-NO       PIC X(05).
          02 EXTHRK-CEKNO         PIC 9(06).
          02 EXTHRK-POS-KODU      PIC X(02).
          02 EXTHRK-ref           PIC 9.
          
          02 EXTHRK-BOS           PIC X(04).
          02 EXTHRK-FATURA-NO       PIC 9(8) COMP-3.
          02 EXTHRK-FATURA-NO-ALFABE 
             REDEFINES EXTHRK-FATURA-NO PIC X(5).
          02 EXTHRK-STAF          PIC X(04).

*********>             A C I K L A M A L A R      *******************
*********> belirtir...I-> Inhouse H->History Gibi............

*********> Exthrk-Islem-Tipi=> Islemin Kaynagini Belirtir...
*********  M->Manuel O->OtoMatik Posting P->Postan Gelen Kayit
*********  C->Check-Out Kaydi S->Santral Kaysi T->Transfer..Ilaveler Eklenecek
*********> Exthrk-P-K      => Islemin Pesin mi Kredi mi Oldugunu belirtir....
$XFD FILE =hrk2
 FD hrk2 LABEL RECORD STANDARD.
 01 hrk2-REC.
          02 hrk2-ANAH.
             03 hrk2-FOLIO      PIC 9(08).
             03 hrk2-ISLEM      PIC 9(08).
          02 hrk2-data.   
	          05 hrk2-kaynak-folio    PIC 9(08).
	          05 hrk2-ger-DV-TUTAR      PIC 9(09)V99.
	          05 hrk2-ger-banka       pic 99.
	          05 hrk2-ger-doviz       pic 99.
	          05 hrk2-cin-kuru        pic 9.
                  05 HRK2-ESKi-KUR         pic 99v99999.
	          05 hrk2-bos             pic x(77).
	          05 hrk2-STAF          PIC X(04).
$XFD FILE =yromhrk
 FD yROMHRK LABEL RECORD STANDARD.
 01 yROMHRK-REC.
          02 yROMHRK-ANAH.
             03 yROMHRK-FOLIO      PIC 9(08).
             03 yROMHRK-ISLEM      PIC 9(08).
          02 yROMHRK-ISLEM-TIPI    PIC X.
          02 yROMHRK-ISLEM-TIPI2   PIC X.
          02 yROMHRK-TARIH.
             03 yROMHRK-YIL        PIC 9999.
             03 yROMHRK-AY         PIC 99.
             03 yROMHRK-GUN        PIC 99.
          02 yROMHRK-DEPKOD        PIC 999.
          02 yROMHRK-CORR-DEPKOD   PIC 999.
          02 yROMHRK-BA            PIC X.
          02 yROMHRK-TL-TUTAR      PIC 9(12)V99 COMP-3.
          02 yROMHRK-DV-TUTAR      PIC 9(09)V99 COMP-3.
          02 yROMHRK-ZAMAN.
             03 yROMHRK-SAAT       PIC 99.
             03 yROMHRK-DAKIKA     PIC 99.
             03 yROMHRK-SANIYE     PIC 99.
          02 yROMHRK-KART-NO       PIC X(05).
          02 yROMHRK-CEKNO         PIC 9(06).
          02 yROMHRK-POS-KODU      PIC X(02).
          02 yROMHRK-ref           PIC 9.
          02 yROMHRK-BOS           PIC X(04).
          02 yROMHRK-FATURA-NO       PIC 9(8) COMP-3.
          02 yROMHRK-FATURA-NO-ALFABE 
             REDEFINES yROMHRK-FATURA-NO PIC X(5).
          02 yROMHRK-STAF          PIC X(04).
          02 yROMHRK-data.   
	          05 yROMHRK-kaynak-folio    PIC 9(08).
	          05 yROMHRK-bos2             pic x(100).
	          05 yROMHRK-STAF2          PIC X(04).
$XFD FILE =folref
 FD folref LABEL RECORD STANDARD.
 01 folref-REC.
          02 folref-ANAH.
             03 folref-tip        pic x.
             03 folref-FOLIO      PIC 9(08).
             03 folref-ref         PIC 9.
          02 folref-data.   
	          05 folref-ode             PIC X.
	          05 folref-profil-anah.
	            07 folref-profil-sirket pic x(08).
	            07 folref-profil-no     pic 9(08).
	          05 folref-bos            pic x(100).
	          05 folref-STAF          PIC X(04).
$XFD FILE =route
 fd route label record standard.
 01 route-rec.
   02 route-anah.
      05 route-rezno           pic 9(08).
      05 route-folio           pic 9(08). 
      05 route-depkod          pic 999.
      05 filler                pic x(10).
   02 route-data.
      05 route-tip              pic x.    | R -Rez F- Folio P-pencere
      05 route-no          pic 9(8).
      05 filler            pic x(20).
         

	          
	          

