       FD SILHRK LABEL RECORD STANDARD.
       01 SILHRK-REC.
          02 SILHRK-ANAH.
             03 SILHRK-FOLIO      PIC 9(08).
             03 SILHRK-ISLEM      PIC 9(08).
          02 SILHRK-ISLEM-TIPI    PIC X.
          02 SILHRK-ISLEM-TIPI2   PIC X.
          02 SILHRK-TARIH.
             03 SILHRK-YIL        PIC 9999.
             03 SILHRK-AY         PIC 99.
             03 SILHRK-GUN        PIC 99.
          02 SILHRK-DEPKOD        PIC 999.
          02 SILHRK-CORR-DEPKOD   PIC 999.
          02 SILHRK-BA            PIC X.
          02 SILHRK-TL-TUTAR      PIC 9(12)V99 COMP-3.
          02 SILHRK-DV-TUTAR      PIC 9(09)V99 COMP-3.
          02 SILHRK-ZAMAN.
             03 SILHRK-SAAT       PIC 99.
             03 SILHRK-DAKIKA     PIC 99.
             03 SILHRK-SANIYE     PIC 99.
          02 SILHRK-KART-NO       PIC X(05).
          02 SILHRK-CEKNO         PIC 9(06).
          02 SILHRK-POS-KODU      PIC X(02).
          02 SILHRK-BOS           PIC X(10).
          02 SILHRK-STAF          PIC X(04).

*********>             A C I K L A M A L A R      *******************
*********> belirtir...I-> Inhouse H->History Gibi............

*********> Silhrk-Islem-Tipi=> Islemin Kaynagini Belirtir...
*********  M->Manuel O->OtoMatik Posting P->Postan Gelen Kayit
*********  C->Check-Out Kaydi S->Santral Kaysi T->Transfer..Ilaveler Eklenecek
*********  R-Re_open folio
*********> Silhrk-P-K      => Islemin Pesin mi Kredi mi Oldugunu belirtir....
