       FD skonuk LABEL RECORD STANDARD.
       01 skonuk-REC.
          02 skonuk-ANAH.
             03 skonuk-FOLIO         PIC 9(08).
          02 skonuk-DURUMU           PIC X.
*********> skonuk-Durumu   => Folionun iceridemi yoksa histroyde mi oldugunu
*********> belirtir...I-> Iceride H->Historyde Gibi............
          02 skonuk-FOL-KODU         PIC X.
*********> skonuk-Fol-Kodu => R-> Oda E-> Extra T-> Telefon G-> Grup B-> Bos
          02 skonuk-ADI              PIC X(20).
          02 skonuk-SOYADI           PIC X(20).
          02 skonuk-S-D-T-G          PIC 9.
          02 skonuk-ODA-KONUMU       PIC 99.
          02 skonuk-ODEME-TIPI       PIC XX.
          02 skonuk-ODANO            PIC X(04).
          02 skonuk-REZ-NO           PIC 9(08).
          02 skonuk-ULKE             PIC XXX.
          02 skonuk-KISI.
             03 skonuk-BUYUK         PIC 9(02).
             03 skonuk-KUCUK         PIC 9(02).
             03 skonuk-BEBEK         PIC 9(01).
             03 skonuk-FREE          PIC 9(01).
          02 skonuk-ACENTA           PIC X(04).
          02 skonuk-GRUP-NO          PIC X(04).
          02 skonuk-VOUCHER          PIC X(10).
          02 skonuk-NOR-INDIRIM      PIC 99V99.
          02 skonuk-PAN-TIPI         PIC XX.
          02 skonuk-REZ-TIPI         PIC 9.
          02 skonuk-BANKA            PIC 99.
          02 skonuk-DOVIZ            PIC 99.
          02 skonuk-ANLASMA          PIC XX.
          02 skonuk-KUR-AYGUN        PIC X.
*********> skonuk-Kur-Aygun = A-> Aybasi Kuru G-> Gunluk kur
          02 skonuk-FATURA           PIC X.
          02 skonuk-CIK-CIKMA        PIC X.
          02 skonuk-ERKEN-CIK        PIC X.
          02 skonuk-UZATMA           PIC X.
          02 skonuk-POSTING          PIC X.
          02 skonuk-VIP              PIC X.
          02 skonuk-ODADEGIS         PIC X.
*********> skonuk-Erken-Cik = Early C/Out E/H
*********> skonuk-Uzatma    = Uzatma      E/H
*********> skonuk-Posting   = Posting     E/H
*********> skonuk-Vip       = V-> V.I.P T-> Top V.I.P
*********> skonuk-Fatura    = E-> Faturasi Kesilmis.. H-> Faturasi Kesilmemis
*********> skonuk-Cik-Cikma = E-> Musteri Listesi Cik H-> Musteri Listesi Cikma
*********> skonuk-Odadegis  = E-> Bu Oda Room change yapilmistir.....
          02 skonuk-ACIK-KAPALI      PIC X.
*********> skonuk-Acik-kapali = O-> Open C-> Close
          02 skonuk-GEL-TAR.
             03 skonuk-GEL-YIL       PIC 9999.
             03 skonuk-GEL-AY        PIC 99.
             03 skonuk-GEL-GUN       PIC 99.
          02 skonuk-GIT-TAR.
             03 skonuk-GIT-YIL       PIC 9999.
             03 skonuk-GIT-AY        PIC 99.
             03 skonuk-GIT-GUN       PIC 99.
          02 skonuk-GEL-ZAMAN.
             03 skonuk-GEL-SAAT      PIC 99.
             03 skonuk-GEL-DAKIKA    PIC 99.
             03 skonuk-GEL-SANIYE    PIC 99.
          02 skonuk-GIT-ZAMAN.
             03 skonuk-GIT-SAAT      PIC 99.
             03 skonuk-GIT-DAKIKA    PIC 99.
             03 skonuk-GIT-SANIYE    PIC 99.

          02 skonuk-ODA-TUTAR        PIC 9(12)V99   COMP-3.
          02 skonuk-EXTBED-TUTAR     PIC 9(12)V99   COMP-3.
          02 skonuk-KAHVALTI-TUTAR   PIC 9(12)V99   COMP-3.
          02 skonuk-OGLE-TUTAR       PIC 9(12)V99   COMP-3.
          02 skonuk-AKSAM-TUTAR      PIC 9(12)V99   COMP-3.
          02 skonuk-ICECEK-TUTAR     PIC 9(12)V99   COMP-3.
          02 skonuk-EXTRA-TUTAR      PIC 9(12)V99   COMP-3.

          02 skonuk-TOP-BORC         PIC S9(12)V99  COMP-3.
          02 skonuk-TOP-ALAC         PIC S9(12)V99  COMP-3.
          02 skonuk-KUR-DEGERI       PIC 9(9)V9(05) COMP-3.
          02 skonuk-DV-DEGERI        PIC 9(12)V99   COMP-3.

          02 skonuk-ACIK.
             03 skonuk-ACIK-1        PIC X(20).
             03 skonuk-ACIK-2        PIC X(20).
          02 skonuk-KARTNO           PIC X(07).
          02 skonuk-REOPEN           PIC X.
          02 skonuk-TOM.
             03 skonuk-TOM-VAR-YOK   PIC X.
             03 skonuk-TOM-ALKOL     PIC 9.
             03 skonuk-TOM-SERINO    PIC X(12).
          02 skonuk-PAZAR            PIC X(02).
          02 skonuk-EB               PIC X.
          02 skonuk-FIYAT-FIX        PIC X.
          02 skonuk-GELIS-SAYISI     PIC 9(2).
          02 skonuk-FIYAT-KONUMU     PIC 99.
          02 skonuk-GEC-GIRIS        PIC 9.
          02 skonuk-FAT-NO           PIC 9(06).
          02 skonuk-UG-INDIRIMI      PIC 9.
          02 skonuk-BILBORD-EH       PIC X.
          02 skonuk-EXTRA-REZ-NO     PIC 9(08).
          02 skonuk-TITLE            PIC X(13).
          02 skonuk-SAFE             PIC 9.
          02 skonuk-ANAHTAR          PIC 9.
          02 skonuk-LATE-ZAMAN.
            03 skonuk-LATE-GEL-SAAT  PIC 99.
            03 skonuk-LATE-GEL-DAK   PIC 99.
          02 skonuk-AKSIYON-EH       PIC X.
          02 skonuk-share            pic 9.
          02 skonuk-SPECIAL-EH         pic 9.
          02 skonuk-sehir            pic xxx.
          02 skonuk-BOS              PIC X(05).
          02 skonuk-STAF             PIC X(04).
          02 skonuk-gercek-tar.
             03 skonuk-gercek-YIL       PIC 9999.
             03 skonuk-gercek-AY        PIC 99.
             03 skonuk-gercek-GUN       PIC 99.
          02 skonuk-otel-tar.
             03 skonuk-otel-YIL       PIC 9999.
             03 skonuk-otel-AY        PIC 99.
             03 skonuk-otel-GUN       PIC 99.
          02 skonuk-gercek-zaman.
             03 skonuk-gercek-SAAT      PIC 99.
             03 skonuk-gercek-DAKIKA    PIC 99.
             03 skonuk-gercek-SANIYE    PIC 99.
          02 skonuk-silen-STAF             PIC X(04).
********> skonuk-Durumu.....Degiskeni  folionun iceridemi yoksa History de mi
********> Oldugunu gosterir.. Anahtar sahalar icin gerekli................
********> I-> Iceride H-> Historyde...........
********> Konum-tom-var-yok => "E" Ise bu folioya ait tom var demektir....
********> Konum-tom-alkol   => Musterinin alkol seviyesini belirler........
********>                 0 => Alkolsuz............
********>                 1 => Az Alkollu..........
********>                 2 => Orta Alkollu........
********>                 3 => Cok Alkollu.........

