*

 FD tahmin LABEL RECORD STANDARD.
 01 tahmin-rec.
    02 tahmin-tipi                      pic x.
       88 tahmin-toplam                 values are "T","t","+".
       88 tahmin-yuzde                  values are "Y","y","%".
    02 tahmin-yeri                      pic x.
       88 tahmin-bastan                 values are "B","b".
       88 tahmin-ortadan                values are "O","o".
       88 tahmin-sondan                 values are "S","s".
    02 tahmin-notu                      pic 999 value zero.
       88 tahmin-yok                    value zero.
       88 tahmin-zayif                  value 01 thru 19.
       88 tahmin-gecer                  value 20 thru 39.
       88 tahmin-orta                   value 40 thru 59.
       88 tahmin-iyi                    value 60 thru 79.
       88 tahmin-pekiyi                 value 80 thru 99.
       88 tahmin-tam                    value 100.
    02 tahmin-str                       pic x(20) value spaces.
    02 tahmin-str-boy                   pic 99.
*
