       FD TAKVIMTOP LABEL RECORD STANDARD.
       01 TAKVIMTOP-REC.
          02 TAKVIMTOP-ANAH.
             03 TAKVIMTOP-YIL       PIC 9999.
             03 TAKVIMTOP-AY        PIC 99.
             03 TAKVIMTOP-GUN       PIC 99.
          02 TAKVIMTOP-KACINCI      PIC 999.
          02 TAKVIMTOP-GUN-ADI      PIC 9.
          02 TAKVIMTOP-MESAI-TATIL  PIC X.
          02 TAKVIMTOP-TOP-ODA      PIC 9999 COMP-3.
          02 TAKVIMTOP-HAZIR-ODA    PIC 9999 COMP-3.
          02 TAKVIMTOP-SATILAN OCCURS 9 TIMES. 
             03 TAKVIMTOP-S-D-T-G OCCURS 4 TIMES. 
                04 TAKVIMTOP-SAT-ODA      PIC 9999 COMP-3.
                04 TAKVIMTOP-SAT-KISI.
                   05 TAKVIMTOP-SAT-BUYUK PIC 9999 COMP-3.
                   05 TAKVIMTOP-SAT-KUCUK PIC 9999 COMP-3.
                   05 TAKVIMTOP-SAT-FREE  PIC 9999 COMP-3.
          02 TAKVIMTEK    OCCURS    9 TIMES.
                03 TAKVIMTEK-TOP-ODA      PIC 9999 COMP-3.
                03 TAKVIMTEK-HAZIR-ODA    PIC 9999 COMP-3.
                03 TAKVIMTEK-SATILAN OCCURS 9 TIMES. 
                   04 TAKVIMTEK-S-D-T-G OCCURS 4 TIMES. 
                      05 TAKVIMTEK-SAT-ODA      PIC 9999 COMP-3.
                      05 TAKVIMTEK-SAT-KISI.
                         06 TAKVIMTEK-SAT-BUYUK PIC 9999 COMP-3.
                         06 TAKVIMTEK-SAT-KUCUK PIC 9999 COMP-3.
                         06 TAKVIMTEK-SAT-FREE  PIC 9999 COMP-3.
                
          02 TAKVIMTOP-BOS          PIC X(20).
*******> TAKVIMTOP-TOP-ODA    => O tarihteki toplam oda sayisi
*******> TAKVIM-HAZIR-ODA  => O tarihteki toplam satisa hazir oda sayisi
*******> TAKVIM-SAT-ODA    => O tarihteki toplam satilan oda sayisi
*******> TAKVIM-SAT-KISI   => O tarihteki toplam satilan pax(Buyuk,Kucuk,Free)
