       FD TAKVIM2 LABEL RECORD STANDARD.
       01 TAKVIM2-REC.
          02 TAKVIM2-ANAH.
             03 TAKVIM2-YIL       PIC 9999.
             03 TAKVIM2-AY        PIC 99.
             03 TAKVIM2-GUN       PIC 99.
          02 TAKVIM2-KACINCI      PIC 999.
          02 TAKVIM2-GUN-ADI      PIC 9.
          02 TAKVIM2-MESAI-TATIL  PIC X.
          02 TAKVIM2-TOP-ODA      PIC 9999 COMP-3.
          02 TAKVIM2-HAZIR-ODA    PIC 9999 COMP-3.
          02 TAKVIM2-SATILAN OCCURS 40 TIMES. 
************             03 filler occurs 4 times .
                07 TAKVIM2-SAT-ODA      PIC 9999 COMP-3.
                07 TAKVIM2-SAT-KISI.
                   09 TAKVIM2-SAT-BUYUK PIC 9999 COMP-3.
                   09 TAKVIM2-SAT-KUCUK PIC 9999 COMP-3.
                   09 TAKVIM2-SAT-FREE  PIC 9999 COMP-3.
          
         02 takvim2-konumlar occurs 40 times.
            05 takvim2-konum-oda    pic 9999.
            05 filler              pic 9999.
          02 filler pic x(533).
          02 TAKVIM2-HAZIR-YATAK   PIC 9999.

          02 takvim2-posting      pic 9. 
          02 TAKVIM2-BOS          PIC X(14).
*******> TAKVIM-TOP-ODA    => O tarihteki toplam oda sayisi
*******> TAKVIM-HAZIR-ODA  => O tarihteki toplam satisa hazir oda sayisi
*******> TAKVIM-SAT-ODA    => O tarihteki toplam satilan oda sayisi
*******> TAKVIM-SAT-KISI   => O tarihteki toplam satilan pax(Buyuk,Kucuk,Free)
