       FD TAKVIM LABEL RECORD STANDARD.
       01 TAKVIM-REC.
      *(( XFD DATE=YYYYMMDD, USE GROUP ))
      $XFD NAME=TAKVIM_ANAH
          02 TAKVIM-ANAH.
             03 TAKVIM-YIL       PIC 9999.
             03 TAKVIM-AY        PIC 99.
             03 TAKVIM-GUN       PIC 99.
          02 TAKVIM-KACINCI      PIC 999.
          02 TAKVIM-GUN-ADI      PIC 9.
          02 TAKVIM-MESAI-TATIL  PIC X.
          02 TAKVIM-TOP-ODA      PIC 9999 COMP-3.
          02 TAKVIM-HAZIR-ODA    PIC 9999 COMP-3.
          02 TAKVIM-SATILAN OCCURS 40 TIMES. 
************             03 filler occurs 4 times .
                07 TAKVIM-SAT-ODA      PIC 9999 COMP-3.
                07 TAKVIM-SAT-KISI.
                   09 TAKVIM-SAT-BUYUK PIC 9999 COMP-3.
                   09 TAKVIM-SAT-KUCUK PIC 9999 COMP-3.
                   09 TAKVIM-SAT-FREE  PIC 9999 COMP-3.
          
         02 takvim-konumlar occurs 40 times.
            05 takvim-konum-oda    pic 9999.
            05 filler              pic 9999.
          02 filler pic x(533).
          02 TAKVIM-HAZIR-YATAK   PIC 9999.

          02 takvim-posting      pic 9. 
          02 TAKVIM-BOS          PIC X(14).
*******> TAKVIM-TOP-ODA    => O tarihteki toplam oda sayisi
*******> TAKVIM-HAZIR-ODA  => O tarihteki toplam satisa hazir oda sayisi
*******> TAKVIM-SAT-ODA    => O tarihteki toplam satilan oda sayisi
*******> TAKVIM-SAT-KISI   => O tarihteki toplam satilan pax(Buyuk,Kucuk,Free)
