       FD TAKVIMr LABEL RECORD STANDARD.
       01 TAKVIMr-REC.
          02 TAKVIMr-ANAH.
            02 takvimr-ref        pic 9.
             03 TAKVIMr-YIL       PIC 9999.
             03 TAKVIMr-AY        PIC 99.
             03 TAKVIMr-GUN       PIC 99.
          02 TAKVIMr-KACINCI      PIC 999.
          02 TAKVIMr-GUN-ADI      PIC 9.
          02 TAKVIMr-MESAI-TATIL  PIC X.
          02 TAKVIMr-TOP-ODA      PIC 9999 COMP-3.
          02 TAKVIMr-HAZIR-ODA    PIC 9999 COMP-3.
          02 TAKVIMr-SATILAN OCCURS 40 TIMES. 
************             03 filler occurs 4 times .
                07 TAKVIMr-SAT-ODA      PIC 9999 COMP-3.
                07 TAKVIMr-SAT-KISI.
                   09 TAKVIMr-SAT-BUYUK PIC 9999 COMP-3.
                   09 TAKVIMr-SAT-KUCUK PIC 9999 COMP-3.
                   09 TAKVIMr-SAT-FREE  PIC 9999 COMP-3.
          
         02 takvimr-konumlar occurs 40 times.
            05 takvimr-konum-oda    pic 9999.
            05 filler              pic 9999.
          02 filler pic x(533).
          02 TAKVIMr-HAZIR-YATAK   PIC 9999.

          02 takvimr-posting      pic 9. 
          02 TAKVIMr-BOS          PIC X(14).
*******> TAKVIM-TOP-ODA    => O tarihteki toplam oda sayisi
*******> TAKVIM-HAZIR-ODA  => O tarihteki toplam satisa hazir oda sayisi
*******> TAKVIM-SAT-ODA    => O tarihteki toplam satilan oda sayisi
*******> TAKVIM-SAT-KISI   => O tarihteki toplam satilan pax(Buyuk,Kucuk,Free)
