FD TELDATA LABEL RECORD STANDARD. 
   01 TELDATA-REC.  
      02 TELDATA-ANAH. 
         03 TELDATA-TARIH. 
            04 TELDATA-YIL    PIC 9999. 
            04 TELDATA-AY     PIC 99. 
            04 TELDATA-GUN    PIC 99. 
         03 TELDATA-ODANO     PIC X(04).
         03 TELDATA-ISLEMNO   PIC 9(06). 
      02 TELDATA-TIPI         PIC X.
      02 TELDATA-NUMARA       PIC X(25).
      02 TELDATA-KONTUR       PIC 9(04).
      02 TELDATA-SATIS        PIC 9(12)V99 COMP-3. 
      02 TELDATA-MALIYET      PIC 9(12)V99 COMP-3. 
      02 TELDATA-FOLIO        PIC 9(08). 
      02 TELDATA-SANT-ZAMAN   PIC X(08). 
      02 TELDATA-SURE         PIC X(08). 
      02 TELDATA-TARIHI       PIC X(08).
      02 TELDATA-SIRA         PIC X(04).
      02 TELDATA-BOS          PIC X(10).
      02 TELDATA-STAF         PIC X(04).
