FD TELKIM LABEL RECORD STANDARD.
01 TELKIM-REC.
   02 TELKIM-ANAH.
      03 TELKIM-TELNO        PIC X(25). 
   02 TELKIM-TIPI            PIC X.
      88 TELKIM-IS           VALUE "I","i".
      88 TELKIM-OZEL         VALUE "O","o".
      88 TELKIM-DIGER        VALUE "D","d".
   02 TELKIM-ACIKLAMA        PIC X(25). 
   02 TELKIM-ADI             PIC X(25). 
   02 TELKIM-SOY             PIC X(25). 
   02 TELKIM-BOS             PIC X(10).
   02 TELKIM-STAF            PIC X(04).
