FD tezkod02 LABEL RECORD STANDARD.
01 tezkod02-REC.
    02 tezkod02-ANAH.
       03 tezkod02-TIPI                 PIC X.
       03 tezkod02-KODU                 PIC X(02).
       03 tezkod02-bos-anah             pic x(20).
    02 tezkod02-entegre-kodu            PIC X(100).
    02 tezkod02-asya-kodu               PIC X(03).
    02 tezkod02-k-adi                   pic x(20).
    02 tezkod02-k-sifre                 pic x(20).
    02 tezkod02-asya-acenta-kodu        pic x(04).
    02 tezkod02-bos                     pic x(205).
*/ TEZKOD02-TIPI -> A = PAZAR KODLARI KARSILIGI
*/ TEZKOD02-TIPI -> B = ODA KONUMU  KARSILIGI
*/ TEZKOD02-TIPI -> C = PANSION KODLARI KARSILIGI
*/ TEZKOD02-TIPI -> D = ULKE KODLARI KARSILIGI
*/ TEZKOD02-TIPI -> E = WEB SERVIS GIRIS KODLARI


