       FD tKUR LABEL RECORD STANDARD.
       01 tKUR-REC.
          02 tKUR-KODU.
             03 tKUR-TARIH.
                04 KUR-YIL    PIC 9(4).
                04 KUR-AY     PIC 9(2).
                04 KUR-GUN    PIC 9(2).
             03 tKUR-BANKA     PIC 9(2).
             03 tKUR-DOVIZ     PIC 9(2).
          02 tDOVIZ-ALIS       PIC 9(9)V9(05) COMP-3.
          02 tDOVIZ-SATIS      PIC 9(9)V9(05) COMP-3.
          02 tEFEKTIF-ALIS     PIC 9(9)V9(05) COMP-3.
          02 tEFEKTIF-SATIS    PIC 9(9)V9(05) COMP-3.
          02 tPARITE           PIC 9(6)V9(05) COMP-3.
          02 tDOVIZ-STAF       PIC X(04).
