       FD turizmr LABEL RECORD STANDARD.
       01 turizmr-REC.   
          02 turizmr-ANAH. 
             03 turizmr-ref    pic 9.
             03 turizmr-ULKE   PIC XXX.
             03 turizmr-sehir  pic xxx.
             03 turizmr-TARIH.     
                04 turizmr-YIL PIC 9999. 
                04 turizmr-AY  PIC 99. 
                04 turizmr-GUN PIC 99. 
          02 KALANr-ODA            PIC 9(4) COMP-3. 
          02 KALANr-KISI.
             03 KALANr-BUYUK       PIC 9(4) COMP-3. 
             03 KALANr-KUCUK       PIC 9(4) COMP-3. 
             03 KALANr-FREE        PIC 9(4) COMP-3. 
             03 KALANr-BEBEK       PIC 9(4) COMP-3. 
          02 GELENr-ODA            PIC 9(4) COMP-3. 
          02 GELENr-KISI.  
             03 GELENr-BUYUK       PIC 9(4) COMP-3. 
             03 GELENr-KUCUK       PIC 9(4) COMP-3. 
             03 GELENr-FREE        PIC 9(4) COMP-3. 
             03 GELENr-BEBEK       PIC 9(4) COMP-3. 
          02 turizmr-TOPLAM-TUTAR  PIC 9(09)V99 COMP-3.
          02 turizmr-CORR-TUTAR    PIC 9(09)V99 COMP-3.
          02 turizmr-BOS           PIC X(40). 
