       FD turizmtop LABEL RECORD STANDARD.
       01 turizmtop-REC.   
          02 turizmtop-ANAH. 
             03 turizmtop-ULKE   PIC XXX. 
             03 turizmtop-TARIH.     
                04 turizmtop-YIL PIC 9999. 
                04 turizmtop-AY  PIC 99. 
                04 turizmtop-GUN PIC 99. 
          02 kalantop-ODA            PIC 9(4) COMP-3. 
          02 kalantop-KISI.
             03 kalantop-BUYUK       PIC 9(4) COMP-3. 
             03 kalantop-KUCUK       PIC 9(4) COMP-3. 
             03 kalantop-FREE        PIC 9(4) COMP-3. 
             03 kalantop-BEBEK       PIC 9(4) COMP-3. 
          02 gelentop-ODA            PIC 9(4) COMP-3. 
          02 gelentop-KISI.  
             03 gelentop-BUYUK       PIC 9(4) COMP-3. 
             03 gelentop-KUCUK       PIC 9(4) COMP-3. 
             03 gelentop-FREE        PIC 9(4) COMP-3. 
             03 gelentop-BEBEK       PIC 9(4) COMP-3. 
          02 TURIZMtop-TOPLAM-TUTAR  PIC 9(09)V99 COMP-3.
          02 TURIZMtop-CORR-TUTAR    PIC 9(09)V99 COMP-3.
          02 turizmtop-BOS           PIC X(40). 
