FD  ULKE  LABEL RECORD IS STANDARD.
 01 ULKE-REC.
     02 ULKE-ANAH.
         03 ULKE-ANAH1       PIC  XXX.
     02 ULKE-ADI         PIC  X(20).
     02 ULKE-TUR-KODU    PIC  99.
     02 ULKE-akbs         PIC  X(05).
     02 ULKE-BOS         PIC  X(05).
     02 ULKE-STAF        PIC  X(04).
