*
 FD viphrk LABEL RECORD STANDARD.
 01 viphrk-REC.
   02 viphrk-ANAH.
    03 viphrk-vip-kodu              pic x(02).
    03 viphrk-vip-malz-kodu         pic x(02).
   02 viphrk-adet                   pic 99.
   02 viphrk-durum                  pic 9.
   02 viphrk-bos                    pic x(49).
*/ viphrk-durum 1 her gun
*/ viphrk-durum 0 girisde

