*
fd voucher label record standard.
01 voucher-rec.
     02 voucher-anahtar.
        03 voucher-filler1                      pic x(10).
        03 voucher-acenta                       pic x(04).
        03 voucher-no                           pic x(10).
        03 voucher-rez                          pic 9(10).
        03 voucher-filler2                      pic x(20).
     02 voucher-fatura                          pic x(10).
     02 voucher-fatura-tutar                    pic 9(12)v9(02).
     02 voucher-eb-tutar                        pic 9(12)v9(02).
     02 voucher-kalan-tutar                     pic 9(12)v9(02).
     02 voucher-bilgiler.
        04 voucher-adi              pic x(20).
        04 voucher-soyadi           pic x(20).
        04 voucher-gel-tarih.
           05 voucher-gel-yil       pic 9(4).
           05 voucher-gel-ay        pic 9(2).
           05 voucher-gel-gun       pic 9(2).
        04 voucher-git-tarih.
           05 voucher-git-yil       pic 9(4).
           05 voucher-git-ay        pic 9(2).
           05 voucher-git-gun       pic 9(2).
        04 voucher-ulke             pic x(03).
        04 voucher-pax              pic 9(03).
        04 voucher-chi              pic 9(03).
        04 voucher-fre              pic 9(03).
        04 voucher-odano            pic x(04).
        04 voucher-ulke22            pic x(03).
        04 voucher-ek-bilgiler      pic x(100).

        04 voucher-odeme-tar        pic x(10).  
        04 voucher-odemeeb-tar      pic x(10).   
        04 voucher-odemeeb-oran      pic 999v99.  





     02 filler                                  pic x(275).
     02 voucher-otel                            pic x(10).|KAYDIN GELÝÞ YERÝ IMPERIAL,PALACE VS...
     02 voucher-staf                            pic x(04). 

