       01 XKONUK-REC.
          02 XKONUK-ANAH.
             03 XKONUK-FOLIO        PIC 9(08).
          02 XKONUK-DURUMU          PIC X.
          02 XKONUK-FOL-KODU        PIC X.
          02 XKONUK-ADI             PIC X(20).
          02 XKONUK-SOYADI          PIC X(20).
          02 XKONUK-S-D-T-G         PIC 9.
          02 XKONUK-ODA-KONUMU      PIC 99.
          02 XKONUK-ODEME-TIPI      PIC XX.
          02 XKONUK-ODANO           PIC X(04).
          02 XKONUK-REZ-NO          PIC 9(08).
          02 XKONUK-ULKE            PIC XXX.
          02 XKONUK-KISI.
             03 XKONUK-BUYUK        PIC 9(02).
             03 XKONUK-KUCUK        PIC 9(02).
             03 XKONUK-BEBEK        PIC 9(01).
             03 XKONUK-FREE         PIC 9(01).
          02 XKONUK-ACENTA          PIC X(04).
          02 xkonuk-mini-ok          pic 9.
          02 xkonuk-plan             pic 9.
          02 xKONUK-duzeltme          PIC 9.
          02 xKONUK-bos3             PIC X(01).
          02 XKONUK-VOUCHER         PIC X(10).
          02 XKONUK-NOR-INDIRIM     PIC 99V99.
          02 XKONUK-PAN-TIPI        PIC XX.
          02 XKONUK-REZ-TIPI        PIC 9.
          02 XKONUK-BANKA           PIC 99.
          02 XKONUK-DOVIZ           PIC 99.
          02 XKONUK-ANLASMA         PIC XX.
          02 XKONUK-KUR-AYGUN       PIC X.
          02 XKONUK-FATURA          PIC X.
          02 XKONUK-CIK-CIKMA       PIC X.
          02 XKONUK-ERKEN-CIK       PIC X.
          02 XKONUK-UZATMA          PIC X.
          02 XKONUK-POSTING         PIC X.
          02 XKONUK-VIP             PIC X.
          02 XKONUK-ODADEGIS        PIC X.
          02 XKONUK-ACIK-KAPALI     PIC X.
          02 XKONUK-GEL-TAR.
             03 XKONUK-GEL-YIL      PIC 9999.
             03 XKONUK-GEL-AY       PIC 99.
             03 XKONUK-GEL-GUN      PIC 99.
          02 XKONUK-GIT-TAR.
             03 XKONUK-GIT-YIL      PIC 9999.
             03 XKONUK-GIT-AY       PIC 99.
             03 XKONUK-GIT-GUN      PIC 99.
          02 XKONUK-GEL-ZAMAN.
             03 XKONUK-GEL-SAAT     PIC 99.
             03 XKONUK-GEL-DAKIKA   PIC 99.
             03 XKONUK-GEL-SANIYE   PIC 99.
          02 XKONUK-GIT-ZAMAN.
             03 XKONUK-GIT-SAAT     PIC 99.
             03 XKONUK-GIT-DAKIKA   PIC 99.
             03 XKONUK-GIT-SANIYE   PIC 99.

          02 XKONUK-ODA-TUTAR       PIC 9(12)V99   COMP-3.
          02 XKONUK-EXTBED-TUTAR    PIC 9(12)V99   COMP-3.
          02 XKONUK-KAHVALTI-TUTAR  PIC 9(12)V99   COMP-3.
          02 XKONUK-OGLE-TUTAR      PIC 9(12)V99   COMP-3.
          02 XKONUK-AKSAM-TUTAR     PIC 9(12)V99   COMP-3.
          02 XKONUK-ICECEK-TUTAR    PIC 9(12)V99   COMP-3.
          02 XKONUK-EXTRA-TUTAR     PIC 9(12)V99   COMP-3.

          02 XKONUK-TOP-BORC        PIC S9(12)V99  COMP-3.
          02 XKONUK-TOP-ALAC        PIC S9(12)V99  COMP-3.
          02 XKONUK-KUR-DEGERI      PIC 9(9)V9(05) COMP-3.
          02 XKONUK-DV-DEGERI       PIC 9(12)V99   COMP-3.

          02 XKONUK-ACIK.
             03 XKONUK-ACIK-1       PIC X(20).
             03 XKONUK-ACIK-2       PIC X(20).
          02 XKONUK-KARTNO          PIC X(07).
          02 XKONUK-REOPEN          PIC X.
          02 XKONUK-OPERATOR        PIC XX.
          02 xkonuk-grup-no         pic 9(06).
          02 xkonuk-al-tar.
             05 xkonuk-al-yil        pic 99.
             05 xkonuk-al-ay         pic 99.
             05 xkonuk-al-gun        pic 99.
          02 XKONUK-PAZAR           PIC X(02).
          02 XKONUK-EB              PIC X.
          02 XKONUK-FIYAT-FIX       PIC X.
          02 XKONUK-GELIS-SAYISI    PIC 9(2).
          02 XKONUK-FIYAT-KONUMU    PIC 99.
          02 XKONUK-GEC-GIRIS       PIC 9.
          02 XKONUK-FAT-NO          PIC 9(06).
          02 XKONUK-UG-INDIRIMI     PIC 9.
          02 XKONUK-BILBORD-EH      PIC X.
          02 XKONUK-EXTRA-REZ-NO    PIC 9(08).
          02 XKONUK-TITLE           PIC X(3).
          02 xkonuk-profil-no       pic 9(8).
          02 xkonuk-rehber          pic x(2).
          02 XKONUK-SAFE            PIC 9.
          02 XKONUK-ANAHTAR         PIC 9.
          02 XKONUK-LATE-ZAMAN.
            03 XKONUK-LATE-GEL-SAAT PIC 99.
            03 XKONUK-LATE-GEL-DAK  PIC 99.
          02 XKONUK-AKSIYON-EH      PIC X.
          02 xkonuk-share           pic 9.
          02 xkonuk-special-eh      pic 9.
          02 XKONUK-sehir           PIC X(03).
          
          02 XKONUK-firma           PIC X(05).
          02 XKONUK-STAF            PIC X(04).
