       FD yanrez LABEL RECORD STANDARD.
       01 yanrez-REC.
          02 yanrez-ANAH.
             03 yanrez-rezno       PIC 9(08).
             03 yanrez-sirano      pic 99.
          02 yanrez-DURUMU         PIC X.
*********> yanrez-Durumu   => Folionun iceridemi yoksa histroyde mi oldugunu
*********> belirtir...I-> Iceride H->Historyde Gibi............
        
          02 yanrez-gerisi.
          03 yanrez-ADI            PIC X(20).
          03 yanrez-SOYADI         PIC X(20).
          03 yanrez-ODANO          PIC X(04).
          03 yanrez-uyruk          PIC X(04).
          03 yanrez-GEL-TAR.
             04 yanrez-GEL-YIL     PIC 9999.
             04 yanrez-GEL-AY      PIC 99.
             04 yanrez-GEL-GUN     PIC 99.
          03 yanrez-GIT-TAR.
             04 yanrez-GIT-YIL     PIC 9999.
             04 yanrez-GIT-AY      PIC 99.
             04 yanrez-GIT-GUN     PIC 99.
          03 yanrez-GEL-ZAMAN.
             04 yanrez-GEL-SAAT     PIC 99.
             04 yanrez-GEL-DAKIKA   PIC 99.
             04 yanrez-GEL-SANIYE   PIC 99.
          03 yanrez-GIT-ZAMAN.
             04 yanrez-GIT-SAAT     PIC 99.
             04 yanrez-GIT-DAKIKA   PIC 99.
             04 yanrez-GIT-SANIYE   PIC 99.
          03 yanrez-tckimlikno      pic 9(11).
          03 yanrez-babaadi         pic x(20).
          03 yanrez-anaadi          pic x(20).
          03 yanrez-dyeri           pic x(40).
          03 yanrez-dog-tar.
             04 yanrez-dog-YIL     PIC 9999.
             04 yanrez-dog-AY      PIC 99.
             04 yanrez-dog-GUN     PIC 99.
          03 yanrez-kturu          pic x.
          03 yanrez-kseri          pic x(20).
          03 yanrez-nil            pic x(20).
          03 yanrez-nilce          pic x(20).
          03 yanrez-nmahalle       pic x(20).
          03 yanrez-ncilt          pic x(15).
          03 yanrez-naile          pic x(15).
          03 yanrez-nsira          pic x(15).
          03 yanrez-cinsiyet       pic x.
          03 yanrez-medeni         pic x.
          03 yanrez-isi            pic x(20).
          03 yanrez-adr            pic x(100).
          03 yanrez-plaka          pic x(20).
          03 yanrez-prb            pic x.
          03 yanrez-prb-ack        pic x(57).
          03 yanrez-folio-no       pic 9(08).
          03 yanrez-profil-anah.
            05 yanrez-profil-sirket pic x(08).
            05 yanrez-profil-no     pic 9(08).
          03 yanrez-BOS            PIC X(66).
          03 yanrez-STAF           PIC X(04).
          

