
*
 fd zyrt label record standard.
   01 zyrt-rec.
     02 zyrt-anah.
        03 zyrt-kod              pic 9(6).
        03 zyrt-kartno           pic 9(6).
     02 zyrt-adi                 pic x(20).
     02 zyrt-soyadi              pic x(20).
     02 zyrt-ktip                pic x(2).
     02 zyrt-tcno                pic 9(11).
     02 zyrt-eno                 pic 9(10).
     02 zyrt-dyer                pic x(15).
     02 zyrt-zyer                pic x(15).
     02 zyrt-dtar.
        03 zyrt-dyil             pic 9(4).
        03 zyrt-day              pic 9(2).
        03 zyrt-dgun             pic 9(2).
     02 gir-tar.
        03 gir-yil               pic 9(4).
        03 gir-ay                pic 9(2).
        03 gir-gun               pic 9(2).
     02 cik-tar.  
        03 cik-yil               pic 9(4). 
        03 cik-ay                pic 9(2).
        03 cik-gun               pic 9(2).
     02 gir-zaman.
        03 gir-saat              pic 9(2).
        03 gir-dakka             pic 9(2).
     02 oto-sira                 pic 9(4).
     02 zyrt-giryer              pic x(2).
     02 zyrt-plaka               pic x(08).
     02 zyrt-firma               pic x(50).
     02 zyrt-goryer              pic x(15).
     02 zyrt-odano               pic x(5).
     02 zyrt-durum.
        03 zyrt-giris               pic x.
        03 zyrt-cikis               pic x.
     02 cik-zaman.
        03 cik-saat              pic 9(2).
        03 cik-dakka             pic 9(2).
     02 zyrt-gorus               pic x(20).
     02 zyrt-gorseb              pic x(15).
     02 zyrt-aciklama            pic x(67).
     02 zyrt-gorkisi             pic x(20).
     02 zyrt-kisi                pic 9(3).
     02 zyrt-bos                 pic x(377).


